[Killed] BlockStatement
packages/validation/src/sanitize.ts:34:37
 /**
  * Check for XSS patterns (creates new regex each time to avoid state issues)
  */
-function getXssPatterns(): RegExp[] {
-  return [
-    /<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi,
-    /javascript:/gi,
-    /vbscript:/gi,
-    /on\w+\s*=/gi,
-    /data:text\/html/gi,
-    /expression\s*\(/gi,
-    /<iframe/gi,
-    /<object/gi,
-    /<embed/gi,
-    /<form/gi,
-  ];
-}
+function getXssPatterns(): RegExp[] {}
 
 /**
killedBy: sanitizeMiddleware should sanitize PUT request body
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello"
Received: "<b>Hello</b>"

[Killed] ArrayDeclaration
packages/validation/src/sanitize.ts:35:10
  * Check for XSS patterns (creates new regex each time to avoid state issues)
  */
 function getXssPatterns(): RegExp[] {
-  return [
-    /<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi,
-    /javascript:/gi,
-    /vbscript:/gi,
-    /on\w+\s*=/gi,
-    /data:text\/html/gi,
-    /expression\s*\(/gi,
-    /<iframe/gi,
-    /<object/gi,
-    /<embed/gi,
-    /<form/gi,
-  ];
+  return [];
 }
 
killedBy: sanitizeMiddleware should reject requests with XSS patterns when enabled
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] Regex
packages/validation/src/sanitize.ts:36:5
  */
 function getXssPatterns(): RegExp[] {
   return [
-    /<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi,
+    /<script\b[^<](?:(?!<\/script>)<[^<]*)*<\/script>/gi,
     /javascript:/gi,
     /vbscript:/gi,
killedBy: sanitizeMiddleware should reject requests with XSS patterns when enabled
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] Regex
packages/validation/src/sanitize.ts:36:5
  */
 function getXssPatterns(): RegExp[] {
   return [
-    /<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi,
+    /<script\b[<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi,
     /javascript:/gi,
     /vbscript:/gi,
killedBy: sanitizeMiddleware should reject requests with XSS patterns when enabled
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] Regex
packages/validation/src/sanitize.ts:39:5
     /<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi,
     /javascript:/gi,
     /vbscript:/gi,
-    /on\w+\s*=/gi,
+    /on\w+\s=/gi,
     /data:text\/html/gi,
     /expression\s*\(/gi,
killedBy: containsXss() — property-based known XSS payloads return true
statusReason: Error: Property failed after 2 tests
{ seed: 149577717, path: "1", endOnFailure: true }
Counterexample: ["\"><img src=x onerror=alert(1)>"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] Regex
packages/validation/src/sanitize.ts:41:5
     /vbscript:/gi,
     /on\w+\s*=/gi,
     /data:text\/html/gi,
-    /expression\s*\(/gi,
+    /expression\S*\(/gi,
     /<iframe/gi,
     /<object/gi,
killedBy: containsXss — regex mutation killers detects expression with spaces before paren — kills \s→\S mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/validation/src/sanitize.ts:73:5
     // natural English like "Select the best option")
     /\b(SELECT|INSERT|UPDATE|DELETE|DROP|TRUNCATE|EXEC|EXECUTE)\b.{0,50}\b(FROM|INTO|WHERE|TABLE|DATABASE|SCHEMA|SET)\b/gi,
     // Unconditional destructive without clause (DROP TABLE / DROP DATABASE)
-    /\bDROP\s+(TABLE|DATABASE|SCHEMA|INDEX|VIEW|PROCEDURE|TRIGGER)\b/gi,
+    /\bDROP\s(TABLE|DATABASE|SCHEMA|INDEX|VIEW|PROCEDURE|TRIGGER)\b/gi,
     // UNION SELECT in any form (with optional comments/whitespace between words)
     /UNION[\s/]*SELECT/gi,
killedBy: containsSqlInjection — quantifier mutation killers (unique coverage) detects DROP  VIEW with 2 spaces — kills \s+→\s mutation in DROP pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/validation/src/sanitize.ts:75:5
     // Unconditional destructive without clause (DROP TABLE / DROP DATABASE)
     /\bDROP\s+(TABLE|DATABASE|SCHEMA|INDEX|VIEW|PROCEDURE|TRIGGER)\b/gi,
     // UNION SELECT in any form (with optional comments/whitespace between words)
-    /UNION[\s/]*SELECT/gi,
+    /UNION[\S/]*SELECT/gi,
     // Comment sequences used to terminate queries (after a quote)
     /['"`]\s*--/g,
killedBy: containsSqlInjection — regex mutation killers detects UNION with spaces — kills \s→\S mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/validation/src/sanitize.ts:77:5
     // UNION SELECT in any form (with optional comments/whitespace between words)
     /UNION[\s/]*SELECT/gi,
     // Comment sequences used to terminate queries (after a quote)
-    /['"`]\s*--/g,
+    /['"`]\S*--/g,
     /['"`]\s*\/\*/g,
     // MySQL inline comment syntax used to hide keywords
killedBy: containsSqlInjection — regex mutation killers detects quote with space before -- — kills \s*→\S* mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/validation/src/sanitize.ts:78:5
     /UNION[\s/]*SELECT/gi,
     // Comment sequences used to terminate queries (after a quote)
     /['"`]\s*--/g,
-    /['"`]\s*\/\*/g,
+    /['"`]\S*\/\*/g,
     // MySQL inline comment syntax used to hide keywords
     /\/\*![\s\S]*?\*\//g,
killedBy: containsSqlInjection — regex mutation killers detects quote with space before /* — kills \s*→\S* mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/validation/src/sanitize.ts:80:5
     /['"`]\s*--/g,
     /['"`]\s*\/\*/g,
     // MySQL inline comment syntax used to hide keywords
-    /\/\*![\s\S]*?\*\//g,
+    /\/\*![^\s\S]*?\*\//g,
     // Stacked query: semicolon followed by a destructive keyword
     /;\s*(DROP|DELETE|TRUNCATE|INSERT|UPDATE|CREATE|ALTER|EXEC)\b/gi,
killedBy: containsSqlInjection — regex mutation killers detects /*!...*/ with newline in it — kills [\s\S]→[\S\S] mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/validation/src/sanitize.ts:84:5
     // Stacked query: semicolon followed by a destructive keyword
     /;\s*(DROP|DELETE|TRUNCATE|INSERT|UPDATE|CREATE|ALTER|EXEC)\b/gi,
     // Boolean tautologies — single-quoted
-    /'\s*OR\s*'[^']*'\s*=\s*'[^']*'?/gi,
+    /'\s*OR\s*'[^']*'\s*=\S*'[^']*'?/gi,
     /'\s*OR\s+\d+\s*=\s*\d+/gi,
     // Boolean tautologies — double-quoted
killedBy: containsSqlInjection — regex mutation killers detects ' OR with multiple spaces — kills \s*→\S* mutations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/validation/src/sanitize.ts:84:5
     // Stacked query: semicolon followed by a destructive keyword
     /;\s*(DROP|DELETE|TRUNCATE|INSERT|UPDATE|CREATE|ALTER|EXEC)\b/gi,
     // Boolean tautologies — single-quoted
-    /'\s*OR\s*'[^']*'\s*=\s*'[^']*'?/gi,
+    /'\s*OR\s*'[^']*'\s=\s*'[^']*'?/gi,
     /'\s*OR\s+\d+\s*=\s*\d+/gi,
     // Boolean tautologies — double-quoted
killedBy: containsSqlInjection() — property-based known SQLi payloads return true
statusReason: Error: Property failed after 6 tests
{ seed: -373825536, path: "5", endOnFailure: true }
Counterexample: ["' OR '1'='1"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] Regex
packages/validation/src/sanitize.ts:85:5
     /;\s*(DROP|DELETE|TRUNCATE|INSERT|UPDATE|CREATE|ALTER|EXEC)\b/gi,
     // Boolean tautologies — single-quoted
     /'\s*OR\s*'[^']*'\s*=\s*'[^']*'?/gi,
-    /'\s*OR\s+\d+\s*=\s*\d+/gi,
+    /'\s*OR\s\d+\s*=\s*\d+/gi,
     // Boolean tautologies — double-quoted
     /"\s*OR\s*"[^"]*"\s*=\s*"[^"]*"?/gi,
killedBy: containsSqlInjection — regex mutation killers detects ' OR 2=2 with spaces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/validation/src/sanitize.ts:85:5
     /;\s*(DROP|DELETE|TRUNCATE|INSERT|UPDATE|CREATE|ALTER|EXEC)\b/gi,
     // Boolean tautologies — single-quoted
     /'\s*OR\s*'[^']*'\s*=\s*'[^']*'?/gi,
-    /'\s*OR\s+\d+\s*=\s*\d+/gi,
+    /'\s*OR\s+\d+\s*=\s*\D+/gi,
     // Boolean tautologies — double-quoted
     /"\s*OR\s*"[^"]*"\s*=\s*"[^"]*"?/gi,
killedBy: containsSqlInjection — regex mutation killers detects ' OR 1=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/validation/src/sanitize.ts:87:5
     /'\s*OR\s*'[^']*'\s*=\s*'[^']*'?/gi,
     /'\s*OR\s+\d+\s*=\s*\d+/gi,
     // Boolean tautologies — double-quoted
-    /"\s*OR\s*"[^"]*"\s*=\s*"[^"]*"?/gi,
+    /"\S*OR\s*"[^"]*"\s*=\s*"[^"]*"?/gi,
     // Inline OR/AND tautologies after a closing quote
     /'\s*OR\s+TRUE\b/gi,
killedBy: containsSqlInjection — regex mutation killers detects double-quote OR tautology
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/validation/src/sanitize.ts:87:5
     /'\s*OR\s*'[^']*'\s*=\s*'[^']*'?/gi,
     /'\s*OR\s+\d+\s*=\s*\d+/gi,
     // Boolean tautologies — double-quoted
-    /"\s*OR\s*"[^"]*"\s*=\s*"[^"]*"?/gi,
+    /"\s*OR\s*"[^"]*"\s=\s*"[^"]*"?/gi,
     // Inline OR/AND tautologies after a closing quote
     /'\s*OR\s+TRUE\b/gi,
killedBy: containsSqlInjection — regex mutation killers detects double-quote OR tautology
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/validation/src/sanitize.ts:89:5
     // Boolean tautologies — double-quoted
     /"\s*OR\s*"[^"]*"\s*=\s*"[^"]*"?/gi,
     // Inline OR/AND tautologies after a closing quote
-    /'\s*OR\s+TRUE\b/gi,
+    /'\S*OR\s+TRUE\b/gi,
     /'\s*AND\s+FALSE\b/gi,
     // Time-based blind injection
killedBy: containsSqlInjection — regex mutation killers detects ' OR TRUE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
packages/validation/src/sanitize.ts:89:5
     // Boolean tautologies — double-quoted
     /"\s*OR\s*"[^"]*"\s*=\s*"[^"]*"?/gi,
     // Inline OR/AND tautologies after a closing quote
-    /'\s*OR\s+TRUE\b/gi,
+    /'\s*OR\sTRUE\b/gi,
     /'\s*AND\s+FALSE\b/gi,
     // Time-based blind injection

[Killed] Regex
packages/validation/src/sanitize.ts:90:5
     /"\s*OR\s*"[^"]*"\s*=\s*"[^"]*"?/gi,
     // Inline OR/AND tautologies after a closing quote
     /'\s*OR\s+TRUE\b/gi,
-    /'\s*AND\s+FALSE\b/gi,
+    /'\s*AND\S+FALSE\b/gi,
     // Time-based blind injection
     /\b(SLEEP|WAITFOR\s+DELAY|BENCHMARK|PG_SLEEP)\s*\(/gi,
killedBy: containsSqlInjection — regex mutation killers detects ' AND FALSE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/validation/src/sanitize.ts:90:5
     /"\s*OR\s*"[^"]*"\s*=\s*"[^"]*"?/gi,
     // Inline OR/AND tautologies after a closing quote
     /'\s*OR\s+TRUE\b/gi,
-    /'\s*AND\s+FALSE\b/gi,
+    /'\sAND\s+FALSE\b/gi,
     // Time-based blind injection
     /\b(SLEEP|WAITFOR\s+DELAY|BENCHMARK|PG_SLEEP)\s*\(/gi,
killedBy: containsSqlInjection — quantifier mutation killers (unique coverage) detects '  AND FALSE with 2 spaces — kills \s*→\s mutation in AND FALSE pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
packages/validation/src/sanitize.ts:94:5
     // Time-based blind injection
     /\b(SLEEP|WAITFOR\s+DELAY|BENCHMARK|PG_SLEEP)\s*\(/gi,
     // Encoding / obfuscation probes
-    /\b(CHAR|CHR|NCHAR)\s*\(\s*\d+/gi,
+    /\b(CHAR|CHR|NCHAR)\s*\(\s*\d/gi,
     /0x[0-9a-f]{6,}/gi,
   ];

[Killed] StringLiteral
packages/validation/src/sanitize.ts:103:3
 const DEFAULT_ALLOWED_TAGS = [
   'p',
   'br',
-  'b',
+  "",
   'i',
   'u',
killedBy: sanitizeHtml should allow safe tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<b>bold</b>"
Received: "bold"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:104:3
   'p',
   'br',
   'b',
-  'i',
+  "",
   'u',
   'strong',
killedBy: sanitizeHtml should allow safe tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<i>italic</i>"
Received: "italic"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:106:3
   'b',
   'i',
   'u',
-  'strong',
+  "",
   'em',
   'h1',
killedBy: sanitizeHtml — allowed tags mutation killers allows <strong> tag
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<strong>"
Received string:    "bold"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:108:3
   'u',
   'strong',
   'em',
-  'h1',
+  "",
   'h2',
   'h3',
killedBy: sanitizeHtml — allowed tags mutation killers allows <h1> tag
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<h1>"
Received string:    "heading"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:111:3
   'h1',
   'h2',
   'h3',
-  'h4',
+  "",
   'h5',
   'h6',
killedBy: sanitizeHtml — every allowed tag preserved (StringLiteral killers) allows <h4> tag
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<h4>"
Received string:    "h4 heading"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:113:3
   'h3',
   'h4',
   'h5',
-  'h6',
+  "",
   'ul',
   'ol',
killedBy: sanitizeHtml — every allowed tag preserved (StringLiteral killers) allows <h6> tag
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<h6>"
Received string:    "h6 heading"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:114:3
   'h4',
   'h5',
   'h6',
-  'ul',
+  "",
   'ol',
   'li',
killedBy: sanitizeHtml — allowed tags mutation killers allows <ul><li> tags
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<ul>"
Received string:    "<li>item</li>"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:115:3
   'h5',
   'h6',
   'ul',
-  'ol',
+  "",
   'li',
   'a',
killedBy: sanitizeHtml — every allowed tag preserved (StringLiteral killers) allows <ol> tag
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<ol>"
Received string:    "<li>item</li>"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:116:3
   'h6',
   'ul',
   'ol',
-  'li',
+  "",
   'a',
   'blockquote',
killedBy: sanitizeHtml — allowed tags mutation killers allows <ul><li> tags
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<li>"
Received string:    "<ul>item</ul>"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:117:3
   'ul',
   'ol',
   'li',
-  'a',
+  "",
   'blockquote',
   'code',
killedBy: sanitizeHtml — every allowed tag preserved (StringLiteral killers) allows <a> tag
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<a>"
Received string:    "link text"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:122:3
   'code',
   'pre',
   'table',
-  'thead',
+  "",
   'tbody',
   'tr',
killedBy: sanitizeHtml — every allowed tag preserved (StringLiteral killers) allows <thead> tag
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<thead>"
Received string:    "<table><tr><th>H</th></tr></table>"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:125:3
   'thead',
   'tbody',
   'tr',
-  'th',
+  "",
   'td',
   'div',
killedBy: sanitizeHtml — every allowed tag preserved (StringLiteral killers) allows <th> tag
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<th>"
Received string:    "<table><tr>header</tr></table>"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:127:3
   'tr',
   'th',
   'td',
-  'div',
+  "",
   'span',
 ];
killedBy: sanitizeHtml — every allowed tag preserved (StringLiteral killers) allows <div> tag
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<div>"
Received string:    "content"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:132:49
 ];
 
 // Default safe attributes
-const DEFAULT_ALLOWED_ATTRS = ['href', 'title', 'alt', 'class', 'id'];
+const DEFAULT_ALLOWED_ATTRS = ['href', 'title', "", 'class', 'id'];
 
 /**
killedBy: sanitizeHtml — allowed attributes preserved (StringLiteral killers) preserves alt attribute — kills "alt"→"" mutation
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "alt"
Received string:    "<a >x</a>"

[Killed] BlockStatement
packages/validation/src/sanitize.ts:137:47
 /**
  * Strip all HTML tags from a string
  */
-function stripHtmlTags(input: string): string {
-  // Remove script tags and their content first
-  let result = input.replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '');
-  // Remove style tags and their content
-  result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)*<\/style>/gi, '');
-  // Remove all other HTML tags
-  result = result.replace(/<[^>]+>/g, '');
-  // Decode common HTML entities
-  result = result.replace(/&nbsp;/g, ' ');
-  result = result.replace(/&amp;/g, '&');
-  result = result.replace(/&lt;/g, '<');
-  result = result.replace(/&gt;/g, '>');
-  result = result.replace(/&quot;/g, '"');
-  result = result.replace(/&#39;/g, "'");
-  return result;
-}
+function stripHtmlTags(input: string): string {}
 
 /**
killedBy: emailSchema should accept valid emails
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'split')"

      349 |
      350 |     // Normalize email

[Survived] Regex
packages/validation/src/sanitize.ts:139:30
  */
 function stripHtmlTags(input: string): string {
   // Remove script tags and their content first
-  let result = input.replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '');
+  let result = input.replace(/<script\b[^<]*(?:(?=<\/script>)<[^<]*)*<\/script>/gi, '');
   // Remove style tags and their content
   result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)*<\/style>/gi, '');

[Survived] Regex
packages/validation/src/sanitize.ts:139:30
  */
 function stripHtmlTags(input: string): string {
   // Remove script tags and their content first
-  let result = input.replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '');
+  let result = input.replace(/<script\b[^<]*(?:(?!<\/script>)<[<]*)*<\/script>/gi, '');
   // Remove style tags and their content
   result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)*<\/style>/gi, '');

[Survived] Regex
packages/validation/src/sanitize.ts:141:27
   // Remove script tags and their content first
   let result = input.replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '');
   // Remove style tags and their content
-  result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)*<\/style>/gi, '');
+  result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[<]*)*<\/style>/gi, '');
   // Remove all other HTML tags
   result = result.replace(/<[^>]+>/g, '');

[Killed] Regex
packages/validation/src/sanitize.ts:143:27
   // Remove style tags and their content
   result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)*<\/style>/gi, '');
   // Remove all other HTML tags
-  result = result.replace(/<[^>]+>/g, '');
+  result = result.replace(/<[>]+>/g, '');
   // Decode common HTML entities
   result = result.replace(/&nbsp;/g, ' ');
killedBy: registrationSchema should sanitize name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "John Doe"
Received: "<b>John</b> Doe"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:145:38
   // Remove all other HTML tags
   result = result.replace(/<[^>]+>/g, '');
   // Decode common HTML entities
-  result = result.replace(/&nbsp;/g, ' ');
+  result = result.replace(/&nbsp;/g, "");
   result = result.replace(/&amp;/g, '&');
   result = result.replace(/&lt;/g, '<');
killedBy: stripHtmlTags (via sanitizeString) — regex mutation killers decodes &nbsp; to space
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a b"
Received: "ab"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:146:37
   result = result.replace(/<[^>]+>/g, '');
   // Decode common HTML entities
   result = result.replace(/&nbsp;/g, ' ');
-  result = result.replace(/&amp;/g, '&');
+  result = result.replace(/&amp;/g, "");
   result = result.replace(/&lt;/g, '<');
   result = result.replace(/&gt;/g, '>');
killedBy: stripHtmlTags (via sanitizeString) — regex mutation killers decodes &amp; entity
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "&"
Received string:    "Tom  Jerry"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:148:36
   result = result.replace(/&nbsp;/g, ' ');
   result = result.replace(/&amp;/g, '&');
   result = result.replace(/&lt;/g, '<');
-  result = result.replace(/&gt;/g, '>');
+  result = result.replace(/&gt;/g, "");
   result = result.replace(/&quot;/g, '"');
   result = result.replace(/&#39;/g, "'");
killedBy: stripHtmlTags (via sanitizeString) — regex mutation killers decodes &lt; and &gt;
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: ">"
Received string:    "a < b  c"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:149:38
   result = result.replace(/&amp;/g, '&');
   result = result.replace(/&lt;/g, '<');
   result = result.replace(/&gt;/g, '>');
-  result = result.replace(/&quot;/g, '"');
+  result = result.replace(/&quot;/g, "");
   result = result.replace(/&#39;/g, "'");
   return result;
killedBy: stripHtmlTags (via sanitizeString) — regex mutation killers decodes &quot;
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\""
Received string:    "say hello"

[Killed] BooleanLiteral
packages/validation/src/sanitize.ts:161:12
 export function sanitizeString(input: unknown, options: SanitizeStringOptions = {}): string {
   const {
     maxLength = 1000,
-    trim = true,
+    trim = false,
     lowercase = false,
     stripHtml = true,
killedBy: sanitizeString — method expression mutation killers trim() removes leading whitespace
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "h"
Received: " "

[Killed] BooleanLiteral
packages/validation/src/sanitize.ts:162:17
   const {
     maxLength = 1000,
     trim = true,
-    lowercase = false,
+    lowercase = true,
     stripHtml = true,
     escapeHtml = true,
killedBy: sanitizeString — method expression mutation killers lowercase=false preserves case (default)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello World"
Received: "hello world"

[Killed] BooleanLiteral
packages/validation/src/sanitize.ts:163:17
     maxLength = 1000,
     trim = true,
     lowercase = false,
-    stripHtml = true,
+    stripHtml = false,
     escapeHtml = true,
     removeNullBytes = true,
killedBy: sanitizeObject — mutation killers sanitizes string values in object — kills return-early mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test"
Received: "&lt;b&gt;test&lt;&#x2F;b&gt;"

[Survived] BooleanLiteral
packages/validation/src/sanitize.ts:164:18
     trim = true,
     lowercase = false,
     stripHtml = true,
-    escapeHtml = true,
+    escapeHtml = false,
     removeNullBytes = true,
   } = options;

[Killed] BooleanLiteral
packages/validation/src/sanitize.ts:165:23
     lowercase = false,
     stripHtml = true,
     escapeHtml = true,
-    removeNullBytes = true,
+    removeNullBytes = false,
   } = options;
 
killedBy: sanitizeString — method expression mutation killers null byte removal eliminates \0 chars
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello"
Received: "he llo "

[Killed] EqualityOperator
packages/validation/src/sanitize.ts:169:7
   } = options;
 
   // Handle non-string input
-  if (input === null || input === undefined) {
+  if (input !== null || input === undefined) {
     return '';
   }
killedBy: sanitizeMiddleware should sanitize POST request body
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "John"
Received: ""

[Killed] BlockStatement
packages/validation/src/sanitize.ts:169:46
   } = options;
 
   // Handle non-string input
-  if (input === null || input === undefined) {
-    return '';
-  }
+  if (input === null || input === undefined) {}
 
   let result = String(input);
killedBy: sanitizeString should handle null and undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "null"

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:176:7
   let result = String(input);
 
   // Remove null bytes (can be used to bypass filters)
-  if (removeNullBytes) {
+  if (true) {
     result = result.replace(/\0/g, '');
   }
killedBy: sanitizeString — method expression mutation killers removeNullBytes=false preserves null bytes
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: " "
Received string:    "hello"

[Killed] BlockStatement
packages/validation/src/sanitize.ts:176:24
   let result = String(input);
 
   // Remove null bytes (can be used to bypass filters)
-  if (removeNullBytes) {
-    result = result.replace(/\0/g, '');
-  }
+  if (removeNullBytes) {}
 
   // Strip HTML tags if requested
killedBy: sanitizeString should remove null bytes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "helloworld"
Received: "hello world"

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:181:7
   }
 
   // Strip HTML tags if requested
-  if (stripHtml) {
+  if (true) {
     result = stripHtmlTags(result);
   }
killedBy: sanitizeString — method expression mutation killers escapeHtml=true stripHtml=false → escapes angle brackets
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "&lt;"
Received string:    "text"

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:181:7
   }
 
   // Strip HTML tags if requested
-  if (stripHtml) {
+  if (false) {
     result = stripHtmlTags(result);
   }
killedBy: sanitizeString should strip HTML tags by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello"
Received: "<b>hello</b>"

[Killed] BooleanLiteral
packages/validation/src/sanitize.ts:186:21
   }
 
   // Escape HTML entities if requested (and not already stripped)
-  if (escapeHtml && !stripHtml) {
+  if (escapeHtml && stripHtml) {
     result = validator.escape(result);
   }
killedBy: sanitizeString — method expression mutation killers escapeHtml=true stripHtml=false → escapes angle brackets
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "<b>"
Received string:        "<b>text</b>"

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:186:7
   }
 
   // Escape HTML entities if requested (and not already stripped)
-  if (escapeHtml && !stripHtml) {
+  if (true) {
     result = validator.escape(result);
   }
killedBy: sanitizeString — method expression mutation killers escapeHtml=false stripHtml=false → keeps raw HTML
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<b>text</b>"
Received: "&lt;b&gt;text&lt;&#x2F;b&gt;"

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:191:7
   }
 
   // Trim whitespace
-  if (trim) {
+  if (true) {
     result = result.trim();
   }
killedBy: sanitizeString — method expression mutation killers trim=false preserves leading whitespace
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "   hello"
Received: "hello"

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:191:7
   }
 
   // Trim whitespace
-  if (trim) {
+  if (false) {
     result = result.trim();
   }
killedBy: sanitizeString() — property-based with trim:true, output has no leading/trailing whitespace
statusReason: Error: Property failed after 16 tests
{ seed: -126723437, path: "15", endOnFailure: true }
Counterexample: [" "]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
packages/validation/src/sanitize.ts:192:14
 
   // Trim whitespace
   if (trim) {
-    result = result.trim();
+    result = result;
   }
 
killedBy: sanitizeString() — property-based with trim:true, output has no leading/trailing whitespace
statusReason: Error: Property failed after 33 tests
{ seed: -411550077, path: "32:1", endOnFailure: true }
Counterexample: [" "]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
