[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:8:52
 
 // ─── Basic hash functions — return hex digest ────────────────────────────────
 
-export function md5(data: string | Buffer): string {
-  return createHash('md5').update(data).digest('hex');
-}
+export function md5(data: string | Buffer): string {}
 
 export function sha1(data: string | Buffer): string {
killedBy: md5 md5 test 0: length=32 for input-0
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:12:53
   return createHash('md5').update(data).digest('hex');
 }
 
-export function sha1(data: string | Buffer): string {
-  return createHash('sha1').update(data).digest('hex');
-}
+export function sha1(data: string | Buffer): string {}
 
 export function sha256(data: string | Buffer): string {
killedBy: sha1 sha1 test 0: length=40 for input-0
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:16:55
   return createHash('sha1').update(data).digest('hex');
 }
 
-export function sha256(data: string | Buffer): string {
-  return createHash('sha256').update(data).digest('hex');
-}
+export function sha256(data: string | Buffer): string {}
 
 export function sha384(data: string | Buffer): string {
killedBy: sha256 sha256 test 0: deterministic hex output for string-0
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] StringLiteral
packages/hash-utils/src/hash-utils.ts:17:21
 }
 
 export function sha256(data: string | Buffer): string {
-  return createHash('sha256').update(data).digest('hex');
+  return createHash("").update(data).digest('hex');
 }
 
killedBy: sha256 sha256 test 0: deterministic hex output for string-0
statusReason: Error: Digest method not supported

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:20:55
   return createHash('sha256').update(data).digest('hex');
 }
 
-export function sha384(data: string | Buffer): string {
-  return createHash('sha384').update(data).digest('hex');
-}
+export function sha384(data: string | Buffer): string {}
 
 export function sha512(data: string | Buffer): string {
killedBy: sha384 sha384 returns 96-char hex string
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:24:55
   return createHash('sha384').update(data).digest('hex');
 }
 
-export function sha512(data: string | Buffer): string {
-  return createHash('sha512').update(data).digest('hex');
-}
+export function sha512(data: string | Buffer): string {}
 
 export function sha3_256(data: string | Buffer): string {
killedBy: sha512 sha512 test 0: length=128 for input-0
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] StringLiteral
packages/hash-utils/src/hash-utils.ts:25:21
 }
 
 export function sha512(data: string | Buffer): string {
-  return createHash('sha512').update(data).digest('hex');
+  return createHash("").update(data).digest('hex');
 }
 
killedBy: sha512 sha512 test 0: length=128 for input-0
statusReason: Error: Digest method not supported

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:28:57
   return createHash('sha512').update(data).digest('hex');
 }
 
-export function sha3_256(data: string | Buffer): string {
-  return createHash('sha3-256').update(data).digest('hex');
-}
+export function sha3_256(data: string | Buffer): string {}
 
 // ─── Generic hash with algorithm selection ───────────────────────────────────
killedBy: sha3_256 sha3_256 returns 64-char hex string
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] StringLiteral
packages/hash-utils/src/hash-utils.ts:29:21
 }
 
 export function sha3_256(data: string | Buffer): string {
-  return createHash('sha3-256').update(data).digest('hex');
+  return createHash("").update(data).digest('hex');
 }
 
killedBy: sha3_256 sha3_256 returns 64-char hex string
statusReason: Error: Digest method not supported

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:36:79
 
 export type HashAlgorithm = 'md5' | 'sha1' | 'sha256' | 'sha384' | 'sha512' | 'sha3-256' | 'sha3-512';
 
-export function hash(data: string | Buffer, algorithm: HashAlgorithm): string {
-  return createHash(algorithm).update(data).digest('hex');
-}
+export function hash(data: string | Buffer, algorithm: HashAlgorithm): string {}
 
 // ─── Output encoding variants ────────────────────────────────────────────────
killedBy: hash (generic) hash with md5 algorithm returns 32-char hex
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:42:61
 
 // ─── Output encoding variants ────────────────────────────────────────────────
 
-export function sha256Base64(data: string | Buffer): string {
-  return createHash('sha256').update(data).digest('base64');
-}
+export function sha256Base64(data: string | Buffer): string {}
 
 export function sha256Buffer(data: string | Buffer): Buffer {
killedBy: sha256Base64 sha256Base64 length is 44 chars for 32-byte hash
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:46:61
   return createHash('sha256').update(data).digest('base64');
 }
 
-export function sha256Buffer(data: string | Buffer): Buffer {
-  return createHash('sha256').update(data).digest();
-}
+export function sha256Buffer(data: string | Buffer): Buffer {}
 
 export function sha256Uint8(data: string | Buffer): Uint8Array {
killedBy: sha256Buffer sha256Buffer returns a Buffer
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Buffer

Received value has no prototype
Received value: undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:50:64
   return createHash('sha256').update(data).digest();
 }
 
-export function sha256Uint8(data: string | Buffer): Uint8Array {
-  return new Uint8Array(sha256Buffer(data));
-}
+export function sha256Uint8(data: string | Buffer): Uint8Array {}
 
 // ─── HMAC ────────────────────────────────────────────────────────────────────
killedBy: sha256Uint8 sha256Uint8 returns Uint8Array
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Uint8Array

Received value has no prototype
Received value: undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:56:81
 
 // ─── HMAC ────────────────────────────────────────────────────────────────────
 
-export function hmacSha256(key: string | Buffer, data: string | Buffer): string {
-  return createHmac('sha256', key).update(data).digest('hex');
-}
+export function hmacSha256(key: string | Buffer, data: string | Buffer): string {}
 
 export function hmacSha512(key: string | Buffer, data: string | Buffer): string {
killedBy: hmacSha256 hmacSha256 test 0: hex length=64 for key-0
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] StringLiteral
packages/hash-utils/src/hash-utils.ts:57:21
 // ─── HMAC ────────────────────────────────────────────────────────────────────
 
 export function hmacSha256(key: string | Buffer, data: string | Buffer): string {
-  return createHmac('sha256', key).update(data).digest('hex');
+  return createHmac("", key).update(data).digest('hex');
 }
 
killedBy: hmacSha256 hmacSha256 test 0: hex length=64 for key-0
statusReason: TypeError: Invalid digest:

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:60:81
   return createHmac('sha256', key).update(data).digest('hex');
 }
 
-export function hmacSha512(key: string | Buffer, data: string | Buffer): string {
-  return createHmac('sha512', key).update(data).digest('hex');
-}
+export function hmacSha512(key: string | Buffer, data: string | Buffer): string {}
 
 export function hmacMd5(key: string | Buffer, data: string | Buffer): string {
killedBy: hmacSha512 hmacSha512 returns 128-char hex
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:64:78
   return createHmac('sha512', key).update(data).digest('hex');
 }
 
-export function hmacMd5(key: string | Buffer, data: string | Buffer): string {
-  return createHmac('md5', key).update(data).digest('hex');
-}
+export function hmacMd5(key: string | Buffer, data: string | Buffer): string {}
 
 export function hmac(algorithm: HashAlgorithm, key: string | Buffer, data: string | Buffer): string {
killedBy: hmacMd5 hmacMd5 returns 32-char hex
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:68:101
   return createHmac('md5', key).update(data).digest('hex');
 }
 
-export function hmac(algorithm: HashAlgorithm, key: string | Buffer, data: string | Buffer): string {
-  return createHmac(algorithm, key).update(data).digest('hex');
-}
+export function hmac(algorithm: HashAlgorithm, key: string | Buffer, data: string | Buffer): string {}
 
 // ─── Verify HMAC (constant-time comparison) ──────────────────────────────────
killedBy: verifyHmac verifyHmac test 0: correct HMAC verifies to true
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:79:12
   key: string | Buffer,
   data: string | Buffer,
   expected: string,
-): boolean {
-  const computed = hmac(algorithm, key, data);
-  if (computed.length !== expected.length) return false;
-  try {
-    return cryptoTimingSafeEqual(Buffer.from(computed, 'hex'), Buffer.from(expected, 'hex'));
-  } catch {
-    return false;
-  }
-}
+): boolean {}
 
 // ─── Constant-time comparison of two hex strings ─────────────────────────────
killedBy: verifyHmac verifyHmac test 0: correct HMAC verifies to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
packages/hash-utils/src/hash-utils.ts:81:7
   expected: string,
 ): boolean {
   const computed = hmac(algorithm, key, data);
-  if (computed.length !== expected.length) return false;
+  if (computed.length === expected.length) return false;
   try {
     return cryptoTimingSafeEqual(Buffer.from(computed, 'hex'), Buffer.from(expected, 'hex'));
killedBy: verifyHmac verifyHmac test 0: correct HMAC verifies to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
packages/hash-utils/src/hash-utils.ts:81:51
   expected: string,
 ): boolean {
   const computed = hmac(algorithm, key, data);
-  if (computed.length !== expected.length) return false;
+  if (computed.length !== expected.length) return true;
   try {
     return cryptoTimingSafeEqual(Buffer.from(computed, 'hex'), Buffer.from(expected, 'hex'));
killedBy: verifyHmac with other algorithms verifyHmac returns false for empty expected vs computed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:82:7
 ): boolean {
   const computed = hmac(algorithm, key, data);
   if (computed.length !== expected.length) return false;
-  try {
-    return cryptoTimingSafeEqual(Buffer.from(computed, 'hex'), Buffer.from(expected, 'hex'));
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: verifyHmac verifyHmac test 0: correct HMAC verifies to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] StringLiteral
packages/hash-utils/src/hash-utils.ts:83:56
   const computed = hmac(algorithm, key, data);
   if (computed.length !== expected.length) return false;
   try {
-    return cryptoTimingSafeEqual(Buffer.from(computed, 'hex'), Buffer.from(expected, 'hex'));
+    return cryptoTimingSafeEqual(Buffer.from(computed, ""), Buffer.from(expected, 'hex'));
   } catch {
     return false;
killedBy: verifyHmac verifyHmac test 0: correct HMAC verifies to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BlockStatement
packages/hash-utils/src/hash-utils.ts:84:11
   if (computed.length !== expected.length) return false;
   try {
     return cryptoTimingSafeEqual(Buffer.from(computed, 'hex'), Buffer.from(expected, 'hex'));
-  } catch {
-    return false;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:91:64
 
 // ─── Constant-time comparison of two hex strings ─────────────────────────────
 
-export function timingSafeEqual(a: string, b: string): boolean {
-  if (a.length !== b.length) return false;
-  try {
-    const bufA = Buffer.from(a);
-    const bufB = Buffer.from(b);
-    return cryptoTimingSafeEqual(bufA, bufB);
-  } catch {
-    return false;
-  }
-}
+export function timingSafeEqual(a: string, b: string): boolean {}
 
 // ─── File checksum (from Buffer) ─────────────────────────────────────────────
killedBy: timingSafeEqual timingSafeEqual test 0: equal strings return true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
packages/hash-utils/src/hash-utils.ts:92:7
 // ─── Constant-time comparison of two hex strings ─────────────────────────────
 
 export function timingSafeEqual(a: string, b: string): boolean {
-  if (a.length !== b.length) return false;
+  if (a.length === b.length) return false;
   try {
     const bufA = Buffer.from(a);
killedBy: timingSafeEqual timingSafeEqual test 0: equal strings return true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
packages/hash-utils/src/hash-utils.ts:92:37
 // ─── Constant-time comparison of two hex strings ─────────────────────────────
 
 export function timingSafeEqual(a: string, b: string): boolean {
-  if (a.length !== b.length) return false;
+  if (a.length !== b.length) return true;
   try {
     const bufA = Buffer.from(a);
killedBy: timingSafeEqual edge cases timingSafeEqual returns false for different lengths
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:93:7
 
 export function timingSafeEqual(a: string, b: string): boolean {
   if (a.length !== b.length) return false;
-  try {
-    const bufA = Buffer.from(a);
-    const bufB = Buffer.from(b);
-    return cryptoTimingSafeEqual(bufA, bufB);
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: timingSafeEqual timingSafeEqual test 0: equal strings return true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[NoCoverage] BlockStatement
packages/hash-utils/src/hash-utils.ts:97:11
     const bufA = Buffer.from(a);
     const bufB = Buffer.from(b);
     return cryptoTimingSafeEqual(bufA, bufB);
-  } catch {
-    return false;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:104:85
 
 // ─── File checksum (from Buffer) ─────────────────────────────────────────────
 
-export function checksum(data: Buffer, algorithm: HashAlgorithm = 'sha256'): string {
-  return createHash(algorithm).update(data).digest('hex');
-}
+export function checksum(data: Buffer, algorithm: HashAlgorithm = 'sha256'): string {}
 
 // ─── Integrity: generate and verify ──────────────────────────────────────────
killedBy: checksum checksum defaults to sha256 (64-char hex)
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:110:103
 
 // ─── Integrity: generate and verify ──────────────────────────────────────────
 
-export function generateIntegrity(data: string | Buffer, algorithm: HashAlgorithm = 'sha256'): string {
-  const digest = createHash(algorithm).update(data).digest('base64');
-  return `${algorithm}-${digest}`;
-}
+export function generateIntegrity(data: string | Buffer, algorithm: HashAlgorithm = 'sha256'): string {}
 
 export function verifyIntegrity(data: string | Buffer, integrity: string): boolean {
killedBy: generateIntegrity / verifyIntegrity integrity roundtrip test 0: generated integrity verifies
statusReason: Error: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] StringLiteral
packages/hash-utils/src/hash-utils.ts:112:10
 
 export function generateIntegrity(data: string | Buffer, algorithm: HashAlgorithm = 'sha256'): string {
   const digest = createHash(algorithm).update(data).digest('base64');
-  return `${algorithm}-${digest}`;
+  return ``;
 }
 
killedBy: generateIntegrity / verifyIntegrity integrity roundtrip test 0: generated integrity verifies
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^sha256-/
Received string:  ""

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:115:84
   return `${algorithm}-${digest}`;
 }
 
-export function verifyIntegrity(data: string | Buffer, integrity: string): boolean {
-  const dashIdx = integrity.indexOf('-');
-  if (dashIdx === -1) return false;
-  const algorithm = integrity.slice(0, dashIdx) as HashAlgorithm;
-  const expectedBase64 = integrity.slice(dashIdx + 1);
-  try {
-    const computed = createHash(algorithm).update(data).digest('base64');
-    return computed === expectedBase64;
-  } catch {
-    return false;
-  }
-}
+export function verifyIntegrity(data: string | Buffer, integrity: string): boolean {}
 
 // ─── CRC32 (pure JS implementation) ──────────────────────────────────────────
killedBy: generateIntegrity / verifyIntegrity integrity roundtrip test 0: generated integrity verifies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
packages/hash-utils/src/hash-utils.ts:117:7
 
 export function verifyIntegrity(data: string | Buffer, integrity: string): boolean {
   const dashIdx = integrity.indexOf('-');
-  if (dashIdx === -1) return false;
+  if (dashIdx !== -1) return false;
   const algorithm = integrity.slice(0, dashIdx) as HashAlgorithm;
   const expectedBase64 = integrity.slice(dashIdx + 1);
killedBy: generateIntegrity / verifyIntegrity integrity roundtrip test 0: generated integrity verifies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
packages/hash-utils/src/hash-utils.ts:117:7
 
 export function verifyIntegrity(data: string | Buffer, integrity: string): boolean {
   const dashIdx = integrity.indexOf('-');
-  if (dashIdx === -1) return false;
+  if (true) return false;
   const algorithm = integrity.slice(0, dashIdx) as HashAlgorithm;
   const expectedBase64 = integrity.slice(dashIdx + 1);
killedBy: generateIntegrity / verifyIntegrity integrity roundtrip test 0: generated integrity verifies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/hash-utils/src/hash-utils.ts:119:26
   const dashIdx = integrity.indexOf('-');
   if (dashIdx === -1) return false;
   const algorithm = integrity.slice(0, dashIdx) as HashAlgorithm;
-  const expectedBase64 = integrity.slice(dashIdx + 1);
+  const expectedBase64 = integrity;
   try {
     const computed = createHash(algorithm).update(data).digest('base64');
killedBy: generateIntegrity / verifyIntegrity integrity roundtrip test 0: generated integrity verifies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
packages/hash-utils/src/hash-utils.ts:119:42
   const dashIdx = integrity.indexOf('-');
   if (dashIdx === -1) return false;
   const algorithm = integrity.slice(0, dashIdx) as HashAlgorithm;
-  const expectedBase64 = integrity.slice(dashIdx + 1);
+  const expectedBase64 = integrity.slice(dashIdx - 1);
   try {
     const computed = createHash(algorithm).update(data).digest('base64');
killedBy: generateIntegrity / verifyIntegrity integrity roundtrip test 0: generated integrity verifies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:120:7
   if (dashIdx === -1) return false;
   const algorithm = integrity.slice(0, dashIdx) as HashAlgorithm;
   const expectedBase64 = integrity.slice(dashIdx + 1);
-  try {
-    const computed = createHash(algorithm).update(data).digest('base64');
-    return computed === expectedBase64;
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: generateIntegrity / verifyIntegrity integrity roundtrip test 0: generated integrity verifies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] StringLiteral
packages/hash-utils/src/hash-utils.ts:121:64
   const algorithm = integrity.slice(0, dashIdx) as HashAlgorithm;
   const expectedBase64 = integrity.slice(dashIdx + 1);
   try {
-    const computed = createHash(algorithm).update(data).digest('base64');
+    const computed = createHash(algorithm).update(data).digest("");
     return computed === expectedBase64;
   } catch {
killedBy: generateIntegrity / verifyIntegrity integrity roundtrip test 0: generated integrity verifies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
packages/hash-utils/src/hash-utils.ts:122:12
   const expectedBase64 = integrity.slice(dashIdx + 1);
   try {
     const computed = createHash(algorithm).update(data).digest('base64');
-    return computed === expectedBase64;
+    return false;
   } catch {
     return false;
killedBy: generateIntegrity / verifyIntegrity integrity roundtrip test 0: generated integrity verifies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
packages/hash-utils/src/hash-utils.ts:122:12
   const expectedBase64 = integrity.slice(dashIdx + 1);
   try {
     const computed = createHash(algorithm).update(data).digest('base64');
-    return computed === expectedBase64;
+    return computed !== expectedBase64;
   } catch {
     return false;
killedBy: generateIntegrity / verifyIntegrity integrity roundtrip test 0: generated integrity verifies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:123:11
   try {
     const computed = createHash(algorithm).update(data).digest('base64');
     return computed === expectedBase64;
-  } catch {
-    return false;
-  }
+  } catch {}
 }
 
killedBy: generateIntegrity with different algorithms verifyIntegrity returns false for invalid format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:130:38
 
 // ─── CRC32 (pure JS implementation) ──────────────────────────────────────────
 
-const CRC32_TABLE: number[] = (() => {
-  const table: number[] = [];
-  for (let i = 0; i < 256; i++) {
-    let c = i;
-    for (let j = 0; j < 8; j++) {
-      c = c & 1 ? 0xedb88320 ^ (c >>> 1) : c >>> 1;
-    }
-    table.push(c);
-  }
-  return table;
-})();
+const CRC32_TABLE: number[] = (() => {})();
 
 export function crc32(data: string | Buffer): number {
killedBy: crc32 crc32 test 0: non-negative number, deterministic
statusReason: TypeError: Cannot read properties of undefined (reading '156')

[Survived] ConditionalExpression
packages/hash-utils/src/hash-utils.ts:132:19
 
 const CRC32_TABLE: number[] = (() => {
   const table: number[] = [];
-  for (let i = 0; i < 256; i++) {
+  for (let i = 0; false; i++) {
     let c = i;
     for (let j = 0; j < 8; j++) {

[Survived] EqualityOperator
packages/hash-utils/src/hash-utils.ts:132:19
 
 const CRC32_TABLE: number[] = (() => {
   const table: number[] = [];
-  for (let i = 0; i < 256; i++) {
+  for (let i = 0; i <= 256; i++) {
     let c = i;
     for (let j = 0; j < 8; j++) {

[Survived] BlockStatement
packages/hash-utils/src/hash-utils.ts:134:33
   const table: number[] = [];
   for (let i = 0; i < 256; i++) {
     let c = i;
-    for (let j = 0; j < 8; j++) {
-      c = c & 1 ? 0xedb88320 ^ (c >>> 1) : c >>> 1;
-    }
+    for (let j = 0; j < 8; j++) {}
     table.push(c);
   }

[Survived] EqualityOperator
packages/hash-utils/src/hash-utils.ts:134:21
   const table: number[] = [];
   for (let i = 0; i < 256; i++) {
     let c = i;
-    for (let j = 0; j < 8; j++) {
+    for (let j = 0; j >= 8; j++) {
       c = c & 1 ? 0xedb88320 ^ (c >>> 1) : c >>> 1;
     }

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:142:54
   return table;
 })();
 
-export function crc32(data: string | Buffer): number {
-  const buf = typeof data === 'string' ? Buffer.from(data, 'utf8') : data;
-  let crc = 0xffffffff;
-  for (let i = 0; i < buf.length; i++) {
-    crc = CRC32_TABLE[(crc ^ buf[i]) & 0xff] ^ (crc >>> 8);
-  }
-  return (crc ^ 0xffffffff) >>> 0;
-}
+export function crc32(data: string | Buffer): number {}
 
 // ─── Adler32 checksum ────────────────────────────────────────────────────────
killedBy: crc32 crc32 test 0: non-negative number, deterministic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "number"
Received: "undefined"

[Killed] ConditionalExpression
packages/hash-utils/src/hash-utils.ts:143:15
 })();
 
 export function crc32(data: string | Buffer): number {
-  const buf = typeof data === 'string' ? Buffer.from(data, 'utf8') : data;
+  const buf = false ? Buffer.from(data, 'utf8') : data;
   let crc = 0xffffffff;
   for (let i = 0; i < buf.length; i++) {
killedBy: crc32 with Buffer input crc32 Buffer and string with same bytes produce same result
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3859354798
Received: 731408899

[Killed] EqualityOperator
packages/hash-utils/src/hash-utils.ts:143:15
 })();
 
 export function crc32(data: string | Buffer): number {
-  const buf = typeof data === 'string' ? Buffer.from(data, 'utf8') : data;
+  const buf = typeof data !== 'string' ? Buffer.from(data, 'utf8') : data;
   let crc = 0xffffffff;
   for (let i = 0; i < buf.length; i++) {
killedBy: crc32 with Buffer input crc32 Buffer and string with same bytes produce same result
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3859354798
Received: 731408899

[Survived] EqualityOperator
packages/hash-utils/src/hash-utils.ts:145:19
 export function crc32(data: string | Buffer): number {
   const buf = typeof data === 'string' ? Buffer.from(data, 'utf8') : data;
   let crc = 0xffffffff;
-  for (let i = 0; i < buf.length; i++) {
+  for (let i = 0; i >= buf.length; i++) {
     crc = CRC32_TABLE[(crc ^ buf[i]) & 0xff] ^ (crc >>> 8);
   }

[Survived] ConditionalExpression
packages/hash-utils/src/hash-utils.ts:145:19
 export function crc32(data: string | Buffer): number {
   const buf = typeof data === 'string' ? Buffer.from(data, 'utf8') : data;
   let crc = 0xffffffff;
-  for (let i = 0; i < buf.length; i++) {
+  for (let i = 0; false; i++) {
     crc = CRC32_TABLE[(crc ^ buf[i]) & 0xff] ^ (crc >>> 8);
   }

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:153:56
 
 // ─── Adler32 checksum ────────────────────────────────────────────────────────
 
-export function adler32(data: string | Buffer): number {
-  const buf = typeof data === 'string' ? Buffer.from(data, 'utf8') : data;
-  const MOD_ADLER = 65521;
-  let a = 1;
-  let b = 0;
-  for (let i = 0; i < buf.length; i++) {
-    a = (a + buf[i]) % MOD_ADLER;
-    b = (b + a) % MOD_ADLER;
-  }
-  return ((b << 16) | a) >>> 0;
-}
+export function adler32(data: string | Buffer): number {}
 
 // ─── FNV-1a 32-bit hash ───────────────────────────────────────────────────────
killedBy: adler32 adler32 returns a non-negative number
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined
