[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:196:7
   }
 
   // Convert to lowercase
-  if (lowercase) {
+  if (false) {
     result = result.toLowerCase();
   }
killedBy: sanitizeString() — property-based with lowercase:true, output is always lowercase
statusReason: Error: Property failed after 1 tests
{ seed: 248617693, path: "0:1:0:4:1", endOnFailure: true }
Counterexample: ["A"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:196:7
   }
 
   // Convert to lowercase
-  if (lowercase) {
+  if (true) {
     result = result.toLowerCase();
   }
killedBy: sanitizeString — method expression mutation killers lowercase=false preserves case (default)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello World"
Received: "hello world"

[Killed] MethodExpression
packages/validation/src/sanitize.ts:197:14
 
   // Convert to lowercase
   if (lowercase) {
-    result = result.toLowerCase();
+    result = result.toUpperCase();
   }
 
killedBy: sanitizeString() — property-based with lowercase:true, output is always lowercase
statusReason: Error: Property failed after 1 tests
{ seed: -2040955081, path: "0:1:0:0:5:1:2", endOnFailure: true }
Counterexample: ["A"]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
packages/validation/src/sanitize.ts:201:34
   }
 
   // Enforce max length
-  if (result.length > maxLength) {
-    result = result.slice(0, maxLength);
-  }
+  if (result.length > maxLength) {}
 
   return result;
killedBy: sanitizeString() — property-based output length never exceeds maxLength
statusReason: Error: Property failed after 5 tests
{ seed: -203423198, path: "4:1:2:1:1:1:1:1:1:4:6:5:5:5:5:5:5:6:0:0", endOnFailure: true }
Counterexample: ["!",0]
Shrunk 19 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:201:7
   }
 
   // Enforce max length
-  if (result.length > maxLength) {
+  if (false) {
     result = result.slice(0, maxLength);
   }
killedBy: sanitizeString() — property-based output length never exceeds maxLength
statusReason: Error: Property failed after 8 tests
{ seed: 586409641, path: "7:5:3:3:3:3:7:10:13:16:18:20:22:21:21:21:21:22:0:0:0", endOnFailure: true }
Counterexample: ["!",0]
Shrunk 20 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
packages/validation/src/sanitize.ts:202:14
 
   // Enforce max length
   if (result.length > maxLength) {
-    result = result.slice(0, maxLength);
+    result = result;
   }
 
killedBy: sanitizeString() — property-based output length never exceeds maxLength
statusReason: Error: Property failed after 3 tests
{ seed: -883718987, path: "2:4:2:2:2:2:5:7:9:8:8:8:8:9:0:0", endOnFailure: true }
Counterexample: ["!",0]
Shrunk 15 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:215:7
 export function sanitizeHtml(input: unknown, options: SanitizeHtmlOptions = {}): string {
   const { allowedTags = DEFAULT_ALLOWED_TAGS, allowedAttributes = DEFAULT_ALLOWED_ATTRS } = options;
 
-  if (input === null || input === undefined) {
+  if (false) {
     return '';
   }
killedBy: sanitizeHtml should handle null and undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "null"

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:215:7
 export function sanitizeHtml(input: unknown, options: SanitizeHtmlOptions = {}): string {
   const { allowedTags = DEFAULT_ALLOWED_TAGS, allowedAttributes = DEFAULT_ALLOWED_ATTRS } = options;
 
-  if (input === null || input === undefined) {
+  if (false || input === undefined) {
     return '';
   }
killedBy: sanitizeHtml should handle null and undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "null"

[Killed] Regex
packages/validation/src/sanitize.ts:222:27
   let result = String(input);
 
   // Remove dangerous tags completely (with content)
-  result = result.replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '');
+  result = result.replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)<\/script>/gi, '');
   result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)*<\/style>/gi, '');
   result = result.replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[^<]*)*<\/iframe>/gi, '');
killedBy: sanitizeHtml should remove script tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "alert(1)"

[Killed] Regex
packages/validation/src/sanitize.ts:222:27
   let result = String(input);
 
   // Remove dangerous tags completely (with content)
-  result = result.replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '');
+  result = result.replace(/<script\b[^<](?:(?!<\/script>)<[^<]*)*<\/script>/gi, '');
   result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)*<\/style>/gi, '');
   result = result.replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[^<]*)*<\/iframe>/gi, '');
killedBy: sanitizeHtml should remove script tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "alert(1)"

[Killed] Regex
packages/validation/src/sanitize.ts:223:27
 
   // Remove dangerous tags completely (with content)
   result = result.replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '');
-  result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)*<\/style>/gi, '');
+  result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)<\/style>/gi, '');
   result = result.replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[^<]*)*<\/iframe>/gi, '');
   result = result.replace(/<object\b[^<]*(?:(?!<\/object>)<[^<]*)*<\/object>/gi, '');
killedBy: sanitizeHtml — dangerous elements produce empty string (StringLiteral killers) style tag + content removed completely — not replaced with noise
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "body{color:red}"

[Survived] Regex
packages/validation/src/sanitize.ts:223:27
 
   // Remove dangerous tags completely (with content)
   result = result.replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '');
-  result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)*<\/style>/gi, '');
+  result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[<]*)*<\/style>/gi, '');
   result = result.replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[^<]*)*<\/iframe>/gi, '');
   result = result.replace(/<object\b[^<]*(?:(?!<\/object>)<[^<]*)*<\/object>/gi, '');

[Survived] Regex
packages/validation/src/sanitize.ts:224:27
   // Remove dangerous tags completely (with content)
   result = result.replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '');
   result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)*<\/style>/gi, '');
-  result = result.replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[^<]*)*<\/iframe>/gi, '');
+  result = result.replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[^<]*)<\/iframe>/gi, '');
   result = result.replace(/<object\b[^<]*(?:(?!<\/object>)<[^<]*)*<\/object>/gi, '');
   result = result.replace(/<embed\b[^>]*>/gi, '');

[Survived] Regex
packages/validation/src/sanitize.ts:224:27
   // Remove dangerous tags completely (with content)
   result = result.replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '');
   result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)*<\/style>/gi, '');
-  result = result.replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[^<]*)*<\/iframe>/gi, '');
+  result = result.replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[<]*)*<\/iframe>/gi, '');
   result = result.replace(/<object\b[^<]*(?:(?!<\/object>)<[^<]*)*<\/object>/gi, '');
   result = result.replace(/<embed\b[^>]*>/gi, '');

[Killed] StringLiteral
packages/validation/src/sanitize.ts:225:82
   result = result.replace(/<script\b[^<]*(?:(?!<\/script>)<[^<]*)*<\/script>/gi, '');
   result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)*<\/style>/gi, '');
   result = result.replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[^<]*)*<\/iframe>/gi, '');
-  result = result.replace(/<object\b[^<]*(?:(?!<\/object>)<[^<]*)*<\/object>/gi, '');
+  result = result.replace(/<object\b[^<]*(?:(?!<\/object>)<[^<]*)*<\/object>/gi, "Stryker was here!");
   result = result.replace(/<embed\b[^>]*>/gi, '');
 
killedBy: sanitizeHtml — dangerous elements produce empty string (StringLiteral killers) object tag removed with trailing text intact
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "safe"
Received: "Stryker was here!safe"

[Survived] StringLiteral
packages/validation/src/sanitize.ts:226:47
   result = result.replace(/<style\b[^<]*(?:(?!<\/style>)<[^<]*)*<\/style>/gi, '');
   result = result.replace(/<iframe\b[^<]*(?:(?!<\/iframe>)<[^<]*)*<\/iframe>/gi, '');
   result = result.replace(/<object\b[^<]*(?:(?!<\/object>)<[^<]*)*<\/object>/gi, '');
-  result = result.replace(/<embed\b[^>]*>/gi, '');
+  result = result.replace(/<embed\b[^>]*>/gi, "Stryker was here!");
 
   // Remove event handlers from all tags

[Killed] StringLiteral
packages/validation/src/sanitize.ts:229:62
   result = result.replace(/<embed\b[^>]*>/gi, '');
 
   // Remove event handlers from all tags
-  result = result.replace(/\s+on\w+\s*=\s*["'][^"']*["']/gi, '');
+  result = result.replace(/\s+on\w+\s*=\s*["'][^"']*["']/gi, "Stryker was here!");
   result = result.replace(/\s+on\w+\s*=\s*[^\s>]+/gi, '');
 
killedBy: sanitizeHtml should remove event handlers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<p>click</p>"
Received: "click</p>"

[Survived] Regex
packages/validation/src/sanitize.ts:229:27
   result = result.replace(/<embed\b[^>]*>/gi, '');
 
   // Remove event handlers from all tags
-  result = result.replace(/\s+on\w+\s*=\s*["'][^"']*["']/gi, '');
+  result = result.replace(/\s+on\w+\s*=\s*["']["']*["']/gi, '');
   result = result.replace(/\s+on\w+\s*=\s*[^\s>]+/gi, '');
 

[Survived] Regex
packages/validation/src/sanitize.ts:230:27
 
   // Remove event handlers from all tags
   result = result.replace(/\s+on\w+\s*=\s*["'][^"']*["']/gi, '');
-  result = result.replace(/\s+on\w+\s*=\s*[^\s>]+/gi, '');
+  result = result.replace(/\s+on\w+\s*=\s*[\s>]+/gi, '');
 
   // Remove javascript: and data: URLs

[Survived] Regex
packages/validation/src/sanitize.ts:230:27
 
   // Remove event handlers from all tags
   result = result.replace(/\s+on\w+\s*=\s*["'][^"']*["']/gi, '');
-  result = result.replace(/\s+on\w+\s*=\s*[^\s>]+/gi, '');
+  result = result.replace(/\s+on\w+\s*=\s[^\s>]+/gi, '');
 
   // Remove javascript: and data: URLs

[Killed] Regex
packages/validation/src/sanitize.ts:233:27
   result = result.replace(/\s+on\w+\s*=\s*[^\s>]+/gi, '');
 
   // Remove javascript: and data: URLs
-  result = result.replace(/javascript:[^"']*/gi, '');
+  result = result.replace(/javascript:["']*/gi, '');
   result = result.replace(/data:text\/html[^"']*/gi, '');
 
killedBy: sanitizeHtml should remove javascript: URLs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<a href=\"\">link</a>"
Received: "<a href=\"alert(1)\">link</a>"

[Survived] Regex
packages/validation/src/sanitize.ts:234:27
 
   // Remove javascript: and data: URLs
   result = result.replace(/javascript:[^"']*/gi, '');
-  result = result.replace(/data:text\/html[^"']*/gi, '');
+  result = result.replace(/data:text\/html["']*/gi, '');
 
   // Build regex pattern for allowed tags

[Killed] BlockStatement
packages/validation/src/sanitize.ts:243:33
   // Remove disallowed attributes from allowed tags
   result = result.replace(
     new RegExp(`(<(?:${tagPattern})\\s+)([^>]*)>`, 'gi'),
-    (match, tagStart, attrs) => {
-      // Filter attributes to only allowed ones
-      const cleanAttrs = attrs
-        .split(/\s+/)
-        .filter((attr: string) => {
-          const attrName = attr.split('=')[0].toLowerCase();
-          return allowedAttributes.includes(attrName);
-        })
-        .join(' ');
-      return `${tagStart}${cleanAttrs}>`;
-    }
+    (match, tagStart, attrs) => {}
   );
 
killedBy: sanitizeHtml — allowed attributes preserved (StringLiteral killers) preserves href attribute on <a> — kills "href"→"" mutation
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "href"
Received string:    "undefinedlink</a>"

[Killed] MethodExpression
packages/validation/src/sanitize.ts:245:26
     new RegExp(`(<(?:${tagPattern})\\s+)([^>]*)>`, 'gi'),
     (match, tagStart, attrs) => {
       // Filter attributes to only allowed ones
-      const cleanAttrs = attrs
-        .split(/\s+/)
-        .filter((attr: string) => {
-          const attrName = attr.split('=')[0].toLowerCase();
-          return allowedAttributes.includes(attrName);
-        })
+      const cleanAttrs = attrs.split(/\s+/)
         .join(' ');
       return `${tagStart}${cleanAttrs}>`;
killedBy: sanitizeHtml — allowed attributes preserved (StringLiteral killers) strips disallowed attribute (style) from allowed tag
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "style"
Received string:        "<p style=\"color:red\">text</p>"

[Killed] BlockStatement
packages/validation/src/sanitize.ts:247:35
       // Filter attributes to only allowed ones
       const cleanAttrs = attrs
         .split(/\s+/)
-        .filter((attr: string) => {
-          const attrName = attr.split('=')[0].toLowerCase();
-          return allowedAttributes.includes(attrName);
-        })
+        .filter((attr: string) => {})
         .join(' ');
       return `${tagStart}${cleanAttrs}>`;
killedBy: sanitizeHtml — allowed attributes preserved (StringLiteral killers) preserves href attribute on <a> — kills "href"→"" mutation
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "href"
Received string:    "<a >link</a>"

[Killed] MethodExpression
packages/validation/src/sanitize.ts:248:28
       const cleanAttrs = attrs
         .split(/\s+/)
         .filter((attr: string) => {
-          const attrName = attr.split('=')[0].toLowerCase();
+          const attrName = attr.split('=')[0].toUpperCase();
           return allowedAttributes.includes(attrName);
         })
killedBy: sanitizeHtml should remove javascript: URLs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<a href=\"\">link</a>"
Received: "<a >link</a>"

[Killed] Regex
packages/validation/src/sanitize.ts:257:26
   );
 
   // Remove tags that are not in the allowed list (but keep content)
-  const allTagsPattern = /<\/?([a-zA-Z][a-zA-Z0-9]*)\b[^>]*>/gi;
+  const allTagsPattern = /<\/?([^a-zA-Z][a-zA-Z0-9]*)\b[^>]*>/gi;
   result = result.replace(allTagsPattern, (match, tagName) => {
     if (allowedTags.includes(tagName.toLowerCase())) {
killedBy: sanitizeHtml should allow safe tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<p>hello</p>"
Received: "<p>hello"

[Killed] BlockStatement
packages/validation/src/sanitize.ts:258:63
 
   // Remove tags that are not in the allowed list (but keep content)
   const allTagsPattern = /<\/?([a-zA-Z][a-zA-Z0-9]*)\b[^>]*>/gi;
-  result = result.replace(allTagsPattern, (match, tagName) => {
-    if (allowedTags.includes(tagName.toLowerCase())) {
-      return match;
-    }
-    return ''; // Remove the tag but keep what was between
-  });
+  result = result.replace(allTagsPattern, (match, tagName) => {});
 
   return result;
killedBy: sanitizeHtml should allow safe tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<p>hello</p>"
Received: "undefinedhelloundefined"

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:259:9
   // Remove tags that are not in the allowed list (but keep content)
   const allTagsPattern = /<\/?([a-zA-Z][a-zA-Z0-9]*)\b[^>]*>/gi;
   result = result.replace(allTagsPattern, (match, tagName) => {
-    if (allowedTags.includes(tagName.toLowerCase())) {
+    if (true) {
       return match;
     }
killedBy: sanitizeHtml should remove event handlers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "<img src=\"x\">"

[Killed] MethodExpression
packages/validation/src/sanitize.ts:259:30
   // Remove tags that are not in the allowed list (but keep content)
   const allTagsPattern = /<\/?([a-zA-Z][a-zA-Z0-9]*)\b[^>]*>/gi;
   result = result.replace(allTagsPattern, (match, tagName) => {
-    if (allowedTags.includes(tagName.toLowerCase())) {
+    if (allowedTags.includes(tagName.toUpperCase())) {
       return match;
     }
killedBy: sanitizeHtml should allow safe tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<p>hello</p>"
Received: "hello"

[Killed] BlockStatement
packages/validation/src/sanitize.ts:271:55
 /**
  * Sanitize an email address
  */
-export function sanitizeEmail(input: unknown): string {
-  if (!input) return '';
-
-  let email = String(input).trim().toLowerCase();
-
-  // Remove any HTML
-  email = stripHtmlTags(email);
-
-  // Normalize email
-  email = validator.normalizeEmail(email) || '';
-
-  return email;
-}
+export function sanitizeEmail(input: unknown): string {}
 
 /**
killedBy: sanitizeEmail() — property-based always returns a string
statusReason: Error: Property failed after 1 tests
{ seed: 1586426341, path: "0", endOnFailure: true }
Counterexample: [undefined]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
packages/validation/src/sanitize.ts:272:7
  * Sanitize an email address
  */
 export function sanitizeEmail(input: unknown): string {
-  if (!input) return '';
+  if (input) return '';
 
   let email = String(input).trim().toLowerCase();
killedBy: sanitizeEmail() — property-based falsy input returns empty string
statusReason: Error: Property failed after 1 tests
{ seed: 2101392485, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:272:7
  * Sanitize an email address
  */
 export function sanitizeEmail(input: unknown): string {
-  if (!input) return '';
+  if (true) return '';
 
   let email = String(input).trim().toLowerCase();
killedBy: sanitizeEmail should normalize email addresses
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test@example.com"
Received: ""

[Killed] MethodExpression
packages/validation/src/sanitize.ts:274:15
 export function sanitizeEmail(input: unknown): string {
   if (!input) return '';
 
-  let email = String(input).trim().toLowerCase();
+  let email = String(input).toLowerCase();
 
   // Remove any HTML
killedBy: sanitizeEmail should trim whitespace
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test@example.com"
Received: "  test@example.com  "

[Survived] MethodExpression
packages/validation/src/sanitize.ts:274:15
 export function sanitizeEmail(input: unknown): string {
   if (!input) return '';
 
-  let email = String(input).trim().toLowerCase();
+  let email = String(input).trim().toUpperCase();
 
   // Remove any HTML

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:280:11
   email = stripHtmlTags(email);
 
   // Normalize email
-  email = validator.normalizeEmail(email) || '';
+  email = false;
 
   return email;
killedBy: sanitizeEmail() — property-based always returns a string
statusReason: Error: Property failed after 4 tests
{ seed: -754049930, path: "3:1:0:1", endOnFailure: true }
Counterexample: [" "]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:280:11
   email = stripHtmlTags(email);
 
   // Normalize email
-  email = validator.normalizeEmail(email) || '';
+  email = true;
 
   return email;
killedBy: sanitizeEmail() — property-based always returns a string
statusReason: Error: Property failed after 5 tests
{ seed: 244500935, path: "4:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [-1]
Shrunk 31 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
packages/validation/src/sanitize.ts:288:53
 /**
  * Sanitize a URL
  */
-export function sanitizeUrl(input: unknown): string {
-  if (!input) return '';
-
-  let url = String(input).trim();
-
-  // Remove any HTML
-  url = stripHtmlTags(url);
-
-  // Block dangerous protocols
-  if (/^(javascript|vbscript|data|file):/i.test(url)) {
-    return '';
-  }
-
-  return url;
-}
+export function sanitizeUrl(input: unknown): string {}
 
 /**
killedBy: sanitizeUrl should handle empty input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: undefined

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:289:7
  * Sanitize a URL
  */
 export function sanitizeUrl(input: unknown): string {
-  if (!input) return '';
+  if (false) return '';
 
   let url = String(input).trim();
killedBy: sanitizeUrl should handle empty input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "null"

[Killed] BooleanLiteral
packages/validation/src/sanitize.ts:289:7
  * Sanitize a URL
  */
 export function sanitizeUrl(input: unknown): string {
-  if (!input) return '';
+  if (input) return '';
 
   let url = String(input).trim();
killedBy: sanitizeUrl should handle empty input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "null"

[Killed] MethodExpression
packages/validation/src/sanitize.ts:291:13
 export function sanitizeUrl(input: unknown): string {
   if (!input) return '';
 
-  let url = String(input).trim();
+  let url = String(input);
 
   // Remove any HTML
killedBy: sanitizeUrl — conditional mutation killers trims whitespace — kills trim() removal
statusReason: Error: expect(received).not.toMatch(expected)

Expected pattern: not /^\s/
Received string:      "  https://example.com  "

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:297:7
   url = stripHtmlTags(url);
 
   // Block dangerous protocols
-  if (/^(javascript|vbscript|data|file):/i.test(url)) {
+  if (true) {
     return '';
   }
killedBy: sanitizeUrl should allow http/https URLs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://example.com"
Received: ""

[Killed] BlockStatement
packages/validation/src/sanitize.ts:297:55
   url = stripHtmlTags(url);
 
   // Block dangerous protocols
-  if (/^(javascript|vbscript|data|file):/i.test(url)) {
-    return '';
-  }
+  if (/^(javascript|vbscript|data|file):/i.test(url)) {}
 
   return url;
killedBy: sanitizeUrl — conditional mutation killers blocks javascript: protocol — kills condition inversion
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "javascript:alert(1)"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:298:12
 
   // Block dangerous protocols
   if (/^(javascript|vbscript|data|file):/i.test(url)) {
-    return '';
+    return "Stryker was here!";
   }
 
killedBy: sanitizeUrl should block javascript: URLs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] BlockStatement
packages/validation/src/sanitize.ts:307:53
 /**
  * Check if string contains potential XSS attack patterns
  */
-export function containsXss(input: string): boolean {
-  return getXssPatterns().some((pattern) => pattern.test(input));
-}
+export function containsXss(input: string): boolean {}
 
 /**
killedBy: containsXss() — property-based always returns a boolean
statusReason: Error: Property failed after 1 tests
{ seed: -382935687, path: "0", endOnFailure: true }
Counterexample: [""]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
packages/validation/src/sanitize.ts:308:10
  * Check if string contains potential XSS attack patterns
  */
 export function containsXss(input: string): boolean {
-  return getXssPatterns().some((pattern) => pattern.test(input));
+  return getXssPatterns().every(pattern => pattern.test(input));
 }
 
killedBy: containsXss() — property-based known XSS payloads return true
statusReason: Error: Property failed after 1 tests
{ seed: 339573517, path: "0", endOnFailure: true }
Counterexample: ["\"><img src=x onerror=alert(1)>"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
packages/validation/src/sanitize.ts:308:32
  * Check if string contains potential XSS attack patterns
  */
 export function containsXss(input: string): boolean {
-  return getXssPatterns().some((pattern) => pattern.test(input));
+  return getXssPatterns().some(() => undefined);
 }
 
killedBy: containsXss should detect script tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
packages/validation/src/sanitize.ts:314:62
 /**
  * Check if string contains potential SQL injection patterns
  */
-export function containsSqlInjection(input: string): boolean {
-  return getSqlInjectionPatterns().some((pattern) => pattern.test(input));
-}
+export function containsSqlInjection(input: string): boolean {}
 
 /**
killedBy: containsSqlInjection() — property-based always returns a boolean
statusReason: Error: Property failed after 1 tests
{ seed: -1508903454, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
packages/validation/src/sanitize.ts:315:10
  * Check if string contains potential SQL injection patterns
  */
 export function containsSqlInjection(input: string): boolean {
-  return getSqlInjectionPatterns().some((pattern) => pattern.test(input));
+  return getSqlInjectionPatterns().every(pattern => pattern.test(input));
 }
 
killedBy: containsSqlInjection() — property-based known SQLi payloads return true
statusReason: Error: Property failed after 1 tests
{ seed: -708236207, path: "0", endOnFailure: true }
Counterexample: ["1; DROP TABLE orders"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
packages/validation/src/sanitize.ts:315:41
  * Check if string contains potential SQL injection patterns
  */
 export function containsSqlInjection(input: string): boolean {
-  return getSqlInjectionPatterns().some((pattern) => pattern.test(input));
+  return getSqlInjectionPatterns().some(() => undefined);
 }
 
killedBy: containsSqlInjection() — property-based known SQLi payloads return true
statusReason: Error: Property failed after 1 tests
{ seed: -974322604, path: "0", endOnFailure: true }
Counterexample: ["UNION SELECT * FROM users"]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
packages/validation/src/sanitize.ts:326:7
   obj: T,
   options: SanitizeStringOptions = {}
 ): T {
-  if (!obj || typeof obj !== 'object') {
+  if (obj || typeof obj !== 'object') {
     return obj;
   }
killedBy: validateMiddleware should sanitize before validation when enabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "John"
Received: "<b>John</b>"

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:326:7
   obj: T,
   options: SanitizeStringOptions = {}
 ): T {
-  if (!obj || typeof obj !== 'object') {
+  if (true) {
     return obj;
   }
killedBy: validateMiddleware should sanitize before validation when enabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "John"
Received: "<b>John</b>"

[Killed] BlockStatement
packages/validation/src/sanitize.ts:332:42
 
   const result = { ...obj } as Record<string, unknown>;
 
-  for (const key of Object.keys(result)) {
-    const value = result[key];
-
-    if (typeof value === 'string') {
-      result[key] = sanitizeString(value, options);
-    } else if (Array.isArray(value)) {
-      result[key] = value.map((item) => {
-        if (typeof item === 'string') {
-          return sanitizeString(item, options);
-        } else if (typeof item === 'object' && item !== null) {
-          return sanitizeObject(item as Record<string, unknown>, options);
-        }
-        return item;
-      });
-    } else if (typeof value === 'object' && value !== null) {
-      result[key] = sanitizeObject(value as Record<string, unknown>, options);
-    }
-  }
+  for (const key of Object.keys(result)) {}
 
   return result as T;
killedBy: sanitizeObject should sanitize all string values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "John"
Received: "<script>alert(1)</script>John"
