[Killed] EqualityOperator
packages/hash-utils/src/hash-utils.ts:154:15
 // ─── Adler32 checksum ────────────────────────────────────────────────────────
 
 export function adler32(data: string | Buffer): number {
-  const buf = typeof data === 'string' ? Buffer.from(data, 'utf8') : data;
+  const buf = typeof data !== 'string' ? Buffer.from(data, 'utf8') : data;
   const MOD_ADLER = 65521;
   let a = 1;
killedBy: adler32 adler32 differs for different inputs
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not 0

[Killed] ConditionalExpression
packages/hash-utils/src/hash-utils.ts:154:15
 // ─── Adler32 checksum ────────────────────────────────────────────────────────
 
 export function adler32(data: string | Buffer): number {
-  const buf = typeof data === 'string' ? Buffer.from(data, 'utf8') : data;
+  const buf = false ? Buffer.from(data, 'utf8') : data;
   const MOD_ADLER = 65521;
   let a = 1;
killedBy: adler32 adler32 differs for different inputs
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not 0

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:158:40
   const MOD_ADLER = 65521;
   let a = 1;
   let b = 0;
-  for (let i = 0; i < buf.length; i++) {
-    a = (a + buf[i]) % MOD_ADLER;
-    b = (b + a) % MOD_ADLER;
-  }
+  for (let i = 0; i < buf.length; i++) {}
   return ((b << 16) | a) >>> 0;
 }
killedBy: adler32 adler32 differs for different inputs
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not 1

[Killed] EqualityOperator
packages/hash-utils/src/hash-utils.ts:158:19
   const MOD_ADLER = 65521;
   let a = 1;
   let b = 0;
-  for (let i = 0; i < buf.length; i++) {
+  for (let i = 0; i >= buf.length; i++) {
     a = (a + buf[i]) % MOD_ADLER;
     b = (b + a) % MOD_ADLER;
killedBy: adler32 adler32 differs for different inputs
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not 1

[Survived] ArithmeticOperator
packages/hash-utils/src/hash-utils.ts:159:9
   let a = 1;
   let b = 0;
   for (let i = 0; i < buf.length; i++) {
-    a = (a + buf[i]) % MOD_ADLER;
+    a = (a + buf[i]) * MOD_ADLER;
     b = (b + a) % MOD_ADLER;
   }

[Survived] ArithmeticOperator
packages/hash-utils/src/hash-utils.ts:159:10
   let a = 1;
   let b = 0;
   for (let i = 0; i < buf.length; i++) {
-    a = (a + buf[i]) % MOD_ADLER;
+    a = (a - buf[i]) % MOD_ADLER;
     b = (b + a) % MOD_ADLER;
   }

[Survived] ArithmeticOperator
packages/hash-utils/src/hash-utils.ts:160:9
   let b = 0;
   for (let i = 0; i < buf.length; i++) {
     a = (a + buf[i]) % MOD_ADLER;
-    b = (b + a) % MOD_ADLER;
+    b = (b + a) * MOD_ADLER;
   }
   return ((b << 16) | a) >>> 0;

[Survived] ArithmeticOperator
packages/hash-utils/src/hash-utils.ts:160:10
   let b = 0;
   for (let i = 0; i < buf.length; i++) {
     a = (a + buf[i]) % MOD_ADLER;
-    b = (b + a) % MOD_ADLER;
+    b = (b - a) % MOD_ADLER;
   }
   return ((b << 16) | a) >>> 0;

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:167:47
 
 // ─── FNV-1a 32-bit hash ───────────────────────────────────────────────────────
 
-export function fnv1a32(data: string): number {
-  const FNV_PRIME = 0x01000193;
-  const FNV_OFFSET = 0x811c9dc5;
-  let hash32 = FNV_OFFSET;
-  for (let i = 0; i < data.length; i++) {
-    hash32 ^= data.charCodeAt(i);
-    hash32 = Math.imul(hash32, FNV_PRIME);
-  }
-  return hash32 >>> 0;
-}
+export function fnv1a32(data: string): number {}
 
 // ─── DJB2 hash ───────────────────────────────────────────────────────────────
killedBy: fnv1a32 fnv1a32 test 0: non-negative 32-bit, deterministic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "number"
Received: "undefined"

[Survived] EqualityOperator
packages/hash-utils/src/hash-utils.ts:171:19
   const FNV_PRIME = 0x01000193;
   const FNV_OFFSET = 0x811c9dc5;
   let hash32 = FNV_OFFSET;
-  for (let i = 0; i < data.length; i++) {
+  for (let i = 0; i <= data.length; i++) {
     hash32 ^= data.charCodeAt(i);
     hash32 = Math.imul(hash32, FNV_PRIME);

[Timeout] UpdateOperator
packages/hash-utils/src/hash-utils.ts:171:36
   const FNV_PRIME = 0x01000193;
   const FNV_OFFSET = 0x811c9dc5;
   let hash32 = FNV_OFFSET;
-  for (let i = 0; i < data.length; i++) {
+  for (let i = 0; i < data.length; i--) {
     hash32 ^= data.charCodeAt(i);
     hash32 = Math.imul(hash32, FNV_PRIME);

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:180:44
 
 // ─── DJB2 hash ───────────────────────────────────────────────────────────────
 
-export function djb2(data: string): number {
-  let hash32 = 5381;
-  for (let i = 0; i < data.length; i++) {
-    hash32 = (Math.imul(hash32, 33) ^ data.charCodeAt(i)) >>> 0;
-  }
-  return hash32 >>> 0;
-}
+export function djb2(data: string): number {}
 
 // ─── MurmurHash3 (32-bit, seed=0) ────────────────────────────────────────────
killedBy: djb2 djb2 returns a non-negative number
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined

[Killed] EqualityOperator
packages/hash-utils/src/hash-utils.ts:182:19
 
 export function djb2(data: string): number {
   let hash32 = 5381;
-  for (let i = 0; i < data.length; i++) {
+  for (let i = 0; i <= data.length; i++) {
     hash32 = (Math.imul(hash32, 33) ^ data.charCodeAt(i)) >>> 0;
   }
killedBy: djb2 djb2 for empty string returns 5381
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5381
Received: 177573

[Killed] ConditionalExpression
packages/hash-utils/src/hash-utils.ts:182:19
 
 export function djb2(data: string): number {
   let hash32 = 5381;
-  for (let i = 0; i < data.length; i++) {
+  for (let i = 0; false; i++) {
     hash32 = (Math.imul(hash32, 33) ^ data.charCodeAt(i)) >>> 0;
   }
killedBy: djb2 djb2 differs for different inputs
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not 5381

[Killed] ArithmeticOperator
packages/hash-utils/src/hash-utils.ts:196:30
   const c1 = 0xcc9e2d51;
   const c2 = 0x1b873593;
   let h1 = seed >>> 0;
-  const nblocks = Math.floor(len / 4);
+  const nblocks = Math.floor(len * 4);
 
   for (let i = 0; i < nblocks; i++) {
killedBy: murmur3 murmur3 test 0: deterministic, same seed same result
statusReason: RangeError: The value of "offset" is out of range. It must be >= 0 and <= 10. Received 12

[Killed] EqualityOperator
packages/hash-utils/src/hash-utils.ts:198:19
   let h1 = seed >>> 0;
   const nblocks = Math.floor(len / 4);
 
-  for (let i = 0; i < nblocks; i++) {
+  for (let i = 0; i <= nblocks; i++) {
     let k1 = key.readUInt32LE(i * 4);
     k1 = Math.imul(k1, c1) >>> 0;
killedBy: murmur3 murmur3 test 0: deterministic, same seed same result
statusReason: RangeError: The value of "offset" is out of range. It must be >= 0 and <= 10. Received 12

[Killed] EqualityOperator
packages/hash-utils/src/hash-utils.ts:198:19
   let h1 = seed >>> 0;
   const nblocks = Math.floor(len / 4);
 
-  for (let i = 0; i < nblocks; i++) {
+  for (let i = 0; i >= nblocks; i++) {
     let k1 = key.readUInt32LE(i * 4);
     k1 = Math.imul(k1, c1) >>> 0;
killedBy: murmur3 edge cases murmur3 for empty string returns a number
statusReason: RangeError: Attempt to access memory outside buffer bounds

[Killed] ArithmeticOperator
packages/hash-utils/src/hash-utils.ts:199:31
   const nblocks = Math.floor(len / 4);
 
   for (let i = 0; i < nblocks; i++) {
-    let k1 = key.readUInt32LE(i * 4);
+    let k1 = key.readUInt32LE(i / 4);
     k1 = Math.imul(k1, c1) >>> 0;
     k1 = ((k1 << 15) | (k1 >>> 17)) >>> 0;
killedBy: murmur3 murmur3 test 0: deterministic, same seed same result
statusReason: RangeError: The value of "offset" is out of range. It must be an integer. Received 0.25

[Survived] ArithmeticOperator
packages/hash-utils/src/hash-utils.ts:205:11
     k1 = Math.imul(k1, c2) >>> 0;
     h1 ^= k1;
     h1 = ((h1 << 13) | (h1 >>> 19)) >>> 0;
-    h1 = (Math.imul(h1, 5) + 0xe6546b64) >>> 0;
+    h1 = (Math.imul(h1, 5) - 0xe6546b64) >>> 0;
   }
 

[Survived] ArithmeticOperator
packages/hash-utils/src/hash-utils.ts:208:26
     h1 = (Math.imul(h1, 5) + 0xe6546b64) >>> 0;
   }
 
-  const tail = key.slice(nblocks * 4);
+  const tail = key.slice(nblocks / 4);
   let k1 = 0;
   switch (tail.length) {

[Survived] MethodExpression
packages/hash-utils/src/hash-utils.ts:208:16
     h1 = (Math.imul(h1, 5) + 0xe6546b64) >>> 0;
   }
 
-  const tail = key.slice(nblocks * 4);
+  const tail = key;
   let k1 = 0;
   switch (tail.length) {

[Survived] ConditionalExpression
packages/hash-utils/src/hash-utils.ts:211:5
   const tail = key.slice(nblocks * 4);
   let k1 = 0;
   switch (tail.length) {
-    case 3:
-      k1 ^= tail[2] << 16;
+    case 3:
+// falls through
     // falls through
     case 2:

[Survived] ConditionalExpression
packages/hash-utils/src/hash-utils.ts:214:5
     case 3:
       k1 ^= tail[2] << 16;
     // falls through
-    case 2:
-      k1 ^= tail[1] << 8;
+    // falls through
+case 2:
+// falls through
     // falls through
     case 1:

[Survived] ConditionalExpression
packages/hash-utils/src/hash-utils.ts:217:5
     case 2:
       k1 ^= tail[1] << 8;
     // falls through
-    case 1:
-      k1 ^= tail[0];
-      k1 = Math.imul(k1, c1) >>> 0;
-      k1 = ((k1 << 15) | (k1 >>> 17)) >>> 0;
-      k1 = Math.imul(k1, c2) >>> 0;
-      h1 ^= k1;
+    // falls through
+case 1:
   }
 

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:237:66
 
 // ─── Simple non-cryptographic hash (for hash tables) ─────────────────────────
 
-export function simpleHash(data: string, buckets = 1000): number {
-  let h = 0;
-  for (let i = 0; i < data.length; i++) {
-    h = (h * 31 + data.charCodeAt(i)) >>> 0;
-  }
-  return h % buckets;
-}
+export function simpleHash(data: string, buckets = 1000): number {}
 
 // ─── Password hashing (PBKDF2-based, no bcrypt dep) ──────────────────────────
killedBy: simpleHash simpleHash test 0: result in [0, 1000)
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined

[Survived] ConditionalExpression
packages/hash-utils/src/hash-utils.ts:239:19
 
 export function simpleHash(data: string, buckets = 1000): number {
   let h = 0;
-  for (let i = 0; i < data.length; i++) {
+  for (let i = 0; false; i++) {
     h = (h * 31 + data.charCodeAt(i)) >>> 0;
   }

[Survived] EqualityOperator
packages/hash-utils/src/hash-utils.ts:239:19
 
 export function simpleHash(data: string, buckets = 1000): number {
   let h = 0;
-  for (let i = 0; i < data.length; i++) {
+  for (let i = 0; i <= data.length; i++) {
     h = (h * 31 + data.charCodeAt(i)) >>> 0;
   }

[Survived] ArithmeticOperator
packages/hash-utils/src/hash-utils.ts:240:10
 export function simpleHash(data: string, buckets = 1000): number {
   let h = 0;
   for (let i = 0; i < data.length; i++) {
-    h = (h * 31 + data.charCodeAt(i)) >>> 0;
+    h = (h * 31 - data.charCodeAt(i)) >>> 0;
   }
   return h % buckets;

[Survived] ArithmeticOperator
packages/hash-utils/src/hash-utils.ts:240:10
 export function simpleHash(data: string, buckets = 1000): number {
   let h = 0;
   for (let i = 0; i < data.length; i++) {
-    h = (h * 31 + data.charCodeAt(i)) >>> 0;
+    h = (h / 31 + data.charCodeAt(i)) >>> 0;
   }
   return h % buckets;

[Killed] ArithmeticOperator
packages/hash-utils/src/hash-utils.ts:242:10
   for (let i = 0; i < data.length; i++) {
     h = (h * 31 + data.charCodeAt(i)) >>> 0;
   }
-  return h % buckets;
+  return h * buckets;
 }
 
killedBy: simpleHash simpleHash test 0: result in [0, 1000)
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 1000
Received:   945098089000

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:258:19
   password: string,
   saltHex?: string,
   iterations = 100000,
-): HashedPassword {
-  const { pbkdf2Sync } = require('crypto') as typeof import('crypto');
-  const salt = saltHex ? Buffer.from(saltHex, 'hex') : randomBytes(32);
-  const derived = pbkdf2Sync(password, salt, iterations, 64, 'sha512');
-  return {
-    hash: derived.toString('hex'),
-    salt: salt.toString('hex'),
-    iterations,
-    algorithm: 'pbkdf2-sha512',
-  };
-}
+): HashedPassword {}
 
 export function verifyPassword(password: string, hashed: HashedPassword): boolean {
killedBy: hashPassword / verifyPassword password hash/verify test 0: correct password → true
statusReason: TypeError: Cannot read properties of undefined (reading 'hash')

[Survived] StringLiteral
packages/hash-utils/src/hash-utils.ts:260:47
   iterations = 100000,
 ): HashedPassword {
   const { pbkdf2Sync } = require('crypto') as typeof import('crypto');
-  const salt = saltHex ? Buffer.from(saltHex, 'hex') : randomBytes(32);
+  const salt = saltHex ? Buffer.from(saltHex, "") : randomBytes(32);
   const derived = pbkdf2Sync(password, salt, iterations, 64, 'sha512');
   return {

[Killed] StringLiteral
packages/hash-utils/src/hash-utils.ts:261:62
 ): HashedPassword {
   const { pbkdf2Sync } = require('crypto') as typeof import('crypto');
   const salt = saltHex ? Buffer.from(saltHex, 'hex') : randomBytes(32);
-  const derived = pbkdf2Sync(password, salt, iterations, 64, 'sha512');
+  const derived = pbkdf2Sync(password, salt, iterations, 64, "");
   return {
     hash: derived.toString('hex'),
killedBy: hashPassword / verifyPassword password hash/verify test 0: correct password → true
statusReason: TypeError: Invalid digest:

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:270:83
   };
 }
 
-export function verifyPassword(password: string, hashed: HashedPassword): boolean {
-  const { pbkdf2Sync } = require('crypto') as typeof import('crypto');
-  const salt = Buffer.from(hashed.salt, 'hex');
-  const derived = pbkdf2Sync(password, salt, hashed.iterations, 64, 'sha512');
-  const derivedHex = derived.toString('hex');
-  if (derivedHex.length !== hashed.hash.length) return false;
-  try {
-    return cryptoTimingSafeEqual(Buffer.from(derivedHex, 'hex'), Buffer.from(hashed.hash, 'hex'));
-  } catch {
-    return false;
-  }
-}
+export function verifyPassword(password: string, hashed: HashedPassword): boolean {}
 
 // ─── Content-addressable key ──────────────────────────────────────────────────
killedBy: hashPassword / verifyPassword password hash/verify test 0: correct password → true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] StringLiteral
packages/hash-utils/src/hash-utils.ts:272:41
 
 export function verifyPassword(password: string, hashed: HashedPassword): boolean {
   const { pbkdf2Sync } = require('crypto') as typeof import('crypto');
-  const salt = Buffer.from(hashed.salt, 'hex');
+  const salt = Buffer.from(hashed.salt, "");
   const derived = pbkdf2Sync(password, salt, hashed.iterations, 64, 'sha512');
   const derivedHex = derived.toString('hex');
killedBy: hashPassword / verifyPassword password hash/verify test 0: correct password → true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
packages/hash-utils/src/hash-utils.ts:275:7
   const salt = Buffer.from(hashed.salt, 'hex');
   const derived = pbkdf2Sync(password, salt, hashed.iterations, 64, 'sha512');
   const derivedHex = derived.toString('hex');
-  if (derivedHex.length !== hashed.hash.length) return false;
+  if (true) return false;
   try {
     return cryptoTimingSafeEqual(Buffer.from(derivedHex, 'hex'), Buffer.from(hashed.hash, 'hex'));
killedBy: hashPassword / verifyPassword password hash/verify test 0: correct password → true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
packages/hash-utils/src/hash-utils.ts:275:7
   const salt = Buffer.from(hashed.salt, 'hex');
   const derived = pbkdf2Sync(password, salt, hashed.iterations, 64, 'sha512');
   const derivedHex = derived.toString('hex');
-  if (derivedHex.length !== hashed.hash.length) return false;
+  if (derivedHex.length === hashed.hash.length) return false;
   try {
     return cryptoTimingSafeEqual(Buffer.from(derivedHex, 'hex'), Buffer.from(hashed.hash, 'hex'));
killedBy: hashPassword / verifyPassword password hash/verify test 0: correct password → true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:276:7
   const derived = pbkdf2Sync(password, salt, hashed.iterations, 64, 'sha512');
   const derivedHex = derived.toString('hex');
   if (derivedHex.length !== hashed.hash.length) return false;
-  try {
-    return cryptoTimingSafeEqual(Buffer.from(derivedHex, 'hex'), Buffer.from(hashed.hash, 'hex'));
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: hashPassword / verifyPassword password hash/verify test 0: correct password → true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[NoCoverage] BlockStatement
packages/hash-utils/src/hash-utils.ts:278:11
   if (derivedHex.length !== hashed.hash.length) return false;
   try {
     return cryptoTimingSafeEqual(Buffer.from(derivedHex, 'hex'), Buffer.from(hashed.hash, 'hex'));
-  } catch {
-    return false;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:285:59
 
 // ─── Content-addressable key ──────────────────────────────────────────────────
 
-export function contentKey(data: string | Buffer): string {
-  return sha256(data);
-}
+export function contentKey(data: string | Buffer): string {}
 
 // ─── Combine multiple hashes ──────────────────────────────────────────────────
killedBy: contentKey contentKey returns sha256 of data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "5593e0d35ae4da0b1b303b09170b439c01f74689feae936dbee9b296db512d28"
Received: undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:291:60
 
 // ─── Combine multiple hashes ──────────────────────────────────────────────────
 
-export function combineHashes(...hashes: string[]): string {
-  return sha256(hashes.join(''));
-}
+export function combineHashes(...hashes: string[]): string {}
 
 // ─── Short hash: first N hex chars of sha256 ─────────────────────────────────
killedBy: combineHashes combineHashes test 0: combining same hashes → same result
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:297:70
 
 // ─── Short hash: first N hex chars of sha256 ─────────────────────────────────
 
-export function shortHash(data: string | Buffer, length = 8): string {
-  return sha256(data).slice(0, length);
-}
+export function shortHash(data: string | Buffer, length = 8): string {}
 
 // ─── Deterministic ID from object ────────────────────────────────────────────
killedBy: shortHash shortHash test length=1 input-0: exact length match
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] MethodExpression
packages/hash-utils/src/hash-utils.ts:298:10
 // ─── Short hash: first N hex chars of sha256 ─────────────────────────────────
 
 export function shortHash(data: string | Buffer, length = 8): string {
-  return sha256(data).slice(0, length);
+  return sha256(data);
 }
 
killedBy: shortHash shortHash test length=1 input-0: exact length match
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 64
Received string: "9d7f562188de61fc34abc01255df4ce02582b2488f39edab4a01406ac43200a0"

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:303:50
 
 // ─── Deterministic ID from object ────────────────────────────────────────────
 
-export function objectHash(obj: unknown): string {
-  const sorted = JSON.stringify(obj, (_, value) => {
-    if (value !== null && typeof value === 'object' && !Array.isArray(value)) {
-      return Object.keys(value as Record<string, unknown>)
-        .sort()
-        .reduce(
-          (acc, k) => {
-            acc[k] = (value as Record<string, unknown>)[k];
-            return acc;
-          },
-          {} as Record<string, unknown>,
-        );
-    }
-    return value;
-  });
-  return sha256(sorted);
-}
+export function objectHash(obj: unknown): string {}
 
 // ─── List available algorithms ────────────────────────────────────────────────
killedBy: objectHash objectHash test 0: same object same hash
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:304:52
 // ─── Deterministic ID from object ────────────────────────────────────────────
 
 export function objectHash(obj: unknown): string {
-  const sorted = JSON.stringify(obj, (_, value) => {
-    if (value !== null && typeof value === 'object' && !Array.isArray(value)) {
-      return Object.keys(value as Record<string, unknown>)
-        .sort()
-        .reduce(
-          (acc, k) => {
-            acc[k] = (value as Record<string, unknown>)[k];
-            return acc;
-          },
-          {} as Record<string, unknown>,
-        );
-    }
-    return value;
-  });
+  const sorted = JSON.stringify(obj, (_, value) => {});
   return sha256(sorted);
 }
killedBy: objectHash objectHash test 0: same object same hash
statusReason: TypeError: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] EqualityOperator
packages/hash-utils/src/hash-utils.ts:305:9
 
 export function objectHash(obj: unknown): string {
   const sorted = JSON.stringify(obj, (_, value) => {
-    if (value !== null && typeof value === 'object' && !Array.isArray(value)) {
+    if (value === null && typeof value === 'object' && !Array.isArray(value)) {
       return Object.keys(value as Record<string, unknown>)
         .sort()
killedBy: objectHash objectHash test 25: key order does not matter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "6c0c4115826a988c6699368d5da2d08d196001b094525c1f2f3f94debae55234"
Received: "db71772003e102c55d1601251d99b50d8eeaf0d536fa7a431d2bab8a1b950acd"

[Killed] ConditionalExpression
packages/hash-utils/src/hash-utils.ts:305:9
 
 export function objectHash(obj: unknown): string {
   const sorted = JSON.stringify(obj, (_, value) => {
-    if (value !== null && typeof value === 'object' && !Array.isArray(value)) {
+    if (true && typeof value === 'object' && !Array.isArray(value)) {
       return Object.keys(value as Record<string, unknown>)
         .sort()
killedBy: objectHash with complex types objectHash handles null
statusReason: TypeError: Cannot convert undefined or null to object

[Killed] MethodExpression
packages/hash-utils/src/hash-utils.ts:306:14
 export function objectHash(obj: unknown): string {
   const sorted = JSON.stringify(obj, (_, value) => {
     if (value !== null && typeof value === 'object' && !Array.isArray(value)) {
-      return Object.keys(value as Record<string, unknown>)
-        .sort()
+      return Object.keys(value as Record<string, unknown>)
         .reduce(
           (acc, k) => {
killedBy: objectHash objectHash test 25: key order does not matter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "6c0c4115826a988c6699368d5da2d08d196001b094525c1f2f3f94debae55234"
Received: "db71772003e102c55d1601251d99b50d8eeaf0d536fa7a431d2bab8a1b950acd"

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:309:23
       return Object.keys(value as Record<string, unknown>)
         .sort()
         .reduce(
-          (acc, k) => {
-            acc[k] = (value as Record<string, unknown>)[k];
-            return acc;
-          },
+          (acc, k) => {},
           {} as Record<string, unknown>,
         );
killedBy: objectHash objectHash test 0: same object same hash
statusReason: TypeError: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] BlockStatement
packages/hash-utils/src/hash-utils.ts:323:51
 
 // ─── List available algorithms ────────────────────────────────────────────────
 
-export function listAlgorithms(): HashAlgorithm[] {
-  return ['md5', 'sha1', 'sha256', 'sha384', 'sha512', 'sha3-256', 'sha3-512'];
-}
+export function listAlgorithms(): HashAlgorithm[] {}
 
killedBy: listAlgorithms listAlgorithms returns an array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrayDeclaration
packages/hash-utils/src/hash-utils.ts:324:10
 // ─── List available algorithms ────────────────────────────────────────────────
 
 export function listAlgorithms(): HashAlgorithm[] {
-  return ['md5', 'sha1', 'sha256', 'sha384', 'sha512', 'sha3-256', 'sha3-512'];
+  return [];
 }
 
killedBy: listAlgorithms listAlgorithms includes sha256
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "sha256"
Received array: []

[Survived] StringLiteral
packages/hash-utils/src/hash-utils.ts:324:36
 // ─── List available algorithms ────────────────────────────────────────────────
 
 export function listAlgorithms(): HashAlgorithm[] {
-  return ['md5', 'sha1', 'sha256', 'sha384', 'sha512', 'sha3-256', 'sha3-512'];
+  return ['md5', 'sha1', 'sha256', "", 'sha512', 'sha3-256', 'sha3-512'];
 }
 
