[Killed] BlockStatement
packages/validation/src/sanitize.ts:335:36
   for (const key of Object.keys(result)) {
     const value = result[key];
 
-    if (typeof value === 'string') {
-      result[key] = sanitizeString(value, options);
-    } else if (Array.isArray(value)) {
+    if (typeof value === 'string') {} else if (Array.isArray(value)) {
       result[key] = value.map((item) => {
         if (typeof item === 'string') {
killedBy: validateMiddleware should sanitize before validation when enabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "John"
Received: "<b>John</b>"

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:337:16
 
     if (typeof value === 'string') {
       result[key] = sanitizeString(value, options);
-    } else if (Array.isArray(value)) {
+    } else if (true) {
       result[key] = value.map((item) => {
         if (typeof item === 'string') {
killedBy: validateMiddleware should reject invalid data with validation errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:337:16
 
     if (typeof value === 'string') {
       result[key] = sanitizeString(value, options);
-    } else if (Array.isArray(value)) {
+    } else if (false) {
       result[key] = value.map((item) => {
         if (typeof item === 'string') {
killedBy: sanitizeObject should handle arrays
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["tag1", "", "tag3"]
Received: {"0": "tag1", "1": "", "2": "tag3"}

[Killed] BlockStatement
packages/validation/src/sanitize.ts:338:41
     if (typeof value === 'string') {
       result[key] = sanitizeString(value, options);
     } else if (Array.isArray(value)) {
-      result[key] = value.map((item) => {
-        if (typeof item === 'string') {
-          return sanitizeString(item, options);
-        } else if (typeof item === 'object' && item !== null) {
-          return sanitizeObject(item as Record<string, unknown>, options);
-        }
-        return item;
-      });
+      result[key] = value.map((item) => {});
     } else if (typeof value === 'object' && value !== null) {
       result[key] = sanitizeObject(value as Record<string, unknown>, options);
killedBy: sanitizeObject should handle arrays
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   "tag1",
-   "",

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:339:13
       result[key] = sanitizeString(value, options);
     } else if (Array.isArray(value)) {
       result[key] = value.map((item) => {
-        if (typeof item === 'string') {
+        if (true) {
           return sanitizeString(item, options);
         } else if (typeof item === 'object' && item !== null) {
killedBy: sanitizeObject should handle array of objects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "John"
Received: undefined

[Killed] EqualityOperator
packages/validation/src/sanitize.ts:339:13
       result[key] = sanitizeString(value, options);
     } else if (Array.isArray(value)) {
       result[key] = value.map((item) => {
-        if (typeof item === 'string') {
+        if (typeof item !== 'string') {
           return sanitizeString(item, options);
         } else if (typeof item === 'object' && item !== null) {
killedBy: sanitizeObject should handle arrays
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "tag1",
-   "",

[Killed] EqualityOperator
packages/validation/src/sanitize.ts:341:48
       result[key] = value.map((item) => {
         if (typeof item === 'string') {
           return sanitizeString(item, options);
-        } else if (typeof item === 'object' && item !== null) {
+        } else if (typeof item === 'object' && item === null) {
           return sanitizeObject(item as Record<string, unknown>, options);
         }
killedBy: sanitizeObject should handle array of objects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "John"
Received: "<b>John</b>"

[Killed] BlockStatement
packages/validation/src/sanitize.ts:341:63
       result[key] = value.map((item) => {
         if (typeof item === 'string') {
           return sanitizeString(item, options);
-        } else if (typeof item === 'object' && item !== null) {
-          return sanitizeObject(item as Record<string, unknown>, options);
-        }
+        } else if (typeof item === 'object' && item !== null) {}
         return item;
       });
killedBy: sanitizeObject should handle array of objects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "John"
Received: "<b>John</b>"

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:346:16
         }
         return item;
       });
-    } else if (typeof value === 'object' && value !== null) {
+    } else if (false) {
       result[key] = sanitizeObject(value as Record<string, unknown>, options);
     }
killedBy: sanitizeObject should handle nested objects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "John"
Received: "<b>John</b>"

[Killed] EqualityOperator
packages/validation/src/sanitize.ts:346:45
         }
         return item;
       });
-    } else if (typeof value === 'object' && value !== null) {
+    } else if (typeof value === 'object' && value === null) {
       result[key] = sanitizeObject(value as Record<string, unknown>, options);
     }
killedBy: sanitizeObject should handle nested objects
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "John"
Received: "<b>John</b>"

[Killed] BlockStatement
packages/validation/src/sanitize.ts:357:58
 /**
  * Sanitize filename to prevent path traversal and other attacks
  */
-export function sanitizeFilename(input: unknown): string {
-  if (!input) return '';
-
-  let filename = String(input);
-
-  // Remove path traversal
-  filename = filename.replace(/\.\./g, '');
-  filename = filename.replace(/[\/\\]/g, '');
-
-  // Remove null bytes
-  filename = filename.replace(/\0/g, '');
-
-  // Keep only safe characters
-  filename = filename.replace(/[^a-zA-Z0-9._-]/g, '_');
-
-  // Limit length
-  if (filename.length > 255) {
-    const ext = filename.slice(filename.lastIndexOf('.'));
-    filename = filename.slice(0, 255 - ext.length) + ext;
-  }
-
-  return filename;
-}
+export function sanitizeFilename(input: unknown): string {}
 
killedBy: sanitizeFilename() — property-based always returns a string
statusReason: Error: Property failed after 1 tests
{ seed: 277977662, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
packages/validation/src/sanitize.ts:358:7
  * Sanitize filename to prevent path traversal and other attacks
  */
 export function sanitizeFilename(input: unknown): string {
-  if (!input) return '';
+  if (input) return '';
 
   let filename = String(input);
killedBy: sanitizeFilename should handle empty input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "null"

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:358:7
  * Sanitize filename to prevent path traversal and other attacks
  */
 export function sanitizeFilename(input: unknown): string {
-  if (!input) return '';
+  if (false) return '';
 
   let filename = String(input);
killedBy: sanitizeFilename should handle empty input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "null"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:367:38
   filename = filename.replace(/[\/\\]/g, '');
 
   // Remove null bytes
-  filename = filename.replace(/\0/g, '');
+  filename = filename.replace(/\0/g, "Stryker was here!");
 
   // Keep only safe characters
killedBy: sanitizeFilename should remove null bytes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "file.txt"
Received: "fileStryker_was_here_.txt"

[Killed] StringLiteral
packages/validation/src/sanitize.ts:370:51
   filename = filename.replace(/\0/g, '');
 
   // Keep only safe characters
-  filename = filename.replace(/[^a-zA-Z0-9._-]/g, '_');
+  filename = filename.replace(/[^a-zA-Z0-9._-]/g, "");
 
   // Limit length
killedBy: sanitizeFilename should replace unsafe characters with underscore
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "file_______.txt"
Received: "file.txt"

[Killed] EqualityOperator
packages/validation/src/sanitize.ts:373:7
   filename = filename.replace(/[^a-zA-Z0-9._-]/g, '_');
 
   // Limit length
-  if (filename.length > 255) {
+  if (filename.length <= 255) {
     const ext = filename.slice(filename.lastIndexOf('.'));
     filename = filename.slice(0, 255 - ext.length) + ext;
killedBy: sanitizeFilename should remove path traversal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "etcpasswd"
Received: "etcpasswdd"

[Killed] ConditionalExpression
packages/validation/src/sanitize.ts:373:7
   filename = filename.replace(/[^a-zA-Z0-9._-]/g, '_');
 
   // Limit length
-  if (filename.length > 255) {
+  if (true) {
     const ext = filename.slice(filename.lastIndexOf('.'));
     filename = filename.slice(0, 255 - ext.length) + ext;
killedBy: sanitizeFilename() — property-based never contains path traversal sequences
statusReason: Error: Property failed after 154 tests
{ seed: 695910602, path: "153:1:0:0", endOnFailure: true }
Counterexample: ["."]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
packages/validation/src/sanitize.ts:374:17
 
   // Limit length
   if (filename.length > 255) {
-    const ext = filename.slice(filename.lastIndexOf('.'));
+    const ext = filename;
     filename = filename.slice(0, 255 - ext.length) + ext;
   }
killedBy: sanitizeFilename should limit filename length
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 255
Received:    559

[Killed] ArithmeticOperator
packages/validation/src/sanitize.ts:375:16
   // Limit length
   if (filename.length > 255) {
     const ext = filename.slice(filename.lastIndexOf('.'));
-    filename = filename.slice(0, 255 - ext.length) + ext;
+    filename = filename.slice(0, 255 - ext.length) - ext;
   }
 
killedBy: sanitizeFilename should limit filename length
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined

[Killed] ArithmeticOperator
packages/validation/src/sanitize.ts:375:34
   // Limit length
   if (filename.length > 255) {
     const ext = filename.slice(filename.lastIndexOf('.'));
-    filename = filename.slice(0, 255 - ext.length) + ext;
+    filename = filename.slice(0, 255 + ext.length) + ext;
   }
 
killedBy: sanitizeFilename should limit filename length
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 255
Received:    263
