[Killed] ConditionalExpression
packages/validation/src/schemas.ts:9:26
  * Custom Zod preprocessor for sanitizing strings
  */
 export const sanitizedString = () =>
-  z.preprocess((val) => (typeof val === 'string' ? sanitizeString(val) : val), z.string());
+  z.preprocess((val) => (false ? sanitizeString(val) : val), z.string());
 
 /**
killedBy: registrationSchema should sanitize name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "John Doe"
Received: "<b>John</b> Doe"

[Killed] ConditionalExpression
packages/validation/src/schemas.ts:9:26
  * Custom Zod preprocessor for sanitizing strings
  */
 export const sanitizedString = () =>
-  z.preprocess((val) => (typeof val === 'string' ? sanitizeString(val) : val), z.string());
+  z.preprocess((val) => (true ? sanitizeString(val) : val), z.string());
 
 /**
killedBy: sanitizedString — preprocessor type-check mutation killer non-string input passes through unchanged (not sanitized)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
packages/validation/src/schemas.ts:17:14
 export const emailSchema = z
   .string()
   .email('Invalid email address')
-  .transform((val) => sanitizeEmail(val))
+  .transform(() => undefined)
   .refine((val) => val.length > 0, 'Invalid email address');
 
killedBy: registrationSchema role enum — StringLiteral mutation killers accepts role=ADMIN
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
packages/validation/src/schemas.ts:18:20
   .string()
   .email('Invalid email address')
   .transform((val) => sanitizeEmail(val))
-  .refine((val) => val.length > 0, 'Invalid email address');
+  .refine((val) => false, 'Invalid email address');
 
 /**
killedBy: emailSchema should accept valid emails
statusReason: Error: expect(received).not.toThrow()

Error name:    "ZodError"
Error message: "[
  {
    \"code\": \"custom\",
    \"message\": \"Invalid email address\",
    \"path\": []

[Killed] EqualityOperator
packages/validation/src/schemas.ts:18:20
   .string()
   .email('Invalid email address')
   .transform((val) => sanitizeEmail(val))
-  .refine((val) => val.length > 0, 'Invalid email address');
+  .refine((val) => val.length <= 0, 'Invalid email address');
 
 /**
killedBy: emailSchema should accept valid emails
statusReason: Error: expect(received).not.toThrow()

Error name:    "ZodError"
Error message: "[
  {
    \"code\": \"custom\",
    \"message\": \"Invalid email address\",
    \"path\": []

[Killed] MethodExpression
packages/validation/src/schemas.ts:23:31
 /**
  * Password schema with strength requirements
  */
-export const passwordSchema = z
-  .string()
-  .min(8, 'Password must be at least 8 characters')
+export const passwordSchema = z.string().max(8, 'Password must be at least 8 characters')
   .max(128, 'Password must be less than 128 characters')
   .refine((val) => /[A-Z]/.test(val), 'Password must contain at least one uppercase letter')
killedBy: registrationSchema role enum — StringLiteral mutation killers accepts role=ADMIN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:23:31
 /**
  * Password schema with strength requirements
  */
-export const passwordSchema = z
-  .string()
-  .min(8, 'Password must be at least 8 characters')
-  .max(128, 'Password must be less than 128 characters')
+export const passwordSchema = z.string().min(8, 'Password must be at least 8 characters').min(128, 'Password must be less than 128 characters')
   .refine((val) => /[A-Z]/.test(val), 'Password must contain at least one uppercase letter')
   .refine((val) => /[a-z]/.test(val), 'Password must contain at least one lowercase letter')
killedBy: passwordSchema should accept strong passwords
statusReason: Error: expect(received).not.toThrow()

Error name:    "ZodError"
Error message: "[
  {
    \"code\": \"too_small\",
    \"minimum\": 128,
    \"type\": \"string\",

[Killed] StringLiteral
packages/validation/src/schemas.ts:26:13
 export const passwordSchema = z
   .string()
   .min(8, 'Password must be at least 8 characters')
-  .max(128, 'Password must be less than 128 characters')
+  .max(128, "")
   .refine((val) => /[A-Z]/.test(val), 'Password must contain at least one uppercase letter')
   .refine((val) => /[a-z]/.test(val), 'Password must contain at least one lowercase letter')
killedBy: passwordSchema should reject passwords over 128 characters
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /less than 128/
Received message: "[
  {
    \"code\": \"too_big\",
    \"maximum\": 128,
    \"type\": \"string\",

[Killed] ArrowFunction
packages/validation/src/schemas.ts:27:11
   .string()
   .min(8, 'Password must be at least 8 characters')
   .max(128, 'Password must be less than 128 characters')
-  .refine((val) => /[A-Z]/.test(val), 'Password must contain at least one uppercase letter')
+  .refine(() => undefined, 'Password must contain at least one uppercase letter')
   .refine((val) => /[a-z]/.test(val), 'Password must contain at least one lowercase letter')
   .refine((val) => /[0-9]/.test(val), 'Password must contain at least one number')
killedBy: passwordSchema should accept strong passwords
statusReason: Error: expect(received).not.toThrow()

Error name:    "ZodError"
Error message: "[
  {
    \"code\": \"custom\",
    \"message\": \"Password must contain at least one uppercase letter\",
    \"path\": []

[Killed] ArrowFunction
packages/validation/src/schemas.ts:28:11
   .min(8, 'Password must be at least 8 characters')
   .max(128, 'Password must be less than 128 characters')
   .refine((val) => /[A-Z]/.test(val), 'Password must contain at least one uppercase letter')
-  .refine((val) => /[a-z]/.test(val), 'Password must contain at least one lowercase letter')
+  .refine(() => undefined, 'Password must contain at least one lowercase letter')
   .refine((val) => /[0-9]/.test(val), 'Password must contain at least one number')
   .refine(
killedBy: passwordSchema should accept strong passwords
statusReason: Error: expect(received).not.toThrow()

Error name:    "ZodError"
Error message: "[
  {
    \"code\": \"custom\",
    \"message\": \"Password must contain at least one lowercase letter\",
    \"path\": []

[Killed] Regex
packages/validation/src/schemas.ts:28:20
   .min(8, 'Password must be at least 8 characters')
   .max(128, 'Password must be less than 128 characters')
   .refine((val) => /[A-Z]/.test(val), 'Password must contain at least one uppercase letter')
-  .refine((val) => /[a-z]/.test(val), 'Password must contain at least one lowercase letter')
+  .refine((val) => /[^a-z]/.test(val), 'Password must contain at least one lowercase letter')
   .refine((val) => /[0-9]/.test(val), 'Password must contain at least one number')
   .refine(
killedBy: passwordSchema should require lowercase
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /lowercase/

Received function did not throw

[Killed] ArrowFunction
packages/validation/src/schemas.ts:29:11
   .max(128, 'Password must be less than 128 characters')
   .refine((val) => /[A-Z]/.test(val), 'Password must contain at least one uppercase letter')
   .refine((val) => /[a-z]/.test(val), 'Password must contain at least one lowercase letter')
-  .refine((val) => /[0-9]/.test(val), 'Password must contain at least one number')
+  .refine(() => undefined, 'Password must contain at least one number')
   .refine(
     (val) => /[^A-Za-z0-9]/.test(val),
killedBy: passwordSchema should accept strong passwords
statusReason: Error: expect(received).not.toThrow()

Error name:    "ZodError"
Error message: "[
  {
    \"code\": \"custom\",
    \"message\": \"Password must contain at least one number\",
    \"path\": []

[Killed] StringLiteral
packages/validation/src/schemas.ts:29:39
   .max(128, 'Password must be less than 128 characters')
   .refine((val) => /[A-Z]/.test(val), 'Password must contain at least one uppercase letter')
   .refine((val) => /[a-z]/.test(val), 'Password must contain at least one lowercase letter')
-  .refine((val) => /[0-9]/.test(val), 'Password must contain at least one number')
+  .refine((val) => /[0-9]/.test(val), "")
   .refine(
     (val) => /[^A-Za-z0-9]/.test(val),
killedBy: passwordSchema should require number
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /number/
Received message: "[
  {
    \"code\": \"custom\",
    \"message\": \"\",
    \"path\": []

[Killed] ArrowFunction
packages/validation/src/schemas.ts:31:5
   .refine((val) => /[a-z]/.test(val), 'Password must contain at least one lowercase letter')
   .refine((val) => /[0-9]/.test(val), 'Password must contain at least one number')
   .refine(
-    (val) => /[^A-Za-z0-9]/.test(val),
+    () => undefined,
     'Password must contain at least one special character'
   );
killedBy: passwordSchema should accept strong passwords
statusReason: Error: expect(received).not.toThrow()

Error name:    "ZodError"
Error message: "[
  {
    \"code\": \"custom\",
    \"message\": \"Password must contain at least one special character\",
    \"path\": []

[Killed] StringLiteral
packages/validation/src/schemas.ts:32:5
   .refine((val) => /[0-9]/.test(val), 'Password must contain at least one number')
   .refine(
     (val) => /[^A-Za-z0-9]/.test(val),
-    'Password must contain at least one special character'
+    ""
   );
 
killedBy: passwordSchema should require special character
statusReason: Error: expect(received).toThrow(expected)

Expected pattern: /special/
Received message: "[
  {
    \"code\": \"custom\",
    \"message\": \"\",
    \"path\": []

[Killed] MethodExpression
packages/validation/src/schemas.ts:38:25
 /**
  * UUID/CUID schema
  */
-export const idSchema = z
-  .string()
-  .min(1, 'ID is required')
+export const idSchema = z.string().max(1, 'ID is required')
   .refine((val) => validator.isUUID(val) || /^c[a-z0-9]{24}$/.test(val), 'Invalid ID format');
 
killedBy: idSchema should accept valid UUIDs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ZodError"
Error message: "[
  {
    \"code\": \"too_big\",
    \"maximum\": 1,
    \"type\": \"string\",

[Killed] LogicalOperator
packages/validation/src/schemas.ts:41:20
 export const idSchema = z
   .string()
   .min(1, 'ID is required')
-  .refine((val) => validator.isUUID(val) || /^c[a-z0-9]{24}$/.test(val), 'Invalid ID format');
+  .refine((val) => validator.isUUID(val) && /^c[a-z0-9]{24}$/.test(val), 'Invalid ID format');
 
 /**
killedBy: idSchema should accept valid UUIDs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ZodError"
Error message: "[
  {
    \"code\": \"custom\",
    \"message\": \"Invalid ID format\",
    \"path\": []

[Killed] ArrowFunction
packages/validation/src/schemas.ts:41:11
 export const idSchema = z
   .string()
   .min(1, 'ID is required')
-  .refine((val) => validator.isUUID(val) || /^c[a-z0-9]{24}$/.test(val), 'Invalid ID format');
+  .refine(() => undefined, 'Invalid ID format');
 
 /**
killedBy: idSchema should accept valid UUIDs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ZodError"
Error message: "[
  {
    \"code\": \"custom\",
    \"message\": \"Invalid ID format\",
    \"path\": []

[Killed] ConditionalExpression
packages/validation/src/schemas.ts:49:20
 export const phoneSchema = z
   .string()
   .optional()
-  .refine((val) => !val || validator.isMobilePhone(val, 'any'), 'Invalid phone number');
+  .refine((val) => false, 'Invalid phone number');
 
 /**
killedBy: updateProfileSchema — method expression mutation killers accepts name of exactly 2 chars — kills max(2) mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
packages/validation/src/schemas.ts:49:20
 export const phoneSchema = z
   .string()
   .optional()
-  .refine((val) => !val || validator.isMobilePhone(val, 'any'), 'Invalid phone number');
+  .refine((val) => val || validator.isMobilePhone(val, 'any'), 'Invalid phone number');
 
 /**
killedBy: phoneSchema should allow undefined
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Expected a string but received a undefined"

      76 |  * Phone number schema
      77 |  */

[Killed] ArrowFunction
packages/validation/src/schemas.ts:58:5
   .string()
   .url('Invalid URL')
   .refine(
-    (val) => !val.startsWith('javascript:') && !val.startsWith('data:'),
+    () => undefined,
     'Invalid URL protocol'
   );
killedBy: urlSchema should accept valid URLs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ZodError"
Error message: "[
  {
    \"code\": \"custom\",
    \"message\": \"Invalid URL protocol\",
    \"path\": []

[Killed] BooleanLiteral
packages/validation/src/schemas.ts:58:14
   .string()
   .url('Invalid URL')
   .refine(
-    (val) => !val.startsWith('javascript:') && !val.startsWith('data:'),
+    (val) => val.startsWith('javascript:') && !val.startsWith('data:'),
     'Invalid URL protocol'
   );
killedBy: urlSchema should accept valid URLs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ZodError"
Error message: "[
  {
    \"code\": \"custom\",
    \"message\": \"Invalid URL protocol\",
    \"path\": []

[Killed] ArrowFunction
packages/validation/src/schemas.ts:67:11
  */
 export const dateSchema = z
   .string()
-  .refine((val) => validator.isISO8601(val), 'Invalid date format')
+  .refine(() => undefined, 'Invalid date format')
   .transform((val) => new Date(val));
 
killedBy: incidentSchema enums — StringLiteral mutation killers accepts type=ACCIDENT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
packages/validation/src/schemas.ts:67:46
  */
 export const dateSchema = z
   .string()
-  .refine((val) => validator.isISO8601(val), 'Invalid date format')
+  .refine((val) => validator.isISO8601(val), "")
   .transform((val) => new Date(val));
 
killedBy: error message StringLiteral mutation killers dateSchema invalid date — error is "Invalid date format"
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Invalid date format"
Received array: [""]

[Killed] ArrowFunction
packages/validation/src/schemas.ts:68:14
 export const dateSchema = z
   .string()
   .refine((val) => validator.isISO8601(val), 'Invalid date format')
-  .transform((val) => new Date(val));
+  .transform(() => undefined);
 
 /**
killedBy: dateSchema — transform mutation killers transforms ISO string to Date object — kills () => undefined arrow function
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Date

Received value has no prototype
Received value: undefined

[Killed] ObjectLiteral
packages/validation/src/schemas.ts:73:42
 /**
  * Pagination schema
  */
-export const paginationSchema = z.object({
-  page: z
-    .string()
-    .optional()
-    .transform((val) => (val ? parseInt(val, 10) : 1))
-    .refine((val) => val > 0, 'Page must be positive'),
-  limit: z
-    .string()
-    .optional()
-    .transform((val) => (val ? Math.min(parseInt(val, 10), 100) : 20))
-    .refine((val) => val > 0 && val <= 100, 'Limit must be between 1 and 100'),
-  sortBy: z.string().optional(),
-  sortOrder: z.enum(['asc', 'desc']).optional().default('desc'),
-});
+export const paginationSchema = z.object({});
 
 /**
killedBy: searchSchema enum — StringLiteral mutation killers rejects sortOrder=""
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
packages/validation/src/schemas.ts:77:16
   page: z
     .string()
     .optional()
-    .transform((val) => (val ? parseInt(val, 10) : 1))
+    .transform(() => undefined)
     .refine((val) => val > 0, 'Page must be positive'),
   limit: z
killedBy: searchSchema enum — StringLiteral mutation killers accepts type=all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
packages/validation/src/schemas.ts:78:22
     .string()
     .optional()
     .transform((val) => (val ? parseInt(val, 10) : 1))
-    .refine((val) => val > 0, 'Page must be positive'),
+    .refine((val) => true, 'Page must be positive'),
   limit: z
     .string()
killedBy: paginationSchema should reject invalid page numbers
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
packages/validation/src/schemas.ts:78:22
     .string()
     .optional()
     .transform((val) => (val ? parseInt(val, 10) : 1))
-    .refine((val) => val > 0, 'Page must be positive'),
+    .refine((val) => false, 'Page must be positive'),
   limit: z
     .string()
killedBy: paginationSchema should parse valid pagination params
statusReason: ZodError: [
  {
    "code": "custom",
    "message": "Page must be positive",
    "path": [
      "page"
    ]
  }

[Killed] MethodExpression
packages/validation/src/schemas.ts:82:32
   limit: z
     .string()
     .optional()
-    .transform((val) => (val ? Math.min(parseInt(val, 10), 100) : 20))
+    .transform((val) => (val ? Math.max(parseInt(val, 10), 100) : 20))
     .refine((val) => val > 0 && val <= 100, 'Limit must be between 1 and 100'),
   sortBy: z.string().optional(),
killedBy: paginationSchema should parse valid pagination params
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 100

[Killed] ArrowFunction
packages/validation/src/schemas.ts:82:16
   limit: z
     .string()
     .optional()
-    .transform((val) => (val ? Math.min(parseInt(val, 10), 100) : 20))
+    .transform(() => undefined)
     .refine((val) => val > 0 && val <= 100, 'Limit must be between 1 and 100'),
   sortBy: z.string().optional(),
killedBy: paginationSchema should parse valid pagination params
statusReason: ZodError: [
  {
    "code": "custom",
    "message": "Limit must be between 1 and 100",
    "path": [
      "limit"
    ]
  }

[Killed] ConditionalExpression
packages/validation/src/schemas.ts:83:22
     .string()
     .optional()
     .transform((val) => (val ? Math.min(parseInt(val, 10), 100) : 20))
-    .refine((val) => val > 0 && val <= 100, 'Limit must be between 1 and 100'),
+    .refine((val) => true, 'Limit must be between 1 and 100'),
   sortBy: z.string().optional(),
   sortOrder: z.enum(['asc', 'desc']).optional().default('desc'),
killedBy: paginationSchema — mutation killers rejects limit=0 — kills > 0 condition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
packages/validation/src/schemas.ts:83:22
     .string()
     .optional()
     .transform((val) => (val ? Math.min(parseInt(val, 10), 100) : 20))
-    .refine((val) => val > 0 && val <= 100, 'Limit must be between 1 and 100'),
+    .refine((val) => true && val <= 100, 'Limit must be between 1 and 100'),
   sortBy: z.string().optional(),
   sortOrder: z.enum(['asc', 'desc']).optional().default('desc'),
killedBy: paginationSchema — mutation killers rejects limit=0 — kills > 0 condition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrayDeclaration
packages/validation/src/schemas.ts:85:21
     .transform((val) => (val ? Math.min(parseInt(val, 10), 100) : 20))
     .refine((val) => val > 0 && val <= 100, 'Limit must be between 1 and 100'),
   sortBy: z.string().optional(),
-  sortOrder: z.enum(['asc', 'desc']).optional().default('desc'),
+  sortOrder: z.enum([]).optional().default('desc'),
 });
 
killedBy: searchSchema enum — StringLiteral mutation killers accepts type=all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
packages/validation/src/schemas.ts:85:57
     .transform((val) => (val ? Math.min(parseInt(val, 10), 100) : 20))
     .refine((val) => val > 0 && val <= 100, 'Limit must be between 1 and 100'),
   sortBy: z.string().optional(),
-  sortOrder: z.enum(['asc', 'desc']).optional().default('desc'),
+  sortOrder: z.enum(['asc', 'desc']).optional().default(""),
 });
 
killedBy: paginationSchema should use defaults for missing values
statusReason: ZodError: [
  {
    "received": "",
    "code": "invalid_enum_value",
    "options": [
      "asc",
      "desc"
    ],

[Killed] MethodExpression
packages/validation/src/schemas.ts:92:33
  * Common risk schema
  */
 export const riskSchema = z.object({
-  title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').max(200)),
+  title: sanitizedString().pipe(z.string().max(3, 'Title must be at least 3 characters').max(200)),
   description: sanitizedString().pipe(z.string().max(5000).optional()),
   severity: z.enum(['LOW', 'MEDIUM', 'HIGH', 'CRITICAL']),
killedBy: riskSchema enums — StringLiteral mutation killers accepts severity=LOW
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:92:33
  * Common risk schema
  */
 export const riskSchema = z.object({
-  title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').max(200)),
+  title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').min(200)),
   description: sanitizedString().pipe(z.string().max(5000).optional()),
   severity: z.enum(['LOW', 'MEDIUM', 'HIGH', 'CRITICAL']),
killedBy: riskSchema enums — StringLiteral mutation killers accepts severity=LOW
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:93:39
  */
 export const riskSchema = z.object({
   title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').max(200)),
-  description: sanitizedString().pipe(z.string().max(5000).optional()),
+  description: sanitizedString().pipe(z.string().min(5000).optional()),
   severity: z.enum(['LOW', 'MEDIUM', 'HIGH', 'CRITICAL']),
   likelihood: z.enum(['RARE', 'UNLIKELY', 'POSSIBLE', 'LIKELY', 'ALMOST_CERTAIN']).optional(),
killedBy: riskSchema enums — StringLiteral mutation killers accepts severity=LOW
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
packages/validation/src/schemas.ts:95:65
   title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').max(200)),
   description: sanitizedString().pipe(z.string().max(5000).optional()),
   severity: z.enum(['LOW', 'MEDIUM', 'HIGH', 'CRITICAL']),
-  likelihood: z.enum(['RARE', 'UNLIKELY', 'POSSIBLE', 'LIKELY', 'ALMOST_CERTAIN']).optional(),
+  likelihood: z.enum(['RARE', 'UNLIKELY', 'POSSIBLE', 'LIKELY', ""]).optional(),
   status: z.enum(['OPEN', 'IN_PROGRESS', 'MITIGATED', 'CLOSED']).optional(),
   category: sanitizedString().pipe(z.string().max(100).optional()),
killedBy: riskSchema enums — StringLiteral mutation killers accepts likelihood=ALMOST_CERTAIN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrayDeclaration
packages/validation/src/schemas.ts:95:22
   title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').max(200)),
   description: sanitizedString().pipe(z.string().max(5000).optional()),
   severity: z.enum(['LOW', 'MEDIUM', 'HIGH', 'CRITICAL']),
-  likelihood: z.enum(['RARE', 'UNLIKELY', 'POSSIBLE', 'LIKELY', 'ALMOST_CERTAIN']).optional(),
+  likelihood: z.enum([]).optional(),
   status: z.enum(['OPEN', 'IN_PROGRESS', 'MITIGATED', 'CLOSED']).optional(),
   category: sanitizedString().pipe(z.string().max(100).optional()),
killedBy: riskSchema enums — StringLiteral mutation killers accepts likelihood=RARE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
packages/validation/src/schemas.ts:96:42
   description: sanitizedString().pipe(z.string().max(5000).optional()),
   severity: z.enum(['LOW', 'MEDIUM', 'HIGH', 'CRITICAL']),
   likelihood: z.enum(['RARE', 'UNLIKELY', 'POSSIBLE', 'LIKELY', 'ALMOST_CERTAIN']).optional(),
-  status: z.enum(['OPEN', 'IN_PROGRESS', 'MITIGATED', 'CLOSED']).optional(),
+  status: z.enum(['OPEN', 'IN_PROGRESS', "", 'CLOSED']).optional(),
   category: sanitizedString().pipe(z.string().max(100).optional()),
   mitigation: sanitizedString().pipe(z.string().max(5000).optional()),
killedBy: riskSchema enums — StringLiteral mutation killers accepts status=MITIGATED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
packages/validation/src/schemas.ts:96:27
   description: sanitizedString().pipe(z.string().max(5000).optional()),
   severity: z.enum(['LOW', 'MEDIUM', 'HIGH', 'CRITICAL']),
   likelihood: z.enum(['RARE', 'UNLIKELY', 'POSSIBLE', 'LIKELY', 'ALMOST_CERTAIN']).optional(),
-  status: z.enum(['OPEN', 'IN_PROGRESS', 'MITIGATED', 'CLOSED']).optional(),
+  status: z.enum(['OPEN', "", 'MITIGATED', 'CLOSED']).optional(),
   category: sanitizedString().pipe(z.string().max(100).optional()),
   mitigation: sanitizedString().pipe(z.string().max(5000).optional()),
killedBy: riskSchema enums — StringLiteral mutation killers accepts status=IN_PROGRESS
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:97:36
   severity: z.enum(['LOW', 'MEDIUM', 'HIGH', 'CRITICAL']),
   likelihood: z.enum(['RARE', 'UNLIKELY', 'POSSIBLE', 'LIKELY', 'ALMOST_CERTAIN']).optional(),
   status: z.enum(['OPEN', 'IN_PROGRESS', 'MITIGATED', 'CLOSED']).optional(),
-  category: sanitizedString().pipe(z.string().max(100).optional()),
+  category: sanitizedString().pipe(z.string().min(100).optional()),
   mitigation: sanitizedString().pipe(z.string().max(5000).optional()),
   assigneeId: idSchema.optional(),
killedBy: riskSchema enums — StringLiteral mutation killers accepts severity=LOW
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:98:38
   likelihood: z.enum(['RARE', 'UNLIKELY', 'POSSIBLE', 'LIKELY', 'ALMOST_CERTAIN']).optional(),
   status: z.enum(['OPEN', 'IN_PROGRESS', 'MITIGATED', 'CLOSED']).optional(),
   category: sanitizedString().pipe(z.string().max(100).optional()),
-  mitigation: sanitizedString().pipe(z.string().max(5000).optional()),
+  mitigation: sanitizedString().pipe(z.string().min(5000).optional()),
   assigneeId: idSchema.optional(),
   dueDate: dateSchema.optional(),
killedBy: riskSchema enums — StringLiteral mutation killers accepts severity=LOW
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
packages/validation/src/schemas.ts:106:40
 /**
  * Incident schema
  */
-export const incidentSchema = z.object({
-  title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').max(200)),
-  description: sanitizedString().pipe(z.string().max(10000)),
-  type: z.enum(['ACCIDENT', 'NEAR_MISS', 'HAZARD', 'ENVIRONMENTAL', 'QUALITY']),
-  severity: z.enum(['MINOR', 'MODERATE', 'MAJOR', 'CRITICAL']),
-  status: z.enum(['REPORTED', 'INVESTIGATING', 'RESOLVED', 'CLOSED']).optional(),
-  location: sanitizedString().pipe(z.string().max(200).optional()),
-  occurredAt: dateSchema,
-  reportedById: idSchema.optional(),
-});
+export const incidentSchema = z.object({});
 
 /**
killedBy: incidentSchema enums — StringLiteral mutation killers rejects type=""
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
packages/validation/src/schemas.ts:107:33
  * Incident schema
  */
 export const incidentSchema = z.object({
-  title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').max(200)),
+  title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').min(200)),
   description: sanitizedString().pipe(z.string().max(10000)),
   type: z.enum(['ACCIDENT', 'NEAR_MISS', 'HAZARD', 'ENVIRONMENTAL', 'QUALITY']),
killedBy: incidentSchema enums — StringLiteral mutation killers accepts type=ACCIDENT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:107:33
  * Incident schema
  */
 export const incidentSchema = z.object({
-  title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').max(200)),
+  title: sanitizedString().pipe(z.string().max(3, 'Title must be at least 3 characters').max(200)),
   description: sanitizedString().pipe(z.string().max(10000)),
   type: z.enum(['ACCIDENT', 'NEAR_MISS', 'HAZARD', 'ENVIRONMENTAL', 'QUALITY']),
killedBy: incidentSchema enums — StringLiteral mutation killers accepts type=ACCIDENT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
