[Killed] MethodExpression
packages/validation/src/schemas.ts:108:39
  */
 export const incidentSchema = z.object({
   title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').max(200)),
-  description: sanitizedString().pipe(z.string().max(10000)),
+  description: sanitizedString().pipe(z.string().min(10000)),
   type: z.enum(['ACCIDENT', 'NEAR_MISS', 'HAZARD', 'ENVIRONMENTAL', 'QUALITY']),
   severity: z.enum(['MINOR', 'MODERATE', 'MAJOR', 'CRITICAL']),
killedBy: incidentSchema enums — StringLiteral mutation killers accepts type=ACCIDENT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
packages/validation/src/schemas.ts:109:52
 export const incidentSchema = z.object({
   title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').max(200)),
   description: sanitizedString().pipe(z.string().max(10000)),
-  type: z.enum(['ACCIDENT', 'NEAR_MISS', 'HAZARD', 'ENVIRONMENTAL', 'QUALITY']),
+  type: z.enum(['ACCIDENT', 'NEAR_MISS', 'HAZARD', "", 'QUALITY']),
   severity: z.enum(['MINOR', 'MODERATE', 'MAJOR', 'CRITICAL']),
   status: z.enum(['REPORTED', 'INVESTIGATING', 'RESOLVED', 'CLOSED']).optional(),
killedBy: incidentSchema enums — StringLiteral mutation killers accepts type=ENVIRONMENTAL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
packages/validation/src/schemas.ts:109:17
 export const incidentSchema = z.object({
   title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').max(200)),
   description: sanitizedString().pipe(z.string().max(10000)),
-  type: z.enum(['ACCIDENT', 'NEAR_MISS', 'HAZARD', 'ENVIRONMENTAL', 'QUALITY']),
+  type: z.enum(["", 'NEAR_MISS', 'HAZARD', 'ENVIRONMENTAL', 'QUALITY']),
   severity: z.enum(['MINOR', 'MODERATE', 'MAJOR', 'CRITICAL']),
   status: z.enum(['REPORTED', 'INVESTIGATING', 'RESOLVED', 'CLOSED']).optional(),
killedBy: incidentSchema enums — StringLiteral mutation killers accepts type=ACCIDENT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
packages/validation/src/schemas.ts:110:51
   title: sanitizedString().pipe(z.string().min(3, 'Title must be at least 3 characters').max(200)),
   description: sanitizedString().pipe(z.string().max(10000)),
   type: z.enum(['ACCIDENT', 'NEAR_MISS', 'HAZARD', 'ENVIRONMENTAL', 'QUALITY']),
-  severity: z.enum(['MINOR', 'MODERATE', 'MAJOR', 'CRITICAL']),
+  severity: z.enum(['MINOR', 'MODERATE', 'MAJOR', ""]),
   status: z.enum(['REPORTED', 'INVESTIGATING', 'RESOLVED', 'CLOSED']).optional(),
   location: sanitizedString().pipe(z.string().max(200).optional()),
killedBy: incidentSchema enums — StringLiteral mutation killers accepts severity=CRITICAL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrayDeclaration
packages/validation/src/schemas.ts:111:18
   description: sanitizedString().pipe(z.string().max(10000)),
   type: z.enum(['ACCIDENT', 'NEAR_MISS', 'HAZARD', 'ENVIRONMENTAL', 'QUALITY']),
   severity: z.enum(['MINOR', 'MODERATE', 'MAJOR', 'CRITICAL']),
-  status: z.enum(['REPORTED', 'INVESTIGATING', 'RESOLVED', 'CLOSED']).optional(),
+  status: z.enum([]).optional(),
   location: sanitizedString().pipe(z.string().max(200).optional()),
   occurredAt: dateSchema,
killedBy: incidentSchema enums — StringLiteral mutation killers accepts status=REPORTED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
packages/validation/src/schemas.ts:111:19
   description: sanitizedString().pipe(z.string().max(10000)),
   type: z.enum(['ACCIDENT', 'NEAR_MISS', 'HAZARD', 'ENVIRONMENTAL', 'QUALITY']),
   severity: z.enum(['MINOR', 'MODERATE', 'MAJOR', 'CRITICAL']),
-  status: z.enum(['REPORTED', 'INVESTIGATING', 'RESOLVED', 'CLOSED']).optional(),
+  status: z.enum(["", 'INVESTIGATING', 'RESOLVED', 'CLOSED']).optional(),
   location: sanitizedString().pipe(z.string().max(200).optional()),
   occurredAt: dateSchema,
killedBy: incidentSchema enums — StringLiteral mutation killers accepts status=REPORTED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:112:36
   type: z.enum(['ACCIDENT', 'NEAR_MISS', 'HAZARD', 'ENVIRONMENTAL', 'QUALITY']),
   severity: z.enum(['MINOR', 'MODERATE', 'MAJOR', 'CRITICAL']),
   status: z.enum(['REPORTED', 'INVESTIGATING', 'RESOLVED', 'CLOSED']).optional(),
-  location: sanitizedString().pipe(z.string().max(200).optional()),
+  location: sanitizedString().pipe(z.string().min(200).optional()),
   occurredAt: dateSchema,
   reportedById: idSchema.optional(),
killedBy: incidentSchema enums — StringLiteral mutation killers accepts type=ACCIDENT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:123:32
 export const registrationSchema = z.object({
   email: emailSchema,
   password: passwordSchema,
-  name: sanitizedString().pipe(z.string().min(2, 'Name must be at least 2 characters').max(100)),
+  name: sanitizedString().pipe(z.string().max(2, 'Name must be at least 2 characters').max(100)),
   role: z.enum(['ADMIN', 'MANAGER', 'USER', 'VIEWER']).optional(),
 });
killedBy: registrationSchema role enum — StringLiteral mutation killers accepts role=ADMIN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:123:32
 export const registrationSchema = z.object({
   email: emailSchema,
   password: passwordSchema,
-  name: sanitizedString().pipe(z.string().min(2, 'Name must be at least 2 characters').max(100)),
+  name: sanitizedString().pipe(z.string().min(2, 'Name must be at least 2 characters').min(100)),
   role: z.enum(['ADMIN', 'MANAGER', 'USER', 'VIEWER']).optional(),
 });
killedBy: registrationSchema role enum — StringLiteral mutation killers accepts role=ADMIN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrayDeclaration
packages/validation/src/schemas.ts:124:16
   email: emailSchema,
   password: passwordSchema,
   name: sanitizedString().pipe(z.string().min(2, 'Name must be at least 2 characters').max(100)),
-  role: z.enum(['ADMIN', 'MANAGER', 'USER', 'VIEWER']).optional(),
+  role: z.enum([]).optional(),
 });
 
killedBy: registrationSchema should accept optional role
statusReason: ZodError: [
  {
    "received": "ADMIN",
    "code": "invalid_enum_value",
    "options": [],
    "path": [
      "role"
    ],

[Killed] StringLiteral
packages/validation/src/schemas.ts:124:26
   email: emailSchema,
   password: passwordSchema,
   name: sanitizedString().pipe(z.string().min(2, 'Name must be at least 2 characters').max(100)),
-  role: z.enum(['ADMIN', 'MANAGER', 'USER', 'VIEWER']).optional(),
+  role: z.enum(['ADMIN', "", 'USER', 'VIEWER']).optional(),
 });
 
killedBy: registrationSchema role enum — StringLiteral mutation killers accepts role=MANAGER
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:132:13
  */
 export const loginSchema = z.object({
   email: emailSchema,
-  password: z.string().min(1, 'Password is required'),
+  password: z.string().max(1, 'Password is required'),
   rememberMe: z.boolean().optional(),
 });
killedBy: loginSchema should accept valid login data
statusReason: ZodError: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "Password is required",

[Killed] ObjectLiteral
packages/validation/src/schemas.ts:139:45
 /**
  * Update profile schema
  */
-export const updateProfileSchema = z.object({
-  name: sanitizedString().pipe(z.string().min(2).max(100)).optional(),
-  phone: phoneSchema,
-  department: sanitizedString().pipe(z.string().max(100).optional()),
-  title: sanitizedString().pipe(z.string().max(100).optional()),
-});
+export const updateProfileSchema = z.object({});
 
 /**
killedBy: updateProfileSchema — method expression mutation killers rejects name of 101 chars — kills removal of max(100)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
packages/validation/src/schemas.ts:140:32
  * Update profile schema
  */
 export const updateProfileSchema = z.object({
-  name: sanitizedString().pipe(z.string().min(2).max(100)).optional(),
+  name: sanitizedString().pipe(z.string().min(2).min(100)).optional(),
   phone: phoneSchema,
   department: sanitizedString().pipe(z.string().max(100).optional()),
killedBy: updateProfileSchema — method expression mutation killers accepts name of exactly 2 chars — kills max(2) mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:140:32
  * Update profile schema
  */
 export const updateProfileSchema = z.object({
-  name: sanitizedString().pipe(z.string().min(2).max(100)).optional(),
+  name: sanitizedString().pipe(z.string().max(2).max(100)).optional(),
   phone: phoneSchema,
   department: sanitizedString().pipe(z.string().max(100).optional()),
killedBy: updateProfileSchema — method expression mutation killers accepts name of exactly 100 chars — kills min(100) mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:142:38
 export const updateProfileSchema = z.object({
   name: sanitizedString().pipe(z.string().min(2).max(100)).optional(),
   phone: phoneSchema,
-  department: sanitizedString().pipe(z.string().max(100).optional()),
+  department: sanitizedString().pipe(z.string().min(100).optional()),
   title: sanitizedString().pipe(z.string().max(100).optional()),
 });
killedBy: updateProfileSchema — method expression mutation killers accepts name of exactly 2 chars — kills max(2) mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:143:33
   name: sanitizedString().pipe(z.string().min(2).max(100)).optional(),
   phone: phoneSchema,
   department: sanitizedString().pipe(z.string().max(100).optional()),
-  title: sanitizedString().pipe(z.string().max(100).optional()),
+  title: sanitizedString().pipe(z.string().min(100).optional()),
 });
 
killedBy: updateProfileSchema — method expression mutation killers accepts name of exactly 2 chars — kills max(2) mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:151:22
  */
 export const changePasswordSchema = z
   .object({
-    currentPassword: z.string().min(1, 'Current password is required'),
+    currentPassword: z.string().max(1, 'Current password is required'),
     newPassword: passwordSchema,
     confirmPassword: z.string().min(1, 'Password confirmation is required'),
killedBy: changePasswordSchema — refine mutation killers succeeds when newPassword === confirmPassword — kills () => undefined mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:153:22
   .object({
     currentPassword: z.string().min(1, 'Current password is required'),
     newPassword: passwordSchema,
-    confirmPassword: z.string().min(1, 'Password confirmation is required'),
+    confirmPassword: z.string().max(1, 'Password confirmation is required'),
   })
   .refine((data) => data.newPassword === data.confirmPassword, {
killedBy: changePasswordSchema — refine mutation killers succeeds when newPassword === confirmPassword — kills () => undefined mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
packages/validation/src/schemas.ts:155:11
     newPassword: passwordSchema,
     confirmPassword: z.string().min(1, 'Password confirmation is required'),
   })
-  .refine((data) => data.newPassword === data.confirmPassword, {
+  .refine(() => undefined, {
     message: 'Passwords do not match',
     path: ['confirmPassword'],
killedBy: changePasswordSchema — refine mutation killers succeeds when newPassword === confirmPassword — kills () => undefined mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
packages/validation/src/schemas.ts:155:21
     newPassword: passwordSchema,
     confirmPassword: z.string().min(1, 'Password confirmation is required'),
   })
-  .refine((data) => data.newPassword === data.confirmPassword, {
+  .refine((data) => false, {
     message: 'Passwords do not match',
     path: ['confirmPassword'],
killedBy: changePasswordSchema — refine mutation killers succeeds when newPassword === confirmPassword — kills () => undefined mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
packages/validation/src/schemas.ts:163:38
 /**
  * Search schema
  */
-export const searchSchema = z.object({
-  q: sanitizedString().pipe(z.string().min(1).max(200)),
-  type: z.enum(['all', 'risks', 'incidents', 'documents', 'users']).optional(),
-  ...paginationSchema.shape,
-});
+export const searchSchema = z.object({});
 
 // Type exports
killedBy: searchSchema enum — StringLiteral mutation killers rejects type="" — kills empty-string mutation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
packages/validation/src/schemas.ts:164:29
  * Search schema
  */
 export const searchSchema = z.object({
-  q: sanitizedString().pipe(z.string().min(1).max(200)),
+  q: sanitizedString().pipe(z.string().max(1).max(200)),
   type: z.enum(['all', 'risks', 'incidents', 'documents', 'users']).optional(),
   ...paginationSchema.shape,
killedBy: searchSchema enum — StringLiteral mutation killers accepts type=all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/validation/src/schemas.ts:164:29
  * Search schema
  */
 export const searchSchema = z.object({
-  q: sanitizedString().pipe(z.string().min(1).max(200)),
+  q: sanitizedString().pipe(z.string().min(1).min(200)),
   type: z.enum(['all', 'risks', 'incidents', 'documents', 'users']).optional(),
   ...paginationSchema.shape,
killedBy: searchSchema enum — StringLiteral mutation killers accepts type=all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
packages/validation/src/schemas.ts:165:24
  */
 export const searchSchema = z.object({
   q: sanitizedString().pipe(z.string().min(1).max(200)),
-  type: z.enum(['all', 'risks', 'incidents', 'documents', 'users']).optional(),
+  type: z.enum(['all', "", 'incidents', 'documents', 'users']).optional(),
   ...paginationSchema.shape,
 });
killedBy: searchSchema enum — StringLiteral mutation killers accepts type=risks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
