[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:9:49
  * Strip all HTML tags from a string.
  * "<p>Hello <b>world</b></p>" → "Hello world"
  */
-export function stripHtml(html: string): string {
-  return html.replace(/<[^>]*>/g, '');
-}
+export function stripHtml(html: string): string {}
 
 /**
killedBy: stripHtml strips simple tag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bold"
Received: undefined

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:10:23
  * "<p>Hello <b>world</b></p>" → "Hello world"
  */
 export function stripHtml(html: string): string {
-  return html.replace(/<[^>]*>/g, '');
+  return html.replace(/<[>]*>/g, '');
 }
 
killedBy: stripHtml strips simple tag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bold"
Received: "<b>bold</b>"

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:10:23
  * "<p>Hello <b>world</b></p>" → "Hello world"
  */
 export function stripHtml(html: string): string {
-  return html.replace(/<[^>]*>/g, '');
+  return html.replace(/<[^>]>/g, '');
 }
 
killedBy: stripHtml strips simple tag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bold"
Received: "bold</b>"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:17:47
  * Escape HTML special characters.
  * & → &amp;  < → &lt;  > → &gt;  " → &quot;  ' → &#39;
  */
-export function escapeHtml(s: string): string {
-  return s
-    .replace(/&/g, '&amp;')
-    .replace(/</g, '&lt;')
-    .replace(/>/g, '&gt;')
-    .replace(/"/g, '&quot;')
-    .replace(/'/g, '&#39;');
-}
+export function escapeHtml(s: string): string {}
 
 /**
killedBy: escapeHtml escapes ampersand
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&amp;"
Received: undefined

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:30:49
  * Unescape HTML entities back to characters.
  * Reverses escapeHtml; also handles &nbsp; → " ", &copy; → "©", etc.
  */
-export function unescapeHtml(s: string): string {
-  return s
-    .replace(/&amp;/g, '&')
-    .replace(/&lt;/g, '<')
-    .replace(/&gt;/g, '>')
-    .replace(/&quot;/g, '"')
-    .replace(/&#39;/g, "'")
-    .replace(/&apos;/g, "'")
-    .replace(/&nbsp;/g, ' ')
-    .replace(/&copy;/g, '©')
-    .replace(/&reg;/g, '®')
-    .replace(/&trade;/g, '™')
-    .replace(/&mdash;/g, '—')
-    .replace(/&ndash;/g, '–')
-    .replace(/&laquo;/g, '«')
-    .replace(/&raquo;/g, '»')
-    .replace(/&hellip;/g, '…')
-    .replace(/&#(\d+);/g, (_, dec) => String.fromCharCode(Number(dec)))
-    .replace(/&#x([0-9a-fA-F]+);/g, (_, hex) => String.fromCharCode(parseInt(hex, 16)));
-}
+export function unescapeHtml(s: string): string {}
 
 export interface SanitizeHtmlOptions {
killedBy: unescapeHtml unescapes &amp;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&"
Received: undefined

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:33:23
 export function unescapeHtml(s: string): string {
   return s
     .replace(/&amp;/g, '&')
-    .replace(/&lt;/g, '<')
+    .replace(/&lt;/g, "")
     .replace(/&gt;/g, '>')
     .replace(/&quot;/g, '"')
killedBy: unescapeHtml unescapes &lt;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<"
Received: ""

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:36:24
     .replace(/&lt;/g, '<')
     .replace(/&gt;/g, '>')
     .replace(/&quot;/g, '"')
-    .replace(/&#39;/g, "'")
+    .replace(/&#39;/g, "")
     .replace(/&apos;/g, "'")
     .replace(/&nbsp;/g, ' ')
killedBy: unescapeHtml unescapes &#39;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "'"
Received: ""

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:37:25
     .replace(/&gt;/g, '>')
     .replace(/&quot;/g, '"')
     .replace(/&#39;/g, "'")
-    .replace(/&apos;/g, "'")
+    .replace(/&apos;/g, "")
     .replace(/&nbsp;/g, ' ')
     .replace(/&copy;/g, '©')
killedBy: unescapeHtml unescapes &apos;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "'"
Received: ""

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:41:26
     .replace(/&nbsp;/g, ' ')
     .replace(/&copy;/g, '©')
     .replace(/&reg;/g, '®')
-    .replace(/&trade;/g, '™')
+    .replace(/&trade;/g, "")
     .replace(/&mdash;/g, '—')
     .replace(/&ndash;/g, '–')
killedBy: unescapeHtml unescapes &trade;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "™"
Received: ""

[Killed] ArrowFunction
packages/sanitize-utils/src/sanitize-utils.ts:47:27
     .replace(/&laquo;/g, '«')
     .replace(/&raquo;/g, '»')
     .replace(/&hellip;/g, '…')
-    .replace(/&#(\d+);/g, (_, dec) => String.fromCharCode(Number(dec)))
+    .replace(/&#(\d+);/g, () => undefined)
     .replace(/&#x([0-9a-fA-F]+);/g, (_, hex) => String.fromCharCode(parseInt(hex, 16)));
 }
killedBy: unescapeHtml handles &#65; decimal entity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: "undefined"

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:47:14
     .replace(/&laquo;/g, '«')
     .replace(/&raquo;/g, '»')
     .replace(/&hellip;/g, '…')
-    .replace(/&#(\d+);/g, (_, dec) => String.fromCharCode(Number(dec)))
+    .replace(/&#(\d);/g, (_, dec) => String.fromCharCode(Number(dec)))
     .replace(/&#x([0-9a-fA-F]+);/g, (_, hex) => String.fromCharCode(parseInt(hex, 16)));
 }
killedBy: unescapeHtml handles &#65; decimal entity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: "&#65;"

[Killed] ArrowFunction
packages/sanitize-utils/src/sanitize-utils.ts:48:37
     .replace(/&raquo;/g, '»')
     .replace(/&hellip;/g, '…')
     .replace(/&#(\d+);/g, (_, dec) => String.fromCharCode(Number(dec)))
-    .replace(/&#x([0-9a-fA-F]+);/g, (_, hex) => String.fromCharCode(parseInt(hex, 16)));
+    .replace(/&#x([0-9a-fA-F]+);/g, () => undefined);
 }
 
killedBy: unescapeHtml handles &#x41; hex entity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: "undefined"

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:57:46
   stripComments?: boolean;
 }
 
-const DEFAULT_ALLOWED_TAGS = ['b', 'i', 'u', 'em', 'strong', 'p', 'br', 'ul', 'ol', 'li', 'a', 'span'];
+const DEFAULT_ALLOWED_TAGS = ['b', 'i', 'u', "", 'strong', 'p', 'br', 'ul', 'ol', 'li', 'a', 'span'];
 const DEFAULT_ALLOWED_ATTRS = ['href', 'title', 'class'];
 
killedBy: sanitizeHtml allows <em> by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<em>"
Received string:    "em"

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:57:62
   stripComments?: boolean;
 }
 
-const DEFAULT_ALLOWED_TAGS = ['b', 'i', 'u', 'em', 'strong', 'p', 'br', 'ul', 'ol', 'li', 'a', 'span'];
+const DEFAULT_ALLOWED_TAGS = ['b', 'i', 'u', 'em', 'strong', "", 'br', 'ul', 'ol', 'li', 'a', 'span'];
 const DEFAULT_ALLOWED_ATTRS = ['href', 'title', 'class'];
 
killedBy: sanitizeHtml allows <p> by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<p>"
Received string:    "para"

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:58:49
 }
 
 const DEFAULT_ALLOWED_TAGS = ['b', 'i', 'u', 'em', 'strong', 'p', 'br', 'ul', 'ol', 'li', 'a', 'span'];
-const DEFAULT_ALLOWED_ATTRS = ['href', 'title', 'class'];
+const DEFAULT_ALLOWED_ATTRS = ['href', 'title', ""];
 
 /**
killedBy: sanitizeHtml allows class attr by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "class=\"x\""
Received string:    "<span>t</span>"

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:58:40
 }
 
 const DEFAULT_ALLOWED_TAGS = ['b', 'i', 'u', 'em', 'strong', 'p', 'br', 'ul', 'ol', 'li', 'a', 'span'];
-const DEFAULT_ALLOWED_ATTRS = ['href', 'title', 'class'];
+const DEFAULT_ALLOWED_ATTRS = ['href', "", 'class'];
 
 /**
killedBy: sanitizeHtml allows title attr by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "title=\"tip\""
Received string:    "<a>link</a>"

[Killed] OptionalChaining
packages/sanitize-utils/src/sanitize-utils.ts:65:23
  * Removes disallowed tags and attributes, strips comments if requested.
  */
 export function sanitizeHtml(html: string, opts?: SanitizeHtmlOptions): string {
-  const allowedTags = opts?.allowedTags ?? DEFAULT_ALLOWED_TAGS;
+  const allowedTags = opts.allowedTags ?? DEFAULT_ALLOWED_TAGS;
   const allowedAttrs = opts?.allowedAttrs ?? DEFAULT_ALLOWED_ATTRS;
   const stripComments = opts?.stripComments ?? true;
killedBy: sanitizeHtml allows <b> by default
statusReason: TypeError: Cannot read properties of undefined (reading 'allowedTags')

[Killed] LogicalOperator
packages/sanitize-utils/src/sanitize-utils.ts:65:23
  * Removes disallowed tags and attributes, strips comments if requested.
  */
 export function sanitizeHtml(html: string, opts?: SanitizeHtmlOptions): string {
-  const allowedTags = opts?.allowedTags ?? DEFAULT_ALLOWED_TAGS;
+  const allowedTags = opts?.allowedTags && DEFAULT_ALLOWED_TAGS;
   const allowedAttrs = opts?.allowedAttrs ?? DEFAULT_ALLOWED_ATTRS;
   const stripComments = opts?.stripComments ?? true;
killedBy: sanitizeHtml allows <b> by default
statusReason: TypeError: Cannot read properties of undefined (reading 'includes')

[Killed] LogicalOperator
packages/sanitize-utils/src/sanitize-utils.ts:66:24
  */
 export function sanitizeHtml(html: string, opts?: SanitizeHtmlOptions): string {
   const allowedTags = opts?.allowedTags ?? DEFAULT_ALLOWED_TAGS;
-  const allowedAttrs = opts?.allowedAttrs ?? DEFAULT_ALLOWED_ATTRS;
+  const allowedAttrs = opts?.allowedAttrs && DEFAULT_ALLOWED_ATTRS;
   const stripComments = opts?.stripComments ?? true;
 
killedBy: sanitizeHtml allows href attr by default
statusReason: TypeError: Cannot read properties of undefined (reading 'includes')

[Killed] OptionalChaining
packages/sanitize-utils/src/sanitize-utils.ts:66:24
  */
 export function sanitizeHtml(html: string, opts?: SanitizeHtmlOptions): string {
   const allowedTags = opts?.allowedTags ?? DEFAULT_ALLOWED_TAGS;
-  const allowedAttrs = opts?.allowedAttrs ?? DEFAULT_ALLOWED_ATTRS;
+  const allowedAttrs = opts.allowedAttrs ?? DEFAULT_ALLOWED_ATTRS;
   const stripComments = opts?.stripComments ?? true;
 
killedBy: sanitizeHtml allows <b> by default
statusReason: TypeError: Cannot read properties of undefined (reading 'allowedAttrs')

[Killed] BooleanLiteral
packages/sanitize-utils/src/sanitize-utils.ts:67:48
 export function sanitizeHtml(html: string, opts?: SanitizeHtmlOptions): string {
   const allowedTags = opts?.allowedTags ?? DEFAULT_ALLOWED_TAGS;
   const allowedAttrs = opts?.allowedAttrs ?? DEFAULT_ALLOWED_ATTRS;
-  const stripComments = opts?.stripComments ?? true;
+  const stripComments = opts?.stripComments ?? false;
 
   let result = html;
killedBy: sanitizeHtml strips HTML comments by default
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "<!--"
Received string:        "<!--comment-->"

[Killed] OptionalChaining
packages/sanitize-utils/src/sanitize-utils.ts:67:25
 export function sanitizeHtml(html: string, opts?: SanitizeHtmlOptions): string {
   const allowedTags = opts?.allowedTags ?? DEFAULT_ALLOWED_TAGS;
   const allowedAttrs = opts?.allowedAttrs ?? DEFAULT_ALLOWED_ATTRS;
-  const stripComments = opts?.stripComments ?? true;
+  const stripComments = opts.stripComments ?? true;
 
   let result = html;
killedBy: sanitizeHtml allows <b> by default
statusReason: TypeError: Cannot read properties of undefined (reading 'stripComments')

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:72:7
   let result = html;
 
   // Strip HTML comments
-  if (stripComments) {
+  if (true) {
     result = result.replace(/<!--[\s\S]*?-->/g, '');
   }
killedBy: sanitizeHtml keeps comment if stripComments false
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<!--hi-->"
Received string:    ""

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:72:22
   let result = html;
 
   // Strip HTML comments
-  if (stripComments) {
-    result = result.replace(/<!--[\s\S]*?-->/g, '');
-  }
+  if (stripComments) {}
 
   // Process tags: remove disallowed tags, strip disallowed attrs from allowed tags
killedBy: sanitizeHtml strips HTML comments by default
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "<!--"
Received string:        "<!--comment-->"

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:73:29
 
   // Strip HTML comments
   if (stripComments) {
-    result = result.replace(/<!--[\s\S]*?-->/g, '');
+    result = result.replace(/<!--[\S\S]*?-->/g, '');
   }
 

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:77:95
   }
 
   // Process tags: remove disallowed tags, strip disallowed attrs from allowed tags
-  result = result.replace(/<\/?([a-zA-Z][a-zA-Z0-9]*)\b([^>]*)>/g, (match, tagName, attrs) => {
-    const lowerTag = tagName.toLowerCase();
-    // Check if tag is in closing form
-    const isClosing = match.startsWith('</');
-
-    if (!allowedTags.includes(lowerTag)) {
-      return '';
-    }
-
-    if (isClosing) {
-      return `</${lowerTag}>`;
-    }
-
-    // Filter attributes
-    const filteredAttrs = attrs.replace(/([a-zA-Z\-]+)\s*=\s*(?:"([^"]*)"|'([^']*)'|(\S+))/g, (attrMatch: string, attrName: string, dq: string, sq: string, bare: string) => {
-      if (!allowedAttrs.includes(attrName.toLowerCase())) {
-        return '';
-      }
-      const val = dq ?? sq ?? bare ?? '';
-      return ` ${attrName.toLowerCase()}="${val}"`;
-    });
-
-    const selfClosing = attrs.trim().endsWith('/') ? ' /' : '';
-    return `<${lowerTag}${filteredAttrs.trimEnd()}${selfClosing}>`;
-  });
+  result = result.replace(/<\/?([a-zA-Z][a-zA-Z0-9]*)\b([^>]*)>/g, (match, tagName, attrs) => {});
 
   return result;
killedBy: sanitizeHtml allows <i> by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<i>"
Received string:    "undefineditundefined"

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:77:27
   }
 
   // Process tags: remove disallowed tags, strip disallowed attrs from allowed tags
-  result = result.replace(/<\/?([a-zA-Z][a-zA-Z0-9]*)\b([^>]*)>/g, (match, tagName, attrs) => {
+  result = result.replace(/<\/?([^a-zA-Z][a-zA-Z0-9]*)\b([^>]*)>/g, (match, tagName, attrs) => {
     const lowerTag = tagName.toLowerCase();
     // Check if tag is in closing form
killedBy: sanitizeHtml removes <script> by default
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "<script>"
Received string:        "<script>evil()"

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:78:22
 
   // Process tags: remove disallowed tags, strip disallowed attrs from allowed tags
   result = result.replace(/<\/?([a-zA-Z][a-zA-Z0-9]*)\b([^>]*)>/g, (match, tagName, attrs) => {
-    const lowerTag = tagName.toLowerCase();
+    const lowerTag = tagName.toUpperCase();
     // Check if tag is in closing form
     const isClosing = match.startsWith('</');
killedBy: sanitizeHtml allows <i> by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<i>"
Received string:    "it"

[Survived] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:80:23
   result = result.replace(/<\/?([a-zA-Z][a-zA-Z0-9]*)\b([^>]*)>/g, (match, tagName, attrs) => {
     const lowerTag = tagName.toLowerCase();
     // Check if tag is in closing form
-    const isClosing = match.startsWith('</');
+    const isClosing = match.endsWith('</');
 
     if (!allowedTags.includes(lowerTag)) {

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:80:40
   result = result.replace(/<\/?([a-zA-Z][a-zA-Z0-9]*)\b([^>]*)>/g, (match, tagName, attrs) => {
     const lowerTag = tagName.toLowerCase();
     // Check if tag is in closing form
-    const isClosing = match.startsWith('</');
+    const isClosing = match.startsWith("");
 
     if (!allowedTags.includes(lowerTag)) {
killedBy: sanitizeHtml allows <i> by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<i>"
Received string:    "</i>it</i>"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:82:9
     // Check if tag is in closing form
     const isClosing = match.startsWith('</');
 
-    if (!allowedTags.includes(lowerTag)) {
+    if (true) {
       return '';
     }
killedBy: sanitizeHtml allows <i> by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<i>"
Received string:    "it"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:82:9
     // Check if tag is in closing form
     const isClosing = match.startsWith('</');
 
-    if (!allowedTags.includes(lowerTag)) {
+    if (false) {
       return '';
     }
killedBy: sanitizeHtml removes <script> by default
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "<script>"
Received string:        "<script>evil()</script>"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:86:9
       return '';
     }
 
-    if (isClosing) {
+    if (true) {
       return `</${lowerTag}>`;
     }
killedBy: sanitizeHtml allows <i> by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "<i>"
Received string:    "</i>it</i>"

[Survived] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:86:20
       return '';
     }
 
-    if (isClosing) {
-      return `</${lowerTag}>`;
-    }
+    if (isClosing) {}
 
     // Filter attributes

[Survived] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:87:14
     }
 
     if (isClosing) {
-      return `</${lowerTag}>`;
+      return ``;
     }
 

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:91:174
     }
 
     // Filter attributes
-    const filteredAttrs = attrs.replace(/([a-zA-Z\-]+)\s*=\s*(?:"([^"]*)"|'([^']*)'|(\S+))/g, (attrMatch: string, attrName: string, dq: string, sq: string, bare: string) => {
-      if (!allowedAttrs.includes(attrName.toLowerCase())) {
-        return '';
-      }
-      const val = dq ?? sq ?? bare ?? '';
-      return ` ${attrName.toLowerCase()}="${val}"`;
-    });
+    const filteredAttrs = attrs.replace(/([a-zA-Z\-]+)\s*=\s*(?:"([^"]*)"|'([^']*)'|(\S+))/g, (attrMatch: string, attrName: string, dq: string, sq: string, bare: string) => {});
 
     const selfClosing = attrs.trim().endsWith('/') ? ' /' : '';
killedBy: sanitizeHtml allows href attr by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "href=\"url\""
Received string:    "<a undefined>link</a>"

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:91:41
     }
 
     // Filter attributes
-    const filteredAttrs = attrs.replace(/([a-zA-Z\-]+)\s*=\s*(?:"([^"]*)"|'([^']*)'|(\S+))/g, (attrMatch: string, attrName: string, dq: string, sq: string, bare: string) => {
+    const filteredAttrs = attrs.replace(/([a-zA-Z\-]+)\s*=\s(?:"([^"]*)"|'([^']*)'|(\S+))/g, (attrMatch: string, attrName: string, dq: string, sq: string, bare: string) => {
       if (!allowedAttrs.includes(attrName.toLowerCase())) {
         return '';
killedBy: sanitizeHtml strips disallowed attr onclick
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "onclick"
Received string:        "<a href=\"x\" onclick=\"evil()\">link</a>"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:92:59
 
     // Filter attributes
     const filteredAttrs = attrs.replace(/([a-zA-Z\-]+)\s*=\s*(?:"([^"]*)"|'([^']*)'|(\S+))/g, (attrMatch: string, attrName: string, dq: string, sq: string, bare: string) => {
-      if (!allowedAttrs.includes(attrName.toLowerCase())) {
-        return '';
-      }
+      if (!allowedAttrs.includes(attrName.toLowerCase())) {}
       const val = dq ?? sq ?? bare ?? '';
       return ` ${attrName.toLowerCase()}="${val}"`;
killedBy: sanitizeHtml strips disallowed attr onclick
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "onclick"
Received string:        "<a  href=\"x\"  onclick=\"evil()\">link</a>"

[Killed] BooleanLiteral
packages/sanitize-utils/src/sanitize-utils.ts:92:11
 
     // Filter attributes
     const filteredAttrs = attrs.replace(/([a-zA-Z\-]+)\s*=\s*(?:"([^"]*)"|'([^']*)'|(\S+))/g, (attrMatch: string, attrName: string, dq: string, sq: string, bare: string) => {
-      if (!allowedAttrs.includes(attrName.toLowerCase())) {
+      if (allowedAttrs.includes(attrName.toLowerCase())) {
         return '';
       }
killedBy: sanitizeHtml allows href attr by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "href=\"url\""
Received string:    "<a>link</a>"

[Survived] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:93:16
     // Filter attributes
     const filteredAttrs = attrs.replace(/([a-zA-Z\-]+)\s*=\s*(?:"([^"]*)"|'([^']*)'|(\S+))/g, (attrMatch: string, attrName: string, dq: string, sq: string, bare: string) => {
       if (!allowedAttrs.includes(attrName.toLowerCase())) {
-        return '';
+        return "Stryker was here!";
       }
       const val = dq ?? sq ?? bare ?? '';

[Killed] LogicalOperator
packages/sanitize-utils/src/sanitize-utils.ts:95:19
       if (!allowedAttrs.includes(attrName.toLowerCase())) {
         return '';
       }
-      const val = dq ?? sq ?? bare ?? '';
+      const val = dq && sq ?? bare ?? '';
       return ` ${attrName.toLowerCase()}="${val}"`;
     });
killedBy: sanitizeHtml allows href attr by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "href=\"url\""
Received string:    "<a  href=\"\">link</a>"

[Killed] LogicalOperator
packages/sanitize-utils/src/sanitize-utils.ts:95:19
       if (!allowedAttrs.includes(attrName.toLowerCase())) {
         return '';
       }
-      const val = dq ?? sq ?? bare ?? '';
+      const val = (dq ?? sq ?? bare) && '';
       return ` ${attrName.toLowerCase()}="${val}"`;
     });
killedBy: sanitizeHtml allows href attr by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "href=\"url\""
Received string:    "<a  href=\"\">link</a>"

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:96:18
         return '';
       }
       const val = dq ?? sq ?? bare ?? '';
-      return ` ${attrName.toLowerCase()}="${val}"`;
+      return ` ${attrName.toUpperCase()}="${val}"`;
     });
 
killedBy: sanitizeHtml allows href attr by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "href=\"url\""
Received string:    "<a  HREF=\"url\">link</a>"

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:96:14
         return '';
       }
       const val = dq ?? sq ?? bare ?? '';
-      return ` ${attrName.toLowerCase()}="${val}"`;
+      return ``;
     });
 
killedBy: sanitizeHtml allows href attr by default
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "href=\"url\""
Received string:    "<a>link</a>"

[Survived] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:99:25
       return ` ${attrName.toLowerCase()}="${val}"`;
     });
 
-    const selfClosing = attrs.trim().endsWith('/') ? ' /' : '';
+    const selfClosing = attrs.trim().startsWith('/') ? ' /' : '';
     return `<${lowerTag}${filteredAttrs.trimEnd()}${selfClosing}>`;
   });

[Survived] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:99:25
       return ` ${attrName.toLowerCase()}="${val}"`;
     });
 
-    const selfClosing = attrs.trim().endsWith('/') ? ' /' : '';
+    const selfClosing = attrs.endsWith('/') ? ' /' : '';
     return `<${lowerTag}${filteredAttrs.trimEnd()}${selfClosing}>`;
   });

[Survived] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:100:27
     });
 
     const selfClosing = attrs.trim().endsWith('/') ? ' /' : '';
-    return `<${lowerTag}${filteredAttrs.trimEnd()}${selfClosing}>`;
+    return `<${lowerTag}${filteredAttrs.trimStart()}${selfClosing}>`;
   });
 

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:110:46
  * SQL injection escape (basic — for display purposes, not parameterized queries).
  * Escapes single quotes, double quotes, backslashes, semicolons, comment sequences.
  */
-export function escapeSql(s: string): string {
-  return s
-    .replace(/\\/g, '\\\\')
-    .replace(/'/g, "\\'")
-    .replace(/"/g, '\\"')
-    .replace(/;/g, '\\;')
-    .replace(/--/g, '\\-\\-')
-    .replace(/\/\*/g, '\\/\\*')
-    .replace(/\*\//g, '\\*\\/');
-}
+export function escapeSql(s: string): string {}
 
 /**
killedBy: escapeSql escapes single quote
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:117:23
     .replace(/"/g, '\\"')
     .replace(/;/g, '\\;')
     .replace(/--/g, '\\-\\-')
-    .replace(/\/\*/g, '\\/\\*')
+    .replace(/\/\*/g, "")
     .replace(/\*\//g, '\\*\\/');
 }
killedBy: escapeSql escapes /* comment start
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\\/\\*"
Received string:    ""

[Survived] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:118:23
     .replace(/;/g, '\\;')
     .replace(/--/g, '\\-\\-')
     .replace(/\/\*/g, '\\/\\*')
-    .replace(/\*\//g, '\\*\\/');
+    .replace(/\*\//g, "");
 }
 

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:125:48
  * Shell argument escape.
  * Wraps in single quotes, escapes internal single quotes: "it's" → "'it'\\''s'"
  */
-export function escapeShell(s: string): string {
-  return "'" + s.replace(/'/g, "'\\''") + "'";
-}
+export function escapeShell(s: string): string {}
 
 /**
killedBy: escapeShell wraps simple word in single quotes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "'hello'"
Received: undefined

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:126:32
  * Wraps in single quotes, escapes internal single quotes: "it's" → "'it'\\''s'"
  */
 export function escapeShell(s: string): string {
-  return "'" + s.replace(/'/g, "'\\''") + "'";
+  return "'" + s.replace(/'/g, "") + "'";
 }
 
killedBy: escapeShell escapes internal single quote
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "'it'\\''s'"
Received: "'its'"

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:126:43
  * Wraps in single quotes, escapes internal single quotes: "it's" → "'it'\\''s'"
  */
 export function escapeShell(s: string): string {
-  return "'" + s.replace(/'/g, "'\\''") + "'";
+  return "'" + s.replace(/'/g, "'\\''") + "";
 }
 
killedBy: escapeShell wraps simple word in single quotes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "'hello'"
Received: "'hello"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:133:48
  * Escape regex special characters.
  * Escapes: . * + ? ^ $ { } [ ] | ( ) \
  */
-export function escapeRegex(s: string): string {
-  return s.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
-}
+export function escapeRegex(s: string): string {}
 
 /**
killedBy: escapeRegex escaped dot only matches dot
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:140:54
 /**
  * Remove control characters (ASCII 0-31 except tab \t=9, newline \n=10, CR \r=13).
  */
-export function stripControlChars(s: string): string {
-  // Remove ASCII 0-8, 11-12, 14-31 (keep \t=9, \n=10, \r=13)
-  return s.replace(/[\x00-\x08\x0B\x0C\x0E-\x1F]/g, '');
-}
+export function stripControlChars(s: string): string {}
 
 /**
killedBy: stripControlChars plain text unchanged
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello"
Received: undefined

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:142:53
  */
 export function stripControlChars(s: string): string {
   // Remove ASCII 0-8, 11-12, 14-31 (keep \t=9, \n=10, \r=13)
-  return s.replace(/[\x00-\x08\x0B\x0C\x0E-\x1F]/g, '');
+  return s.replace(/[\x00-\x08\x0B\x0C\x0E-\x1F]/g, "Stryker was here!");
 }
 
killedBy: stripControlChars removes null byte
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: "aStryker was here!b"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:148:51
 /**
  * Remove null bytes.
  */
-export function stripNullBytes(s: string): string {
-  return s.replace(/\x00/g, '');
-}
+export function stripNullBytes(s: string): string {}
 
 /**
killedBy: stripNullBytes removes null bytes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: undefined
