[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:149:29
  * Remove null bytes.
  */
 export function stripNullBytes(s: string): string {
-  return s.replace(/\x00/g, '');
+  return s.replace(/\x00/g, "Stryker was here!");
 }
 
killedBy: stripNullBytes removes null bytes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: "aStryker was here!b"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:155:56
 /**
  * Normalize whitespace: collapse multiple spaces/tabs into single space, trim.
  */
-export function normalizeWhitespace(s: string): string {
-  return s.replace(/[ \t]+/g, ' ').trim();
-}
+export function normalizeWhitespace(s: string): string {}
 
 /**
killedBy: normalizeWhitespace trims leading spaces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello"
Received: undefined

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:156:10
  * Normalize whitespace: collapse multiple spaces/tabs into single space, trim.
  */
 export function normalizeWhitespace(s: string): string {
-  return s.replace(/[ \t]+/g, ' ').trim();
+  return s.replace(/[ \t]+/g, ' ');
 }
 
killedBy: normalizeWhitespace trims leading spaces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello"
Received: " hello"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:162:80
 /**
  * Truncate to max length with optional ellipsis (default: "…").
  */
-export function truncate(s: string, maxLen: number, ellipsis?: string): string {
-  const ell = ellipsis !== undefined ? ellipsis : '…';
-  if (s.length <= maxLen) return s;
-  if (maxLen <= ell.length) return ell.slice(0, maxLen);
-  return s.slice(0, maxLen - ell.length) + ell;
-}
+export function truncate(s: string, maxLen: number, ellipsis?: string): string {}
 
 /**
killedBy: truncate returns string unchanged if shorter than maxLen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hi"
Received: undefined

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:163:15
  * Truncate to max length with optional ellipsis (default: "…").
  */
 export function truncate(s: string, maxLen: number, ellipsis?: string): string {
-  const ell = ellipsis !== undefined ? ellipsis : '…';
+  const ell = false ? ellipsis : '…';
   if (s.length <= maxLen) return s;
   if (maxLen <= ell.length) return ell.slice(0, maxLen);
killedBy: truncate truncates with custom ellipsis
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello..."
Received: "hello w…"

[Killed] EqualityOperator
packages/sanitize-utils/src/sanitize-utils.ts:163:15
  * Truncate to max length with optional ellipsis (default: "…").
  */
 export function truncate(s: string, maxLen: number, ellipsis?: string): string {
-  const ell = ellipsis !== undefined ? ellipsis : '…';
+  const ell = ellipsis === undefined ? ellipsis : '…';
   if (s.length <= maxLen) return s;
   if (maxLen <= ell.length) return ell.slice(0, maxLen);
killedBy: truncate truncates with default ellipsis
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:164:7
  */
 export function truncate(s: string, maxLen: number, ellipsis?: string): string {
   const ell = ellipsis !== undefined ? ellipsis : '…';
-  if (s.length <= maxLen) return s;
+  if (true) return s;
   if (maxLen <= ell.length) return ell.slice(0, maxLen);
   return s.slice(0, maxLen - ell.length) + ell;
killedBy: truncate truncates with default ellipsis
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello w…"
Received: "hello world"

[Killed] EqualityOperator
packages/sanitize-utils/src/sanitize-utils.ts:164:7
  */
 export function truncate(s: string, maxLen: number, ellipsis?: string): string {
   const ell = ellipsis !== undefined ? ellipsis : '…';
-  if (s.length <= maxLen) return s;
+  if (s.length < maxLen) return s;
   if (maxLen <= ell.length) return ell.slice(0, maxLen);
   return s.slice(0, maxLen - ell.length) + ell;
killedBy: truncate returns string unchanged if equal to maxLen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello"
Received: "hell…"

[Killed] EqualityOperator
packages/sanitize-utils/src/sanitize-utils.ts:165:7
 export function truncate(s: string, maxLen: number, ellipsis?: string): string {
   const ell = ellipsis !== undefined ? ellipsis : '…';
   if (s.length <= maxLen) return s;
-  if (maxLen <= ell.length) return ell.slice(0, maxLen);
+  if (maxLen > ell.length) return ell.slice(0, maxLen);
   return s.slice(0, maxLen - ell.length) + ell;
 }
killedBy: truncate truncates with default ellipsis
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello w…"
Received: "…"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:165:7
 export function truncate(s: string, maxLen: number, ellipsis?: string): string {
   const ell = ellipsis !== undefined ? ellipsis : '…';
   if (s.length <= maxLen) return s;
-  if (maxLen <= ell.length) return ell.slice(0, maxLen);
+  if (true) return ell.slice(0, maxLen);
   return s.slice(0, maxLen - ell.length) + ell;
 }
killedBy: truncate truncates with default ellipsis
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello w…"
Received: "…"

[Killed] ArithmeticOperator
packages/sanitize-utils/src/sanitize-utils.ts:166:10
   const ell = ellipsis !== undefined ? ellipsis : '…';
   if (s.length <= maxLen) return s;
   if (maxLen <= ell.length) return ell.slice(0, maxLen);
-  return s.slice(0, maxLen - ell.length) + ell;
+  return s.slice(0, maxLen - ell.length) - ell;
 }
 
killedBy: truncate truncates with default ellipsis
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello w…"
Received: NaN

[Killed] ArithmeticOperator
packages/sanitize-utils/src/sanitize-utils.ts:166:21
   const ell = ellipsis !== undefined ? ellipsis : '…';
   if (s.length <= maxLen) return s;
   if (maxLen <= ell.length) return ell.slice(0, maxLen);
-  return s.slice(0, maxLen - ell.length) + ell;
+  return s.slice(0, maxLen + ell.length) + ell;
 }
 
killedBy: truncate truncates with default ellipsis
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hello w…"
Received: "hello wor…"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:172:54
 /**
  * Remove non-printable characters (keeps printable ASCII and above).
  */
-export function stripNonPrintable(s: string): string {
-  // Remove control chars (0x00-0x1F) and DEL (0x7F)
-  return s.replace(/[\x00-\x1F\x7F]/g, '');
-}
+export function stripNonPrintable(s: string): string {}
 
 const UNSAFE_FILENAME_CHARS = /[/\\:*?"<>|\x00]/g;
killedBy: stripNonPrintable removes control chars
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: undefined

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:174:40
  */
 export function stripNonPrintable(s: string): string {
   // Remove control chars (0x00-0x1F) and DEL (0x7F)
-  return s.replace(/[\x00-\x1F\x7F]/g, '');
+  return s.replace(/[\x00-\x1F\x7F]/g, "Stryker was here!");
 }
 
killedBy: stripNonPrintable removes control chars
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ab"
Received: "aStryker was here!b"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:184:78
  * Replace: / \ : * ? " < > | \0 with replacement (default: '_').
  * Also strips leading/trailing dots and spaces.
  */
-export function sanitizeFilename(name: string, replacement?: string): string {
-  const rep = replacement !== undefined ? replacement : '_';
-  let result = name.replace(UNSAFE_FILENAME_CHARS, rep);
-  // Strip leading/trailing dots and spaces
-  result = result.replace(/^[.\s]+/, '').replace(/[.\s]+$/, '');
-  if (result === '') result = '_';
-  return result;
-}
+export function sanitizeFilename(name: string, replacement?: string): string {}
 
 /**
killedBy: sanitizeFilename leaves safe name unchanged
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "document"
Received: undefined

[Killed] EqualityOperator
packages/sanitize-utils/src/sanitize-utils.ts:185:15
  * Also strips leading/trailing dots and spaces.
  */
 export function sanitizeFilename(name: string, replacement?: string): string {
-  const rep = replacement !== undefined ? replacement : '_';
+  const rep = replacement === undefined ? replacement : '_';
   let result = name.replace(UNSAFE_FILENAME_CHARS, rep);
   // Strip leading/trailing dots and spaces
killedBy: sanitizeFilename replaces forward slash
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "path_to_file"
Received: "pathundefinedtoundefinedfile"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:185:15
  * Also strips leading/trailing dots and spaces.
  */
 export function sanitizeFilename(name: string, replacement?: string): string {
-  const rep = replacement !== undefined ? replacement : '_';
+  const rep = false ? replacement : '_';
   let result = name.replace(UNSAFE_FILENAME_CHARS, rep);
   // Strip leading/trailing dots and spaces
killedBy: sanitizeFilename custom replacement char
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "file-name"
Received: "file_name"

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:188:50
   const rep = replacement !== undefined ? replacement : '_';
   let result = name.replace(UNSAFE_FILENAME_CHARS, rep);
   // Strip leading/trailing dots and spaces
-  result = result.replace(/^[.\s]+/, '').replace(/[.\s]+$/, '');
+  result = result.replace(/^[.\s]+/, '').replace(/[.\s]+/, '');
   if (result === '') result = '_';
   return result;
killedBy: sanitizeFilename sanitizeFilename: long filename (0)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa.txt"
Received: "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:188:61
   const rep = replacement !== undefined ? replacement : '_';
   let result = name.replace(UNSAFE_FILENAME_CHARS, rep);
   // Strip leading/trailing dots and spaces
-  result = result.replace(/^[.\s]+/, '').replace(/[.\s]+$/, '');
+  result = result.replace(/^[.\s]+/, '').replace(/[.\s]+$/, "Stryker was here!");
   if (result === '') result = '_';
   return result;
killedBy: sanitizeFilename strips trailing dot
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "file"
Received: "fileStryker was here!"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:189:7
   let result = name.replace(UNSAFE_FILENAME_CHARS, rep);
   // Strip leading/trailing dots and spaces
   result = result.replace(/^[.\s]+/, '').replace(/[.\s]+$/, '');
-  if (result === '') result = '_';
+  if (true) result = '_';
   return result;
 }
killedBy: sanitizeFilename leaves safe name unchanged
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "document"
Received: "_"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:189:7
   let result = name.replace(UNSAFE_FILENAME_CHARS, rep);
   // Strip leading/trailing dots and spaces
   result = result.replace(/^[.\s]+/, '').replace(/[.\s]+$/, '');
-  if (result === '') result = '_';
+  if (false) result = '_';
   return result;
 }
killedBy: sanitizeFilename empty string returns _
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "_"
Received: ""

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:197:62
  * Sanitize URL path segment.
  * Percent-encode unsafe chars; strip ".." traversal.
  */
-export function sanitizePathSegment(segment: string): string {
-  // Remove path traversal
-  let result = segment.replace(/\.\./g, '');
-  // Remove leading/trailing slashes
-  result = result.replace(/^\/+|\/+$/g, '');
-  // Percent-encode characters that are not unreserved in path segments
-  result = result.replace(/[^a-zA-Z0-9\-._~!$&'()*+,;=:@]/g, (ch) =>
-    encodeURIComponent(ch)
-  );
-  return result;
-}
+export function sanitizePathSegment(segment: string): string {}
 
 /**
killedBy: sanitizePathSegment removes path traversal ..
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Survived] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:199:41
  */
 export function sanitizePathSegment(segment: string): string {
   // Remove path traversal
-  let result = segment.replace(/\.\./g, '');
+  let result = segment.replace(/\.\./g, "Stryker was here!");
   // Remove leading/trailing slashes
   result = result.replace(/^\/+|\/+$/g, '');

[Survived] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:201:41
   // Remove path traversal
   let result = segment.replace(/\.\./g, '');
   // Remove leading/trailing slashes
-  result = result.replace(/^\/+|\/+$/g, '');
+  result = result.replace(/^\/+|\/+$/g, "Stryker was here!");
   // Percent-encode characters that are not unreserved in path segments
   result = result.replace(/[^a-zA-Z0-9\-._~!$&'()*+,;=:@]/g, (ch) =>

[Killed] ArrowFunction
packages/sanitize-utils/src/sanitize-utils.ts:203:62
   // Remove leading/trailing slashes
   result = result.replace(/^\/+|\/+$/g, '');
   // Percent-encode characters that are not unreserved in path segments
-  result = result.replace(/[^a-zA-Z0-9\-._~!$&'()*+,;=:@]/g, (ch) =>
-    encodeURIComponent(ch)
+  result = result.replace(/[^a-zA-Z0-9\-._~!$&'()*+,;=:@]/g, () => undefined
   );
   return result;
killedBy: sanitizePathSegment encodes spaces
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "%20"
Received string:    "helloundefinedworld"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:213:61
  * Sanitize email: lowercase, trim, basic format check.
  * Returns null if clearly invalid (no @, no dot after @), else trimmed lowercase.
  */
-export function sanitizeEmail(email: string): string | null {
-  const trimmed = email.trim().toLowerCase();
-  const atIdx = trimmed.indexOf('@');
-  if (atIdx < 1) return null;
-  const domain = trimmed.slice(atIdx + 1);
-  if (!domain.includes('.')) return null;
-  if (domain.endsWith('.')) return null;
-  if (trimmed.length > 320) return null;
-  return trimmed;
-}
+export function sanitizeEmail(email: string): string | null {}
 
 /**
killedBy: sanitizeEmail returns trimmed lowercase email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user@example.com"
Received: undefined

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:214:19
  * Returns null if clearly invalid (no @, no dot after @), else trimmed lowercase.
  */
 export function sanitizeEmail(email: string): string | null {
-  const trimmed = email.trim().toLowerCase();
+  const trimmed = email.trim().toUpperCase();
   const atIdx = trimmed.indexOf('@');
   if (atIdx < 1) return null;
killedBy: sanitizeEmail returns trimmed lowercase email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user@example.com"
Received: "USER@EXAMPLE.COM"

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:214:19
  * Returns null if clearly invalid (no @, no dot after @), else trimmed lowercase.
  */
 export function sanitizeEmail(email: string): string | null {
-  const trimmed = email.trim().toLowerCase();
+  const trimmed = email.toLowerCase();
   const atIdx = trimmed.indexOf('@');
   if (atIdx < 1) return null;
killedBy: sanitizeEmail returns trimmed lowercase email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user@example.com"
Received: "  user@example.com  "

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:216:7
 export function sanitizeEmail(email: string): string | null {
   const trimmed = email.trim().toLowerCase();
   const atIdx = trimmed.indexOf('@');
-  if (atIdx < 1) return null;
+  if (true) return null;
   const domain = trimmed.slice(atIdx + 1);
   if (!domain.includes('.')) return null;
killedBy: sanitizeEmail returns trimmed lowercase email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user@example.com"
Received: null

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:216:7
 export function sanitizeEmail(email: string): string | null {
   const trimmed = email.trim().toLowerCase();
   const atIdx = trimmed.indexOf('@');
-  if (atIdx < 1) return null;
+  if (false) return null;
   const domain = trimmed.slice(atIdx + 1);
   if (!domain.includes('.')) return null;
killedBy: sanitizeEmail @ at start returns null
statusReason: Error: expect(received).toBeNull()

Received: "@example.com"

[Survived] ArithmeticOperator
packages/sanitize-utils/src/sanitize-utils.ts:217:32
   const trimmed = email.trim().toLowerCase();
   const atIdx = trimmed.indexOf('@');
   if (atIdx < 1) return null;
-  const domain = trimmed.slice(atIdx + 1);
+  const domain = trimmed.slice(atIdx - 1);
   if (!domain.includes('.')) return null;
   if (domain.endsWith('.')) return null;

[Survived] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:217:18
   const trimmed = email.trim().toLowerCase();
   const atIdx = trimmed.indexOf('@');
   if (atIdx < 1) return null;
-  const domain = trimmed.slice(atIdx + 1);
+  const domain = trimmed;
   if (!domain.includes('.')) return null;
   if (domain.endsWith('.')) return null;

[Killed] BooleanLiteral
packages/sanitize-utils/src/sanitize-utils.ts:218:7
   const atIdx = trimmed.indexOf('@');
   if (atIdx < 1) return null;
   const domain = trimmed.slice(atIdx + 1);
-  if (!domain.includes('.')) return null;
+  if (domain.includes('.')) return null;
   if (domain.endsWith('.')) return null;
   if (trimmed.length > 320) return null;
killedBy: sanitizeEmail returns trimmed lowercase email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user@example.com"
Received: null

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:218:7
   const atIdx = trimmed.indexOf('@');
   if (atIdx < 1) return null;
   const domain = trimmed.slice(atIdx + 1);
-  if (!domain.includes('.')) return null;
+  if (true) return null;
   if (domain.endsWith('.')) return null;
   if (trimmed.length > 320) return null;
killedBy: sanitizeEmail returns trimmed lowercase email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user@example.com"
Received: null

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:219:7
   if (atIdx < 1) return null;
   const domain = trimmed.slice(atIdx + 1);
   if (!domain.includes('.')) return null;
-  if (domain.endsWith('.')) return null;
+  if (domain.startsWith('.')) return null;
   if (trimmed.length > 320) return null;
   return trimmed;
killedBy: sanitizeEmail domain ending with dot returns null
statusReason: Error: expect(received).toBeNull()

Received: "user@domain."

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:219:7
   if (atIdx < 1) return null;
   const domain = trimmed.slice(atIdx + 1);
   if (!domain.includes('.')) return null;
-  if (domain.endsWith('.')) return null;
+  if (true) return null;
   if (trimmed.length > 320) return null;
   return trimmed;
killedBy: sanitizeEmail returns trimmed lowercase email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user@example.com"
Received: null

[Killed] EqualityOperator
packages/sanitize-utils/src/sanitize-utils.ts:220:7
   const domain = trimmed.slice(atIdx + 1);
   if (!domain.includes('.')) return null;
   if (domain.endsWith('.')) return null;
-  if (trimmed.length > 320) return null;
+  if (trimmed.length <= 320) return null;
   return trimmed;
 }
killedBy: sanitizeEmail returns trimmed lowercase email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user@example.com"
Received: null

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:220:7
   const domain = trimmed.slice(atIdx + 1);
   if (!domain.includes('.')) return null;
   if (domain.endsWith('.')) return null;
-  if (trimmed.length > 320) return null;
+  if (true) return null;
   return trimmed;
 }
killedBy: sanitizeEmail returns trimmed lowercase email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user@example.com"
Received: null

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:227:54
 /**
  * Sanitize phone number: keep only digits, +, -, (), spaces.
  */
-export function sanitizePhone(phone: string): string {
-  return phone.replace(/[^0-9+\-() ]/g, '');
-}
+export function sanitizePhone(phone: string): string {}
 
 export interface NumericOptions {
killedBy: sanitizePhone removes letters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1-800-"
Received: undefined

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:228:24
  * Sanitize phone number: keep only digits, +, -, (), spaces.
  */
 export function sanitizePhone(phone: string): string {
-  return phone.replace(/[^0-9+\-() ]/g, '');
+  return phone.replace(/[0-9+\-() ]/g, '');
 }
 
killedBy: sanitizePhone removes letters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1-800-"
Received: "FLOWERS"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:240:75
 /**
  * Sanitize numeric string: keep only digits and optionally decimal/sign.
  */
-export function sanitizeNumeric(s: string, opts?: NumericOptions): string {
-  const allowDecimal = opts?.allowDecimal ?? false;
-  const allowNegative = opts?.allowNegative ?? false;
-  const allowThousandsSep = opts?.allowThousandsSep ?? false;
-
-  let pattern = '0-9';
-  if (allowDecimal) pattern += '.';
-  if (allowNegative) pattern += '\\-';
-  if (allowThousandsSep) pattern += ',';
-
-  const regex = new RegExp(`[^${pattern}]`, 'g');
-  return s.replace(regex, '');
-}
+export function sanitizeNumeric(s: string, opts?: NumericOptions): string {}
 
 /**
killedBy: sanitizeNumeric strips non-digits by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "123"
Received: undefined

[Killed] LogicalOperator
packages/sanitize-utils/src/sanitize-utils.ts:241:24
  * Sanitize numeric string: keep only digits and optionally decimal/sign.
  */
 export function sanitizeNumeric(s: string, opts?: NumericOptions): string {
-  const allowDecimal = opts?.allowDecimal ?? false;
+  const allowDecimal = opts?.allowDecimal && false;
   const allowNegative = opts?.allowNegative ?? false;
   const allowThousandsSep = opts?.allowThousandsSep ?? false;
killedBy: sanitizeNumeric allows decimal when flag set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "12.34"
Received: "1234"

[Killed] BooleanLiteral
packages/sanitize-utils/src/sanitize-utils.ts:241:46
  * Sanitize numeric string: keep only digits and optionally decimal/sign.
  */
 export function sanitizeNumeric(s: string, opts?: NumericOptions): string {
-  const allowDecimal = opts?.allowDecimal ?? false;
+  const allowDecimal = opts?.allowDecimal ?? true;
   const allowNegative = opts?.allowNegative ?? false;
   const allowThousandsSep = opts?.allowThousandsSep ?? false;
killedBy: sanitizeNumeric strips decimal by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1234"
Received: "12.34"

[Killed] OptionalChaining
packages/sanitize-utils/src/sanitize-utils.ts:242:25
  */
 export function sanitizeNumeric(s: string, opts?: NumericOptions): string {
   const allowDecimal = opts?.allowDecimal ?? false;
-  const allowNegative = opts?.allowNegative ?? false;
+  const allowNegative = opts.allowNegative ?? false;
   const allowThousandsSep = opts?.allowThousandsSep ?? false;
 
killedBy: sanitizeNumeric strips non-digits by default
statusReason: TypeError: Cannot read properties of undefined (reading 'allowNegative')

[Killed] LogicalOperator
packages/sanitize-utils/src/sanitize-utils.ts:242:25
  */
 export function sanitizeNumeric(s: string, opts?: NumericOptions): string {
   const allowDecimal = opts?.allowDecimal ?? false;
-  const allowNegative = opts?.allowNegative ?? false;
+  const allowNegative = opts?.allowNegative && false;
   const allowThousandsSep = opts?.allowThousandsSep ?? false;
 
killedBy: sanitizeNumeric allows negative when flag set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-42"
Received: "42"

[Killed] BooleanLiteral
packages/sanitize-utils/src/sanitize-utils.ts:243:56
 export function sanitizeNumeric(s: string, opts?: NumericOptions): string {
   const allowDecimal = opts?.allowDecimal ?? false;
   const allowNegative = opts?.allowNegative ?? false;
-  const allowThousandsSep = opts?.allowThousandsSep ?? false;
+  const allowThousandsSep = opts?.allowThousandsSep ?? true;
 
   let pattern = '0-9';
killedBy: sanitizeNumeric strips comma by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1000"
Received: "1,000"

[Killed] LogicalOperator
packages/sanitize-utils/src/sanitize-utils.ts:243:29
 export function sanitizeNumeric(s: string, opts?: NumericOptions): string {
   const allowDecimal = opts?.allowDecimal ?? false;
   const allowNegative = opts?.allowNegative ?? false;
-  const allowThousandsSep = opts?.allowThousandsSep ?? false;
+  const allowThousandsSep = opts?.allowThousandsSep && false;
 
   let pattern = '0-9';
killedBy: sanitizeNumeric allows thousands sep when flag set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1,000"
Received: "1000"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:246:7
   const allowThousandsSep = opts?.allowThousandsSep ?? false;
 
   let pattern = '0-9';
-  if (allowDecimal) pattern += '.';
+  if (true) pattern += '.';
   if (allowNegative) pattern += '\\-';
   if (allowThousandsSep) pattern += ',';
killedBy: sanitizeNumeric strips decimal by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1234"
Received: "12.34"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:246:7
   const allowThousandsSep = opts?.allowThousandsSep ?? false;
 
   let pattern = '0-9';
-  if (allowDecimal) pattern += '.';
+  if (false) pattern += '.';
   if (allowNegative) pattern += '\\-';
   if (allowThousandsSep) pattern += ',';
killedBy: sanitizeNumeric allows decimal when flag set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "12.34"
Received: "1234"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:247:7
 
   let pattern = '0-9';
   if (allowDecimal) pattern += '.';
-  if (allowNegative) pattern += '\\-';
+  if (true) pattern += '\\-';
   if (allowThousandsSep) pattern += ',';
 
killedBy: sanitizeNumeric strips negative by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "42"
Received: "-42"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:247:7
 
   let pattern = '0-9';
   if (allowDecimal) pattern += '.';
-  if (allowNegative) pattern += '\\-';
+  if (false) pattern += '\\-';
   if (allowThousandsSep) pattern += ',';
 
killedBy: sanitizeNumeric allows negative when flag set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-42"
Received: "42"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:248:7
   let pattern = '0-9';
   if (allowDecimal) pattern += '.';
   if (allowNegative) pattern += '\\-';
-  if (allowThousandsSep) pattern += ',';
+  if (true) pattern += ',';
 
   const regex = new RegExp(`[^${pattern}]`, 'g');
killedBy: sanitizeNumeric strips comma by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1000"
Received: "1,000"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:248:7
   let pattern = '0-9';
   if (allowDecimal) pattern += '.';
   if (allowNegative) pattern += '\\-';
-  if (allowThousandsSep) pattern += ',';
+  if (false) pattern += ',';
 
   const regex = new RegExp(`[^${pattern}]`, 'g');
killedBy: sanitizeNumeric allows thousands sep when flag set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1,000"
Received: "1000"

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:250:45
   if (allowNegative) pattern += '\\-';
   if (allowThousandsSep) pattern += ',';
 
-  const regex = new RegExp(`[^${pattern}]`, 'g');
+  const regex = new RegExp(`[^${pattern}]`, "");
   return s.replace(regex, '');
 }
killedBy: sanitizeNumeric strips non-digits by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "123"
Received: "bc123def"
