[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:258:47
  * Sanitize JSON string: escape special chars for embedding in JSON.
  * Escapes \, ", \n, \r, \t, \b, \f and control chars.
  */
-export function escapeJson(s: string): string {
-  return s
-    .replace(/\\/g, '\\\\')
-    .replace(/"/g, '\\"')
-    .replace(/[\x00-\x1F\x7F]/g, (ch) => {
-      const code = ch.charCodeAt(0);
-      switch (code) {
-        case 0x08: return '\\b';  // backspace
-        case 0x09: return '\\t';  // tab
-        case 0x0A: return '\\n';  // newline
-        case 0x0C: return '\\f';  // form feed
-        case 0x0D: return '\\r';  // carriage return
-        default: {
-          const hex = code.toString(16).padStart(4, '0');
-          return `\\u${hex}`;
-        }
-      }
-    });
-}
+export function escapeJson(s: string): string {}
 
 /**
killedBy: escapeJson escapes double quote
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\\\""
Received: undefined

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:260:21
  */
 export function escapeJson(s: string): string {
   return s
-    .replace(/\\/g, '\\\\')
+    .replace(/\\/g, "")
     .replace(/"/g, '\\"')
     .replace(/[\x00-\x1F\x7F]/g, (ch) => {
killedBy: escapeJson escapes backslash
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\\\\"
Received: ""

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:262:42
   return s
     .replace(/\\/g, '\\\\')
     .replace(/"/g, '\\"')
-    .replace(/[\x00-\x1F\x7F]/g, (ch) => {
-      const code = ch.charCodeAt(0);
-      switch (code) {
-        case 0x08: return '\\b';  // backspace
-        case 0x09: return '\\t';  // tab
-        case 0x0A: return '\\n';  // newline
-        case 0x0C: return '\\f';  // form feed
-        case 0x0D: return '\\r';  // carriage return
-        default: {
-          const hex = code.toString(16).padStart(4, '0');
-          return `\\u${hex}`;
-        }
-      }
-    });
+    .replace(/[\x00-\x1F\x7F]/g, (ch) => {});
 }
 
killedBy: escapeJson escapes newline
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\\n"
Received: "undefined"

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:262:14
   return s
     .replace(/\\/g, '\\\\')
     .replace(/"/g, '\\"')
-    .replace(/[\x00-\x1F\x7F]/g, (ch) => {
+    .replace(/[^\x00-\x1F\x7F]/g, (ch) => {
       const code = ch.charCodeAt(0);
       switch (code) {
killedBy: escapeJson escapes double quote
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\\\""
Received: "\\u005c\\u0022"

[NoCoverage] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:265:9
     .replace(/[\x00-\x1F\x7F]/g, (ch) => {
       const code = ch.charCodeAt(0);
       switch (code) {
-        case 0x08: return '\\b';  // backspace
+        case 0x08: // backspace  // backspace
         case 0x09: return '\\t';  // tab
         case 0x0A: return '\\n';  // newline

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:266:9
       const code = ch.charCodeAt(0);
       switch (code) {
         case 0x08: return '\\b';  // backspace
-        case 0x09: return '\\t';  // tab
+        // backspace
+case 0x09: // tab  // tab
         case 0x0A: return '\\n';  // newline
         case 0x0C: return '\\f';  // form feed
killedBy: escapeJson escapes tab
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\\t"
Received: "\\n"

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:266:27
       const code = ch.charCodeAt(0);
       switch (code) {
         case 0x08: return '\\b';  // backspace
-        case 0x09: return '\\t';  // tab
+        case 0x09: return "";  // tab
         case 0x0A: return '\\n';  // newline
         case 0x0C: return '\\f';  // form feed
killedBy: escapeJson escapes tab
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\\t"
Received: ""

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:267:9
       switch (code) {
         case 0x08: return '\\b';  // backspace
         case 0x09: return '\\t';  // tab
-        case 0x0A: return '\\n';  // newline
+        // tab
+case 0x0A: // newline  // newline
         case 0x0C: return '\\f';  // form feed
         case 0x0D: return '\\r';  // carriage return
killedBy: escapeJson escapes newline
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\\n"
Received: "\\f"

[NoCoverage] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:268:9
         case 0x08: return '\\b';  // backspace
         case 0x09: return '\\t';  // tab
         case 0x0A: return '\\n';  // newline
-        case 0x0C: return '\\f';  // form feed
+        // newline
+case 0x0C: // form feed  // form feed
         case 0x0D: return '\\r';  // carriage return
         default: {

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:269:9
         case 0x09: return '\\t';  // tab
         case 0x0A: return '\\n';  // newline
         case 0x0C: return '\\f';  // form feed
-        case 0x0D: return '\\r';  // carriage return
+        // form feed
+case 0x0D: // carriage return  // carriage return
         default: {
           const hex = code.toString(16).padStart(4, '0');
killedBy: escapeJson escapes carriage return
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "\\r"
Received: "\\u000d"

[NoCoverage] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:270:18
         case 0x0A: return '\\n';  // newline
         case 0x0C: return '\\f';  // form feed
         case 0x0D: return '\\r';  // carriage return
-        default: {
-          const hex = code.toString(16).padStart(4, '0');
-          return `\\u${hex}`;
-        }
+        default: {}
       }
     });

[NoCoverage] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:270:9
         case 0x0A: return '\\n';  // newline
         case 0x0C: return '\\f';  // form feed
         case 0x0D: return '\\r';  // carriage return
-        default: {
-          const hex = code.toString(16).padStart(4, '0');
-          return `\\u${hex}`;
-        }
+        // carriage return
+default:
       }
     });

[NoCoverage] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:271:53
         case 0x0C: return '\\f';  // form feed
         case 0x0D: return '\\r';  // carriage return
         default: {
-          const hex = code.toString(16).padStart(4, '0');
+          const hex = code.toString(16).padStart(4, "");
           return `\\u${hex}`;
         }

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:281:50
 /**
  * Mask email: "john.doe@example.com" → "j*******@example.com"
  */
-export function maskEmail(email: string): string {
-  const atIdx = email.indexOf('@');
-  if (atIdx < 0) return email;
-  const local = email.slice(0, atIdx);
-  const domain = email.slice(atIdx);
-  if (local.length <= 1) return local + domain;
-  return local[0] + '*'.repeat(local.length - 1) + domain;
-}
+export function maskEmail(email: string): string {}
 
 /**
killedBy: maskEmail masks standard email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "j*******@example.com"
Received: undefined

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:283:7
  */
 export function maskEmail(email: string): string {
   const atIdx = email.indexOf('@');
-  if (atIdx < 0) return email;
+  if (true) return email;
   const local = email.slice(0, atIdx);
   const domain = email.slice(atIdx);
killedBy: maskEmail masks standard email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "j*******@example.com"
Received: "john.doe@example.com"

[Killed] EqualityOperator
packages/sanitize-utils/src/sanitize-utils.ts:283:7
  */
 export function maskEmail(email: string): string {
   const atIdx = email.indexOf('@');
-  if (atIdx < 0) return email;
+  if (atIdx >= 0) return email;
   const local = email.slice(0, atIdx);
   const domain = email.slice(atIdx);
killedBy: maskEmail masks standard email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "j*******@example.com"
Received: "john.doe@example.com"

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:284:17
 export function maskEmail(email: string): string {
   const atIdx = email.indexOf('@');
   if (atIdx < 0) return email;
-  const local = email.slice(0, atIdx);
+  const local = email;
   const domain = email.slice(atIdx);
   if (local.length <= 1) return local + domain;
killedBy: maskEmail masks standard email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "j*******@example.com"
Received: "j*******************@example.com"

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:285:18
   const atIdx = email.indexOf('@');
   if (atIdx < 0) return email;
   const local = email.slice(0, atIdx);
-  const domain = email.slice(atIdx);
+  const domain = email;
   if (local.length <= 1) return local + domain;
   return local[0] + '*'.repeat(local.length - 1) + domain;
killedBy: maskEmail masks standard email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "j*******@example.com"
Received: "j*******john.doe@example.com"

[Killed] ArithmeticOperator
packages/sanitize-utils/src/sanitize-utils.ts:286:33
   if (atIdx < 0) return email;
   const local = email.slice(0, atIdx);
   const domain = email.slice(atIdx);
-  if (local.length <= 1) return local + domain;
+  if (local.length <= 1) return local - domain;
   return local[0] + '*'.repeat(local.length - 1) + domain;
 }
killedBy: maskEmail masks single-char local part
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a@example.com"
Received: NaN

[Killed] EqualityOperator
packages/sanitize-utils/src/sanitize-utils.ts:286:7
   if (atIdx < 0) return email;
   const local = email.slice(0, atIdx);
   const domain = email.slice(atIdx);
-  if (local.length <= 1) return local + domain;
+  if (local.length > 1) return local + domain;
   return local[0] + '*'.repeat(local.length - 1) + domain;
 }
killedBy: maskEmail masks standard email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "j*******@example.com"
Received: "john.doe@example.com"

[Killed] ArithmeticOperator
packages/sanitize-utils/src/sanitize-utils.ts:287:32
   const local = email.slice(0, atIdx);
   const domain = email.slice(atIdx);
   if (local.length <= 1) return local + domain;
-  return local[0] + '*'.repeat(local.length - 1) + domain;
+  return local[0] + '*'.repeat(local.length + 1) + domain;
 }
 
killedBy: maskEmail masks standard email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "j*******@example.com"
Received: "j*********@example.com"

[Killed] ArithmeticOperator
packages/sanitize-utils/src/sanitize-utils.ts:287:10
   const local = email.slice(0, atIdx);
   const domain = email.slice(atIdx);
   if (local.length <= 1) return local + domain;
-  return local[0] + '*'.repeat(local.length - 1) + domain;
+  return local[0] - '*'.repeat(local.length - 1) + domain;
 }
 
killedBy: maskEmail masks standard email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "j*******@example.com"
Received: "NaN@example.com"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:293:50
 /**
  * Mask phone: keep last 4 digits, mask rest: "07700900000" → "*******0000"
  */
-export function maskPhone(phone: string): string {
-  const digits = phone.replace(/\D/g, '');
-  if (digits.length <= 4) return phone;
-  const visible = digits.slice(-4);
-  const masked = '*'.repeat(digits.length - 4);
-  return masked + visible;
-}
+export function maskPhone(phone: string): string {}
 
 /**
killedBy: maskPhone masks 11-digit phone keeping last 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "*******0000"
Received: undefined

[Killed] EqualityOperator
packages/sanitize-utils/src/sanitize-utils.ts:295:7
  */
 export function maskPhone(phone: string): string {
   const digits = phone.replace(/\D/g, '');
-  if (digits.length <= 4) return phone;
+  if (digits.length > 4) return phone;
   const visible = digits.slice(-4);
   const masked = '*'.repeat(digits.length - 4);
killedBy: maskPhone masks 11-digit phone keeping last 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "*******0000"
Received: "07700900000"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:295:7
  */
 export function maskPhone(phone: string): string {
   const digits = phone.replace(/\D/g, '');
-  if (digits.length <= 4) return phone;
+  if (true) return phone;
   const visible = digits.slice(-4);
   const masked = '*'.repeat(digits.length - 4);
killedBy: maskPhone masks 11-digit phone keeping last 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "*******0000"
Received: "07700900000"

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:296:19
 export function maskPhone(phone: string): string {
   const digits = phone.replace(/\D/g, '');
   if (digits.length <= 4) return phone;
-  const visible = digits.slice(-4);
+  const visible = digits;
   const masked = '*'.repeat(digits.length - 4);
   return masked + visible;
killedBy: maskPhone masks 11-digit phone keeping last 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "*******0000"
Received: "*******07700900000"

[Killed] UnaryOperator
packages/sanitize-utils/src/sanitize-utils.ts:296:32
 export function maskPhone(phone: string): string {
   const digits = phone.replace(/\D/g, '');
   if (digits.length <= 4) return phone;
-  const visible = digits.slice(-4);
+  const visible = digits.slice(+4);
   const masked = '*'.repeat(digits.length - 4);
   return masked + visible;
killedBy: maskPhone masks 11-digit phone keeping last 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "*******0000"
Received: "*******0900000"

[Killed] ArithmeticOperator
packages/sanitize-utils/src/sanitize-utils.ts:297:29
   const digits = phone.replace(/\D/g, '');
   if (digits.length <= 4) return phone;
   const visible = digits.slice(-4);
-  const masked = '*'.repeat(digits.length - 4);
+  const masked = '*'.repeat(digits.length + 4);
   return masked + visible;
 }
killedBy: maskPhone masks 11-digit phone keeping last 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "*******0000"
Received: "***************0000"

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:297:18
   const digits = phone.replace(/\D/g, '');
   if (digits.length <= 4) return phone;
   const visible = digits.slice(-4);
-  const masked = '*'.repeat(digits.length - 4);
+  const masked = "".repeat(digits.length - 4);
   return masked + visible;
 }
killedBy: maskPhone masks 11-digit phone keeping last 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "*******0000"
Received: "0000"

[Killed] ArithmeticOperator
packages/sanitize-utils/src/sanitize-utils.ts:298:10
   if (digits.length <= 4) return phone;
   const visible = digits.slice(-4);
   const masked = '*'.repeat(digits.length - 4);
-  return masked + visible;
+  return masked - visible;
 }
 
killedBy: maskPhone masks 11-digit phone keeping last 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "*******0000"
Received: NaN

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:304:52
 /**
  * Mask credit card: keep last 4 digits: "**** **** **** 1234"
  */
-export function maskCreditCard(cc: string): string {
-  const digits = cc.replace(/\D/g, '');
-  if (digits.length < 4) return '*'.repeat(digits.length);
-  const last4 = digits.slice(-4);
-  return '**** **** **** ' + last4;
-}
+export function maskCreditCard(cc: string): string {}
 
 /**
killedBy: maskCreditCard masks 16-digit card number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "**** **** **** 1234"
Received: undefined

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:306:7
  */
 export function maskCreditCard(cc: string): string {
   const digits = cc.replace(/\D/g, '');
-  if (digits.length < 4) return '*'.repeat(digits.length);
+  if (false) return '*'.repeat(digits.length);
   const last4 = digits.slice(-4);
   return '**** **** **** ' + last4;
killedBy: maskCreditCard maskCreditCard: 0 digits → all masked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "**** **** **** "

[Killed] EqualityOperator
packages/sanitize-utils/src/sanitize-utils.ts:306:7
  */
 export function maskCreditCard(cc: string): string {
   const digits = cc.replace(/\D/g, '');
-  if (digits.length < 4) return '*'.repeat(digits.length);
+  if (digits.length >= 4) return '*'.repeat(digits.length);
   const last4 = digits.slice(-4);
   return '**** **** **** ' + last4;
killedBy: maskCreditCard masks 16-digit card number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "**** **** **** 1234"
Received: "****************"

[Killed] UnaryOperator
packages/sanitize-utils/src/sanitize-utils.ts:307:30
 export function maskCreditCard(cc: string): string {
   const digits = cc.replace(/\D/g, '');
   if (digits.length < 4) return '*'.repeat(digits.length);
-  const last4 = digits.slice(-4);
+  const last4 = digits.slice(+4);
   return '**** **** **** ' + last4;
 }
killedBy: maskCreditCard masks 16-digit card number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "**** **** **** 1234"
Received: "**** **** **** 111111111234"

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:307:17
 export function maskCreditCard(cc: string): string {
   const digits = cc.replace(/\D/g, '');
   if (digits.length < 4) return '*'.repeat(digits.length);
-  const last4 = digits.slice(-4);
+  const last4 = digits;
   return '**** **** **** ' + last4;
 }
killedBy: maskCreditCard masks 16-digit card number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "**** **** **** 1234"
Received: "**** **** **** 4111111111111234"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:315:106
  * Mask string: keeps visibleStart chars from start and visibleEnd from end,
  * masks the middle with char (default: '*').
  */
-export function maskString(s: string, visibleStart?: number, visibleEnd?: number, char?: string): string {
-  const vs = visibleStart ?? 1;
-  const ve = visibleEnd ?? 1;
-  const mc = char ?? '*';
-
-  if (s.length <= vs + ve) return s;
-  const start = s.slice(0, vs);
-  const end = s.slice(s.length - ve);
-  const maskedLen = s.length - vs - ve;
-  return start + mc.repeat(maskedLen) + end;
-}
+export function maskString(s: string, visibleStart?: number, visibleEnd?: number, char?: string): string {}
 
 const XSS_PATTERNS = [
killedBy: maskString masks middle with defaults (1 start, 1 end)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "h***o"
Received: undefined

[Killed] LogicalOperator
packages/sanitize-utils/src/sanitize-utils.ts:316:14
  * masks the middle with char (default: '*').
  */
 export function maskString(s: string, visibleStart?: number, visibleEnd?: number, char?: string): string {
-  const vs = visibleStart ?? 1;
+  const vs = visibleStart && 1;
   const ve = visibleEnd ?? 1;
   const mc = char ?? '*';
killedBy: maskString masks middle with defaults (1 start, 1 end)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "h***o"
Received: "helloo"

[Killed] LogicalOperator
packages/sanitize-utils/src/sanitize-utils.ts:317:14
  */
 export function maskString(s: string, visibleStart?: number, visibleEnd?: number, char?: string): string {
   const vs = visibleStart ?? 1;
-  const ve = visibleEnd ?? 1;
+  const ve = visibleEnd && 1;
   const mc = char ?? '*';
 
killedBy: maskString masks middle with defaults (1 start, 1 end)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "h***o"
Received: "hhello"

[Killed] LogicalOperator
packages/sanitize-utils/src/sanitize-utils.ts:318:14
 export function maskString(s: string, visibleStart?: number, visibleEnd?: number, char?: string): string {
   const vs = visibleStart ?? 1;
   const ve = visibleEnd ?? 1;
-  const mc = char ?? '*';
+  const mc = char && '*';
 
   if (s.length <= vs + ve) return s;
killedBy: maskString masks middle with defaults (1 start, 1 end)
statusReason: TypeError: Cannot read properties of undefined (reading 'repeat')

[Killed] StringLiteral
packages/sanitize-utils/src/sanitize-utils.ts:318:22
 export function maskString(s: string, visibleStart?: number, visibleEnd?: number, char?: string): string {
   const vs = visibleStart ?? 1;
   const ve = visibleEnd ?? 1;
-  const mc = char ?? '*';
+  const mc = char ?? "";
 
   if (s.length <= vs + ve) return s;
killedBy: maskString masks middle with defaults (1 start, 1 end)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "h***o"
Received: "ho"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:320:7
   const ve = visibleEnd ?? 1;
   const mc = char ?? '*';
 
-  if (s.length <= vs + ve) return s;
+  if (true) return s;
   const start = s.slice(0, vs);
   const end = s.slice(s.length - ve);
killedBy: maskString masks middle with defaults (1 start, 1 end)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "h***o"
Received: "hello"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:320:7
   const ve = visibleEnd ?? 1;
   const mc = char ?? '*';
 
-  if (s.length <= vs + ve) return s;
+  if (false) return s;
   const start = s.slice(0, vs);
   const end = s.slice(s.length - ve);
killedBy: maskString empty string returns empty
statusReason: RangeError: Invalid count value: -2

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:321:17
   const mc = char ?? '*';
 
   if (s.length <= vs + ve) return s;
-  const start = s.slice(0, vs);
+  const start = s;
   const end = s.slice(s.length - ve);
   const maskedLen = s.length - vs - ve;
killedBy: maskString masks middle with defaults (1 start, 1 end)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "h***o"
Received: "hello***o"

[Killed] ArithmeticOperator
packages/sanitize-utils/src/sanitize-utils.ts:322:23
 
   if (s.length <= vs + ve) return s;
   const start = s.slice(0, vs);
-  const end = s.slice(s.length - ve);
+  const end = s.slice(s.length + ve);
   const maskedLen = s.length - vs - ve;
   return start + mc.repeat(maskedLen) + end;
killedBy: maskString masks middle with defaults (1 start, 1 end)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "h***o"
Received: "h***"

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:322:15
 
   if (s.length <= vs + ve) return s;
   const start = s.slice(0, vs);
-  const end = s.slice(s.length - ve);
+  const end = s;
   const maskedLen = s.length - vs - ve;
   return start + mc.repeat(maskedLen) + end;
killedBy: maskString masks middle with defaults (1 start, 1 end)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "h***o"
Received: "h***hello"

[Killed] ArithmeticOperator
packages/sanitize-utils/src/sanitize-utils.ts:323:21
   if (s.length <= vs + ve) return s;
   const start = s.slice(0, vs);
   const end = s.slice(s.length - ve);
-  const maskedLen = s.length - vs - ve;
+  const maskedLen = s.length - vs + ve;
   return start + mc.repeat(maskedLen) + end;
 }
killedBy: maskString masks middle with defaults (1 start, 1 end)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "h***o"
Received: "h*****o"

[Killed] ArithmeticOperator
packages/sanitize-utils/src/sanitize-utils.ts:323:21
   if (s.length <= vs + ve) return s;
   const start = s.slice(0, vs);
   const end = s.slice(s.length - ve);
-  const maskedLen = s.length - vs - ve;
+  const maskedLen = s.length + vs - ve;
   return start + mc.repeat(maskedLen) + end;
 }
killedBy: maskString masks middle with defaults (1 start, 1 end)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "h***o"
Received: "h*****o"

[Killed] ArithmeticOperator
packages/sanitize-utils/src/sanitize-utils.ts:324:10
   const start = s.slice(0, vs);
   const end = s.slice(s.length - ve);
   const maskedLen = s.length - vs - ve;
-  return start + mc.repeat(maskedLen) + end;
+  return start + mc.repeat(maskedLen) - end;
 }
 
killedBy: maskString masks middle with defaults (1 start, 1 end)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "h***o"
Received: NaN

[Killed] ArithmeticOperator
packages/sanitize-utils/src/sanitize-utils.ts:324:10
   const start = s.slice(0, vs);
   const end = s.slice(s.length - ve);
   const maskedLen = s.length - vs - ve;
-  return start + mc.repeat(maskedLen) + end;
+  return start - mc.repeat(maskedLen) + end;
 }
 
killedBy: maskString masks middle with defaults (1 start, 1 end)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "h***o"
Received: "NaNo"

[Killed] ArrayDeclaration
packages/sanitize-utils/src/sanitize-utils.ts:327:22
   return start + mc.repeat(maskedLen) + end;
 }
 
-const XSS_PATTERNS = [
-  /<script/i,
-  /onerror\s*=/i,
-  /onload\s*=/i,
-  /onclick\s*=/i,
-  /onmouseover\s*=/i,
-  /javascript\s*:/i,
-  /data\s*:\s*text\/html/i,
-  /vbscript\s*:/i,
-  /eval\s*\(/i,
-  /expression\s*\(/i,
-  /<iframe/i,
-  /<object/i,
-  /<embed/i,
-  /<link/i,
-  /<meta/i,
-  /document\.cookie/i,
-  /document\.write/i,
-  /window\.location/i,
-  /alert\s*\(/i,
-  /confirm\s*\(/i,
-  /prompt\s*\(/i,
-];
+const XSS_PATTERNS = [];
 
 /**
killedBy: containsXss detects <script
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:329:3
 
 const XSS_PATTERNS = [
   /<script/i,
-  /onerror\s*=/i,
+  /onerror\s=/i,
   /onload\s*=/i,
   /onclick\s*=/i,
killedBy: containsXss detects onerror=
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:331:3
   /<script/i,
   /onerror\s*=/i,
   /onload\s*=/i,
-  /onclick\s*=/i,
+  /onclick\s=/i,
   /onmouseover\s*=/i,
   /javascript\s*:/i,
killedBy: containsXss detects onclick=
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:331:3
   /<script/i,
   /onerror\s*=/i,
   /onload\s*=/i,
-  /onclick\s*=/i,
+  /onclick\S*=/i,
   /onmouseover\s*=/i,
   /javascript\s*:/i,

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:332:3
   /onerror\s*=/i,
   /onload\s*=/i,
   /onclick\s*=/i,
-  /onmouseover\s*=/i,
+  /onmouseover\S*=/i,
   /javascript\s*:/i,
   /data\s*:\s*text\/html/i,

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:333:3
   /onload\s*=/i,
   /onclick\s*=/i,
   /onmouseover\s*=/i,
-  /javascript\s*:/i,
+  /javascript\s:/i,
   /data\s*:\s*text\/html/i,
   /vbscript\s*:/i,
killedBy: containsXss detects javascript:
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:333:3
   /onload\s*=/i,
   /onclick\s*=/i,
   /onmouseover\s*=/i,
-  /javascript\s*:/i,
+  /javascript\S*:/i,
   /data\s*:\s*text\/html/i,
   /vbscript\s*:/i,

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:334:3
   /onclick\s*=/i,
   /onmouseover\s*=/i,
   /javascript\s*:/i,
-  /data\s*:\s*text\/html/i,
+  /data\s*:\S*text\/html/i,
   /vbscript\s*:/i,
   /eval\s*\(/i,

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:336:3
   /javascript\s*:/i,
   /data\s*:\s*text\/html/i,
   /vbscript\s*:/i,
-  /eval\s*\(/i,
+  /eval\S*\(/i,
   /expression\s*\(/i,
   /<iframe/i,

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:337:3
   /data\s*:\s*text\/html/i,
   /vbscript\s*:/i,
   /eval\s*\(/i,
-  /expression\s*\(/i,
+  /expression\s\(/i,
   /<iframe/i,
   /<object/i,

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:337:3
   /data\s*:\s*text\/html/i,
   /vbscript\s*:/i,
   /eval\s*\(/i,
-  /expression\s*\(/i,
+  /expression\S*\(/i,
   /<iframe/i,
   /<object/i,

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:346:3
   /document\.cookie/i,
   /document\.write/i,
   /window\.location/i,
-  /alert\s*\(/i,
+  /alert\S*\(/i,
   /confirm\s*\(/i,
   /prompt\s*\(/i,

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:347:3
   /document\.write/i,
   /window\.location/i,
   /alert\s*\(/i,
-  /confirm\s*\(/i,
+  /confirm\s\(/i,
   /prompt\s*\(/i,
 ];
killedBy: containsXss detects confirm(
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:347:3
   /document\.write/i,
   /window\.location/i,
   /alert\s*\(/i,
-  /confirm\s*\(/i,
+  /confirm\S*\(/i,
   /prompt\s*\(/i,
 ];
