[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:348:3
   /window\.location/i,
   /alert\s*\(/i,
   /confirm\s*\(/i,
-  /prompt\s*\(/i,
+  /prompt\S*\(/i,
 ];
 

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:354:49
 /**
  * Check if string contains potential XSS.
  */
-export function containsXss(s: string): boolean {
-  return XSS_PATTERNS.some((pattern) => pattern.test(s));
-}
+export function containsXss(s: string): boolean {}
 
 const SQL_INJECTION_PATTERNS = [
killedBy: containsXss detects <script
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:355:10
  * Check if string contains potential XSS.
  */
 export function containsXss(s: string): boolean {
-  return XSS_PATTERNS.some((pattern) => pattern.test(s));
+  return XSS_PATTERNS.every(pattern => pattern.test(s));
 }
 
killedBy: containsXss detects <script
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
packages/sanitize-utils/src/sanitize-utils.ts:355:28
  * Check if string contains potential XSS.
  */
 export function containsXss(s: string): boolean {
-  return XSS_PATTERNS.some((pattern) => pattern.test(s));
+  return XSS_PATTERNS.some(() => undefined);
 }
 
killedBy: containsXss detects <script
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:362:3
   /union\s+select/i,
   /drop\s+table/i,
   /drop\s+database/i,
-  /delete\s+from/i,
+  /delete\S+from/i,
   /insert\s+into/i,
   /update\s+\w+\s+set/i,
killedBy: containsSqlInjection detects DELETE FROM
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:364:3
   /drop\s+database/i,
   /delete\s+from/i,
   /insert\s+into/i,
-  /update\s+\w+\s+set/i,
+  /update\S+\w+\s+set/i,
   /--\s/,
   /\/\*/,
killedBy: containsSqlInjection update set pattern detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:364:3
   /drop\s+database/i,
   /delete\s+from/i,
   /insert\s+into/i,
-  /update\s+\w+\s+set/i,
+  /update\s+\w+\sset/i,
   /--\s/,
   /\/\*/,

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:365:3
   /delete\s+from/i,
   /insert\s+into/i,
   /update\s+\w+\s+set/i,
-  /--\s/,
+  /--\S/,
   /\/\*/,
   /or\s+1\s*=\s*1/i,
killedBy: containsSqlInjection detects -- comment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:367:3
   /update\s+\w+\s+set/i,
   /--\s/,
   /\/\*/,
-  /or\s+1\s*=\s*1/i,
+  /or\s+1\s*=\s1/i,
   /and\s+1\s*=\s*1/i,
   /or\s+'[^']*'\s*=\s*'[^']*/i,
killedBy: containsSqlInjection detects OR 1=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:368:3
   /--\s/,
   /\/\*/,
   /or\s+1\s*=\s*1/i,
-  /and\s+1\s*=\s*1/i,
+  /and\s+1\s=\s*1/i,
   /or\s+'[^']*'\s*=\s*'[^']*/i,
   /;\s*select/i,
killedBy: containsSqlInjection detects AND 1=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:369:3
   /\/\*/,
   /or\s+1\s*=\s*1/i,
   /and\s+1\s*=\s*1/i,
-  /or\s+'[^']*'\s*=\s*'[^']*/i,
+  /or\S+'[^']*'\s*=\s*'[^']*/i,
   /;\s*select/i,
   /xp_cmdshell/i,
killedBy: containsSqlInjection detects OR with string comparison
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:369:3
   /\/\*/,
   /or\s+1\s*=\s*1/i,
   /and\s+1\s*=\s*1/i,
-  /or\s+'[^']*'\s*=\s*'[^']*/i,
+  /or\s+'[^']*'\S*=\s*'[^']*/i,
   /;\s*select/i,
   /xp_cmdshell/i,

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:370:3
   /or\s+1\s*=\s*1/i,
   /and\s+1\s*=\s*1/i,
   /or\s+'[^']*'\s*=\s*'[^']*/i,
-  /;\s*select/i,
+  /;\S*select/i,
   /xp_cmdshell/i,
   /exec\s*\(/i,
killedBy: containsSqlInjection ; SELECT triggers if ;select pattern matched
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:373:3
   /;\s*select/i,
   /xp_cmdshell/i,
   /exec\s*\(/i,
-  /waitfor\s+delay/i,
+  /waitfor\sdelay/i,
   /benchmark\s*\(/i,
   /sleep\s*\(/i,

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:374:3
   /xp_cmdshell/i,
   /exec\s*\(/i,
   /waitfor\s+delay/i,
-  /benchmark\s*\(/i,
+  /benchmark\s\(/i,
   /sleep\s*\(/i,
   /information_schema/i,
killedBy: containsSqlInjection detects BENCHMARK(
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:374:3
   /xp_cmdshell/i,
   /exec\s*\(/i,
   /waitfor\s+delay/i,
-  /benchmark\s*\(/i,
+  /benchmark\S*\(/i,
   /sleep\s*\(/i,
   /information_schema/i,

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:378:3
   /sleep\s*\(/i,
   /information_schema/i,
   /sys\.tables/i,
-  /char\s*\(\d/i,
+  /char\s\(\d/i,
 ];
 
killedBy: containsSqlInjection detects CHAR(
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
packages/sanitize-utils/src/sanitize-utils.ts:378:3
   /sleep\s*\(/i,
   /information_schema/i,
   /sys\.tables/i,
-  /char\s*\(\d/i,
+  /char\S*\(\d/i,
 ];
 

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:384:58
 /**
  * Check if string contains potential SQL injection.
  */
-export function containsSqlInjection(s: string): boolean {
-  return SQL_INJECTION_PATTERNS.some((pattern) => pattern.test(s));
-}
+export function containsSqlInjection(s: string): boolean {}
 
 const EMAIL_PATTERN = /[a-zA-Z0-9._%+\-]+@[a-zA-Z0-9.\-]+\.[a-zA-Z]{2,}/g;
killedBy: containsSqlInjection detects UNION SELECT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArrowFunction
packages/sanitize-utils/src/sanitize-utils.ts:385:38
  * Check if string contains potential SQL injection.
  */
 export function containsSqlInjection(s: string): boolean {
-  return SQL_INJECTION_PATTERNS.some((pattern) => pattern.test(s));
+  return SQL_INJECTION_PATTERNS.some(() => undefined);
 }
 
killedBy: containsSqlInjection detects UNION SELECT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:385:10
  * Check if string contains potential SQL injection.
  */
 export function containsSqlInjection(s: string): boolean {
-  return SQL_INJECTION_PATTERNS.some((pattern) => pattern.test(s));
+  return SQL_INJECTION_PATTERNS.every(pattern => pattern.test(s));
 }
 
killedBy: containsSqlInjection detects UNION SELECT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:389:23
 }
 
 const EMAIL_PATTERN = /[a-zA-Z0-9._%+\-]+@[a-zA-Z0-9.\-]+\.[a-zA-Z]{2,}/g;
-const PHONE_PATTERN = /(?:\+?[\d\s\-().]{7,15})/g;
+const PHONE_PATTERN = /(?:\+?[^\d\s\-().]{7,15})/g;
 const CARD_PATTERN = /\b(?:\d[ \-]?){13,19}\b/g;
 
killedBy: redactPii redacts phone number
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[PHONE]"
Received string:    "Call 07700900000 now"

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:390:22
 
 const EMAIL_PATTERN = /[a-zA-Z0-9._%+\-]+@[a-zA-Z0-9.\-]+\.[a-zA-Z]{2,}/g;
 const PHONE_PATTERN = /(?:\+?[\d\s\-().]{7,15})/g;
-const CARD_PATTERN = /\b(?:\d[ \-]?){13,19}\b/g;
+const CARD_PATTERN = /\b(?:\d[ \-]?)\b/g;
 
 /**
killedBy: redactPii redacts credit card pattern
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[CARD]"
Received string:    "Card:[PHONE]34"

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:390:22
 
 const EMAIL_PATTERN = /[a-zA-Z0-9._%+\-]+@[a-zA-Z0-9.\-]+\.[a-zA-Z]{2,}/g;
 const PHONE_PATTERN = /(?:\+?[\d\s\-().]{7,15})/g;
-const CARD_PATTERN = /\b(?:\d[ \-]?){13,19}\b/g;
+const CARD_PATTERN = /\b(?:\d[ \-]){13,19}\b/g;
 
 /**
killedBy: redactPii redacts credit card pattern
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[CARD]"
Received string:    "Card:[PHONE]34"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:397:49
  * Replaces email addresses with [EMAIL], phone numbers with [PHONE],
  * credit card patterns with [CARD].
  */
-export function redactPii(text: string): string {
-  let result = text.replace(EMAIL_PATTERN, '[EMAIL]');
-  result = result.replace(CARD_PATTERN, '[CARD]');
-  // Phone after email/card to avoid false positives
-  result = result.replace(PHONE_PATTERN, (match) => {
-    // Only replace if it looks sufficiently phone-like (at least 7 digits)
-    const digits = match.replace(/\D/g, '');
-    if (digits.length >= 7) return '[PHONE]';
-    return match;
-  });
-  return result;
-}
+export function redactPii(text: string): string {}
 
 /**
killedBy: redactPii redacts email address
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:401:53
   let result = text.replace(EMAIL_PATTERN, '[EMAIL]');
   result = result.replace(CARD_PATTERN, '[CARD]');
   // Phone after email/card to avoid false positives
-  result = result.replace(PHONE_PATTERN, (match) => {
-    // Only replace if it looks sufficiently phone-like (at least 7 digits)
-    const digits = match.replace(/\D/g, '');
-    if (digits.length >= 7) return '[PHONE]';
-    return match;
-  });
+  result = result.replace(PHONE_PATTERN, (match) => {});
   return result;
 }
killedBy: redactPii redacts phone number
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[PHONE]"
Received string:    "Callundefinednow"

[Killed] Regex
packages/sanitize-utils/src/sanitize-utils.ts:403:34
   // Phone after email/card to avoid false positives
   result = result.replace(PHONE_PATTERN, (match) => {
     // Only replace if it looks sufficiently phone-like (at least 7 digits)
-    const digits = match.replace(/\D/g, '');
+    const digits = match.replace(/\d/g, '');
     if (digits.length >= 7) return '[PHONE]';
     return match;
killedBy: redactPii redacts phone number
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[PHONE]"
Received string:    "Call 07700900000 now"

[Killed] EqualityOperator
packages/sanitize-utils/src/sanitize-utils.ts:404:9
   result = result.replace(PHONE_PATTERN, (match) => {
     // Only replace if it looks sufficiently phone-like (at least 7 digits)
     const digits = match.replace(/\D/g, '');
-    if (digits.length >= 7) return '[PHONE]';
+    if (digits.length < 7) return '[PHONE]';
     return match;
   });
killedBy: redactPii redacts phone number
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[PHONE]"
Received string:    "Call 07700900000 now"

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:404:9
   result = result.replace(PHONE_PATTERN, (match) => {
     // Only replace if it looks sufficiently phone-like (at least 7 digits)
     const digits = match.replace(/\D/g, '');
-    if (digits.length >= 7) return '[PHONE]';
+    if (false) return '[PHONE]';
     return match;
   });
killedBy: redactPii redacts phone number
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[PHONE]"
Received string:    "Call 07700900000 now"

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:413:72
 /**
  * Safe integer parse: returns null if not a valid integer.
  */
-export function safeParseInt(s: string, radix?: number): number | null {
-  const trimmed = s.trim();
-  if (trimmed === '') return null;
-  const r = radix ?? 10;
-  const parsed = parseInt(trimmed, r);
-  if (isNaN(parsed)) return null;
-  // Verify the whole string was consumed (no trailing junk for base 10)
-  if (r === 10 && !/^-?\d+$/.test(trimmed)) return null;
-  return parsed;
-}
+export function safeParseInt(s: string, radix?: number): number | null {}
 
 /**
killedBy: safeParseInt parses "42" → 42
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 42
Received: undefined

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:414:19
  * Safe integer parse: returns null if not a valid integer.
  */
 export function safeParseInt(s: string, radix?: number): number | null {
-  const trimmed = s.trim();
+  const trimmed = s;
   if (trimmed === '') return null;
   const r = radix ?? 10;
killedBy: safeParseInt trims whitespace before parsing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 42
Received: null

[Killed] EqualityOperator
packages/sanitize-utils/src/sanitize-utils.ts:415:7
  */
 export function safeParseInt(s: string, radix?: number): number | null {
   const trimmed = s.trim();
-  if (trimmed === '') return null;
+  if (trimmed !== '') return null;
   const r = radix ?? 10;
   const parsed = parseInt(trimmed, r);
killedBy: safeParseInt parses "42" → 42
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 42
Received: null

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:415:7
  */
 export function safeParseInt(s: string, radix?: number): number | null {
   const trimmed = s.trim();
-  if (trimmed === '') return null;
+  if (true) return null;
   const r = radix ?? 10;
   const parsed = parseInt(trimmed, r);
killedBy: safeParseInt parses "42" → 42
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 42
Received: null

[Killed] LogicalOperator
packages/sanitize-utils/src/sanitize-utils.ts:416:13
 export function safeParseInt(s: string, radix?: number): number | null {
   const trimmed = s.trim();
   if (trimmed === '') return null;
-  const r = radix ?? 10;
+  const r = radix && 10;
   const parsed = parseInt(trimmed, r);
   if (isNaN(parsed)) return null;
killedBy: safeParseInt returns null for "1.5" (not integer)
statusReason: Error: expect(received).toBeNull()

Received: 1

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:418:7
   if (trimmed === '') return null;
   const r = radix ?? 10;
   const parsed = parseInt(trimmed, r);
-  if (isNaN(parsed)) return null;
+  if (true) return null;
   // Verify the whole string was consumed (no trailing junk for base 10)
   if (r === 10 && !/^-?\d+$/.test(trimmed)) return null;
killedBy: safeParseInt parses "42" → 42
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 42
Received: null

[Survived] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:418:7
   if (trimmed === '') return null;
   const r = radix ?? 10;
   const parsed = parseInt(trimmed, r);
-  if (isNaN(parsed)) return null;
+  if (false) return null;
   // Verify the whole string was consumed (no trailing junk for base 10)
   if (r === 10 && !/^-?\d+$/.test(trimmed)) return null;

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:420:7
   const parsed = parseInt(trimmed, r);
   if (isNaN(parsed)) return null;
   // Verify the whole string was consumed (no trailing junk for base 10)
-  if (r === 10 && !/^-?\d+$/.test(trimmed)) return null;
+  if (false) return null;
   return parsed;
 }
killedBy: safeParseInt returns null for "1.5" (not integer)
statusReason: Error: expect(received).toBeNull()

Received: 1

[Killed] BooleanLiteral
packages/sanitize-utils/src/sanitize-utils.ts:420:19
   const parsed = parseInt(trimmed, r);
   if (isNaN(parsed)) return null;
   // Verify the whole string was consumed (no trailing junk for base 10)
-  if (r === 10 && !/^-?\d+$/.test(trimmed)) return null;
+  if (r === 10 && /^-?\d+$/.test(trimmed)) return null;
   return parsed;
 }
killedBy: safeParseInt parses "42" → 42
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 42
Received: null

[Killed] BlockStatement
packages/sanitize-utils/src/sanitize-utils.ts:427:58
 /**
  * Safe float parse: returns null if not a valid float.
  */
-export function safeParseFloat(s: string): number | null {
-  const trimmed = s.trim();
-  if (trimmed === '') return null;
-  const parsed = parseFloat(trimmed);
-  if (isNaN(parsed)) return null;
-  // Verify whole string is a valid float
-  if (!/^-?(\d+\.?\d*|\.\d+)([eE][+-]?\d+)?$/.test(trimmed)) return null;
-  return parsed;
-}
+export function safeParseFloat(s: string): number | null {}
 
killedBy: safeParseFloat parses "3.14" → 3.14
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] MethodExpression
packages/sanitize-utils/src/sanitize-utils.ts:428:19
  * Safe float parse: returns null if not a valid float.
  */
 export function safeParseFloat(s: string): number | null {
-  const trimmed = s.trim();
+  const trimmed = s;
   if (trimmed === '') return null;
   const parsed = parseFloat(trimmed);
killedBy: safeParseFloat safeParseFloat: 1 leading/trailing spaces trimmed
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: null

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:431:7
   const trimmed = s.trim();
   if (trimmed === '') return null;
   const parsed = parseFloat(trimmed);
-  if (isNaN(parsed)) return null;
+  if (true) return null;
   // Verify whole string is a valid float
   if (!/^-?(\d+\.?\d*|\.\d+)([eE][+-]?\d+)?$/.test(trimmed)) return null;
killedBy: safeParseFloat parses "3.14" → 3.14
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: null

[Survived] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:431:7
   const trimmed = s.trim();
   if (trimmed === '') return null;
   const parsed = parseFloat(trimmed);
-  if (isNaN(parsed)) return null;
+  if (false) return null;
   // Verify whole string is a valid float
   if (!/^-?(\d+\.?\d*|\.\d+)([eE][+-]?\d+)?$/.test(trimmed)) return null;

[Killed] BooleanLiteral
packages/sanitize-utils/src/sanitize-utils.ts:433:7
   const parsed = parseFloat(trimmed);
   if (isNaN(parsed)) return null;
   // Verify whole string is a valid float
-  if (!/^-?(\d+\.?\d*|\.\d+)([eE][+-]?\d+)?$/.test(trimmed)) return null;
+  if (/^-?(\d+\.?\d*|\.\d+)([eE][+-]?\d+)?$/.test(trimmed)) return null;
   return parsed;
 }
killedBy: safeParseFloat parses "3.14" → 3.14
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: null

[Killed] ConditionalExpression
packages/sanitize-utils/src/sanitize-utils.ts:433:7
   const parsed = parseFloat(trimmed);
   if (isNaN(parsed)) return null;
   // Verify whole string is a valid float
-  if (!/^-?(\d+\.?\d*|\.\d+)([eE][+-]?\d+)?$/.test(trimmed)) return null;
+  if (true) return null;
   return parsed;
 }
killedBy: safeParseFloat parses "3.14" → 3.14
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: null
